Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/first_steps/accessibility.*.po
Languages: es, ru

source: [[!meta title="Accessibility"]]
es: [[!meta title="Accesibilidad"]]
ru: [[!meta title="Доступность"]]

source: Tails and the GNOME desktop include assistive technologies to support users with various impairments and special needs, and to interact with common assistive devices.
es: Tails y el escritorio de GNOME incluyen tecnologías de asistencia para apoyar a los usuarios con diversos impedimentos y necesidades especiales e interactuar con dispositivos de asistencia comunes.
ru: Tails и рабочий стол GNOME включают технологии поддержки пользователей с ограниченными возможностями и особыми потребностями, а также взаимодействия с распространёнными поддерживающими устройствами.

source: Universal access menu
es: Menú de acceso universal
ru: Универсальное меню

source: You can activate most of these technologies from the universal access menu (the
es: Puedes activar la mayoría de estas tecnologías desde el menú de acceso universal (el
ru: Вы можете активировать большинство этих технологий из меню (значок

source: [[!img lib/preferences-desktop-accessibility.png alt="Universal Access" class="symbolic" link="no"]]
es: [[!img lib/preferences-desktop-accessibility.png alt="Acceso Universal" class="symbolic" link="no"]]
ru: [[!img lib/preferences-desktop-accessibility.png alt="Универсальное меню" class="symbolic" link="no"]]

source: icon which looks like a person) in the top bar:
es: ícono que se asemeja a una persona) en la barra superior:
ru: с изображением человечка) на верхней панели:

source: [[!img desktop/accessibility.png link="no" alt="Universal Access menu with the following options (disabled by default): High Contrast, Zoom, Large Text, Screen Reader, Screen Keyboard, Visual Alters, Sticky Keys, Slow Keys, Bounce Keys, and Mouse Keys"]]
es: [[!img desktop/accessibility.png link="no" alt="Menú de acceso universal con las siguientes opciones (desactivadas por defecto): Contraste elevado, Zoom, Texto Grande, Lector de Pantalla, Teclado Visual, Alertas visuales, Teclas permanentes, Teclas Lentas, Teclas de Rebote y Teclas del ratón"]]

source: These technologies are documented in more details in the [GNOME universal access documentation](https://help.gnome.org/users/gnome-help/stable/a11y.html).
es: Estas tecnologías son documentadas en más detalle en la [documentación GNOME para el acceso universal(https://help.gnome.org/users/gnome-help/stable/a11y.html.es).
ru: Эти опции подробно описаны в [документации GNOME](https://help.gnome.org/users/gnome-help/stable/a11y.html).

source: Keyboard shortcuts
es: Atajos de teclado
ru: Сочетания клавиш

source: <table> <tr><td>Turn screen reader on or off</td><td>Alt+Super+S</td></tr> <tr><td>Turn zoom on or off</td><td>Alt+Super+8</td></tr> </table>
es: <table> <tr><td>Prender o apagar el lector de pantalla</td><td>Alt+Super+S</td></tr> <tr><td>Prender o apagar el zoom</td><td>Alt+Super+8</td></tr> </table>
ru: <table> <tr><td>Включить или выключить экранного диктора</td><td>Alt+Super+S</td></tr> <tr><td>Включить или выключить масштабирование</td><td>Alt+Super+8</td></tr> </table>

source: To access the universal access menu using the keyboard:
es: Para acceder al menú de acceso universal usando el teclado:
ru: Чтобы открыть универсальное меню с клавиатуры:

source: Press <span class="keycap">Ctrl+Alt+Tab</span> to move the keyboard focus to the top bar.
es: Presiona <span class="keycap">Ctrl+Alt+Tab</span> para mover el foco del teclado a la barra superior.
ru: Нажмите <span class="keycap">Ctrl+Alt+Tab</span> для управления верхней панелью с клавиатуры.

source: Use the arrow keys on the keyboard to select the universal access menu.
es: Usa las teclas de flechas en el teclado para seleccionar el menú de acceso universal.
ru: Используйте кнопки стрелок, чтобы выбрать универсальное меню.

source: Press <span class="bold">Enter</span> to open the menu.
es: Presiona <span class="bold">Enter</span> para abrir el menú.
ru: Для открытия меню нажмите <span class="bold">Enter</span>.

source: Use the up and down arrow keys to select items in the menu.
es: Usa las teclas de flechas arriba y abajo para seleccionar ítems en el menú.
ru: Используйте кнопки вверх и вниз для выбора пунктов меню.

source: Press <span class="bold">Space</span> to toggle the selected item.
es: Presione <span class="bold">Espacio</span> para alterar el elemento seleccionado.
ru: Для переключения пункта меню нажмите <span class="bold">пробел</span>.

source: Press <span class="bold">Esc</span> to close the menu.
es: Presiona <span class="bold">Esc</span> para cerrar el menú.
ru: Для выхода из меню нажмите <span class="bold">Esc</span>.

source: Screen reader
es: Lector de pantalla
ru: Экранный диктор

source: To hear screen elements spoken to you, you can activate the <span class="guilabel">Screen Reader</span> accessibility feature.
es: Para que el ordenador diga los elementos de la pantalla puedes activar la función de accesibilidad <span class="guilabel">Lector de Pantalla</span>.
ru: Для восприятия элементов экрана на слух можно активировать функцию <span class="guilabel">Экранный диктор</span>.

source: For more detailed documentation refer to the official [<span class="application">Orca</span> Screen Reader documentation](https://help.gnome.org/users/orca/stable/).
es: Para más información detallada revisa la documentación del Lector de Pantalla [<span class="application">Orca</span> documentation](https://help.gnome.org/users/orca/stable/).
ru: Подробности см. в [документации <span class="application">Orca</span>](https://help.gnome.org/users/orca/stable/).

source: <p>The screen reader takes around 10 seconds to start.</p>
es: <p>El lector de pantalla toma alrededor de 10 segundos para iniciar.</p>
ru: <p>Для запуска экранного диктора нужно примерно 10 секунд.</p>

source: <p>The screen reader does not work with the <span class="application">Unsafe Browser</span>.</p>
es: <p>El lector de pantalla no funciona con el <span class="application">Navegador Inseguro</span>.</p>
ru: <p>Экранный диктор не работает с <span class="application">небезопасным браузером</span>.</p>

source: Screen keyboard
es: Teclado en pantalla
ru: Экранная клавиатура

source: If you prefer a pointing device over the keyboard, you can activate the <span class="guilabel">Screen Keyboard</span> accessibility feature.
es: Si prefieres un puntero sobre el teclado puedes activar la función de accesibilidad <span class="guilabel">Teclado en Pantalla</span>.
ru: Если вы предпочитаете устройство управления курсором, а не клавиатуру, можно активировать специальную функцию <span class="guilabel">Экранная клавиатура</span>.

source: For more detailed documentation refer to the official [<span class="application">GNOME</span> Screen Keyboard documentation](https://help.gnome.org/users/gnome-help/stable/keyboard-osk.html.en).
es: Para más información detallada revisa la [documentación oficial del Teclado en Pantalla <span class="application">GNOME</span>](https://help.gnome.org/users/gnome-help/stable/keyboard-osk.html.en).
ru: Подробнее см. в [документации экранной клавиатуры <span class="application">GNOME</span>](https://help.gnome.org/users/gnome-help/stable/keyboard-osk.html.ru).

source: <span class="application">Dasher</span> graphical text entry application
es: <span class="application">Dasher</span> aplicación gráfica de entrada de texto
ru: Программа графического ввода текста <span class="application">Dasher</span>

source: If you are operating a computer one-handed (by joystick, touchscreen, or mouse) or zero-handed (by head-mouse or eyetracker), you can use the <span class="application">[Dasher](http://www.inference.phy.cam.ac.uk/dasher/)</span> graphical predictive text entry application.
es: Si operas la computadora con una sola mano (por joystick, pantalla táctil, o ratón) o sin manos (por cabeza-ratón o eyetracker), puedes utilizar el <span class="application">[Dasher](http://www.inference.phy.cam.ac.uk/dasher/)</span> aplicación gráfica de entrada de texto predictivo.
ru: Если вы работаете на компьютере одной рукой (с помощью джойстика, сенсорного экрана или мыши) или без рук (с помощью головной мыши или айтрекера), можно использовать <span class="application">[Dasher](https://www.inference.org.uk/dasher/)</span>, программу для графического ввода текста.

source: <span class="application">Dasher</span> is available from <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Universal Access</span>&nbsp;▸ <span class="guimenuitem">Dasher</span></span>.
es: <span class="application">Dasher</span> está disponible desde <span class="menuchoice"> <span class="guimenu">Aplicaciones</span>&nbsp;▸ <span class="guisubmenu">Acceso Universal</span>&nbsp;▸ <span class="guimenuitem">Dasher</span></span>.
