Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/first_steps/bug_reporting.*.po
Languages: it

source: [[!meta title="Reporting an error"]]
it: [[!meta title="Segnalare un errore"]]

source: In this documentation we use the term *bug* to refer to a software error.
it: In questa documentazione utilizziamo il termine *bug* per fare riferimento a un errore software.

source: Reporting bugs is a great way of helping us improve Tails.
it: Segnalare dei bug è un ottimo modo per aiutarci a migliorare Tails.

source: Remember that **the more effectively you report a bug**, the more likely we are to fix it.
it: Ricorda che **più accuratamente segnali un bug**, più è probabile che lo risolveremo.

source: <h1 id="already-known">Check if the bug is already known</h1>
it: <h1 id="already-known">Controlla se il bug è già noto</h1>

source: Have a look at:
it: Dai un'occhiata a:

source: the [[list of known issues|support/known_issues]]
it: la [[lista dei problemi noti|support/known_issues]]

source: the [[!tails_gitlab groups/tails/-/milestones desc="list of things that will be fixed or improved in the next release"]]
it: l' [[!tails_gitlab groups/tails/-/milestones desc="elenco delle cose che verranno corrette o migliorate nella prossima versione"]]

source: <h1 id="useful-bug-report">How to write a useful bug report</h1>
it: <h1 id="useful-bug-report">Come scrivere un utile rapporto su un bug</h1>

source: The first aim of a bug report is to **tell the developers exactly how to reproduce the failure**, so try to reproduce the issue yourself and describe how you did that.
it: Il primo obiettivo di un rapporto su un bug è **spiegare alle persone che sviluppano Tails come replicare esattamente l'errore**, quindi cerca tu di replicare l'errore e descrivi come hai fatto.

source: If that is not possible, try to **describe what went wrong in detail**. Write down the error messages, especially if they have numbers.
it: Se ciò non risulta possibile, cerca di **descrivere nei dettagli ciò che non funziona**. Annota i messaggi d'errore e scrivili nel rapporto, specialmente se hanno numeri.

source: Write **clearly and be precise**. Say what you mean, and make sure it cannot be misinterpreted.
it: Scrivi in modo **chiaro e preciso**. Spiega ciò che intendi dire, e assicurati che non possa essere interpretato male.

source: Be ready to provide extra information if the developers need it. If they did not need it, they would not be asking for it.
it: Aspettati di fornire informazioni supplementari se le persone che sviluppano Tails ne hanno bisogno. Se non ne avessero bisogno, non te le chiederebbero.

source: You can also refer to the great [How to Report Bugs Effectively](http://www.chiark.greenend.org.uk/~sgtatham/bugs.html), by Simon Tatham.
it: Puoi anche usare come riferimento l'ottimo [Come segnalare bug efficacemente](https://www.chiark.greenend.org.uk/~sgtatham/bugs-it.html), di Simon Tatham.

source: <h1 id="whisperback">Use WhisperBack</h1>
it: <h1 id="whisperback">Usa WhisperBack</h1>

source: **WhisperBack is an application written specifically to report bugs anonymously from inside Tails. If you are not able to use WhisperBack, see the [[special cases|bug_reporting#special-cases]].**
it: **WhisperBack è un'applicazione scritta appositamente per segnalare anonimamente i bug dall'interno di Tails. Se non siete in grado di usare WhisperBack, vedete i [[casi speciali casi|bug_reporting#special-cases]].**

source: WhisperBack will help you fill-up a bug report, including relevant technical details and send it to us encrypted and through Tor.
it: WhisperBack ti aiuterà a compilare un rapporto sul bug, inclusi i dettagli tecnici rilevanti, e lo invierà a noi in forma cifrata via Tor.

source: Start WhisperBack
it: Avvia WhisperBack

source: Write the report
it: Scrivi il rapporto

source: WhisperBack lets you give plenty of useful information about your bug:
it: WhisperBack ti permette di fornire numerose informazioni utili riguardo al tuo bug:

source: **Summary** a summary of the bug, try to be short, clear and informative
it: **Sommario** un riepilogo del bug, possibilmente breve, chiaro ed esplicito

source: **Name of the affected software**
it: **Nome del software coinvolto**

source: **Exact steps to reproduce the error**
it: **I passi esatti per replicare l'errore**

source: **Actual result and description of the error**
it: **Risultato effettivo e descrizione dell'errore**

source: **Desired result**
it: **Risultato atteso**

source: You can also have a look at the <span class="guilabel">technical details to include</span> in your bug report. It will give us information about your hardware, your version of Tails and the startup process.
it: Puoi inoltre dare un'occhiata ai <span class="guilabel">dettagli tecnici da includere</span> nel tuo rapporto sul bug. Questi ci forniranno informazioni sul tuo hardware, sulla tua versione di Tails e sul processo d'avvio.

source: [[!inline pages="support/talk/languages.inline" raw="yes" sort="age"]]
it: [[!inline pages="support/talk/languages.inline.it" raw="yes" sort="age"]]

source: <h2 id="screenshot">Take a screenshot</h2>
it: <h2 id="screenshot">Fai uno screenshot</h2>

source: It might be helpful to include a screenshot with your bug report.
it: Potrebbe essere d'aiuto aggiungere uno screenshot al tuo rapporto sul bug.

source: To take a screenshot of the entire desktop, press <span class="keycap">Print Screen</span>.
it: Per fare uno screenshot dello schermo intero, premi <span class="keycap">Print Screen</span>.

source: To take a screenshot of a single window, press <span class="keycap">Alt + Print Screen</span>.
it: Per fare uno screenshot di una sola finestra, premi <span class="keycap">Alt + Print Screen</span>.

source: To take a screenshot of an area you select, press <span class="keycap">Shift + Print Screen</span>.
it: Per fare uno screenshot di una sola parte dello schermo, premi <span class="keycap">Shift + Print Screen</span>.

source: The screenshot will automatically be saved in the <span class="filename">Pictures</span> folder located in your <span class="filename">Home</span> folder. The file name will begin with the word <span class="filename">Screenshot</span>.
it: Lo screenshot verrà salvato automaticamente nella <span class="filename">Pictures</span> cartella che si trova nella tua <span class="filename">Home</span> folder. Il nome del file inizierà con la parola <span class="filename">Screenshot</span>.

source: You can also take a screenshot using <span class="application">GNOME Screenshot</span>.
it: Puoi fare uno screenshot anche usando <span class="application">GNOME Screenshot</span>.

source: You can upload the screenshot to an [encrypted Up1 host](https://github.com/Upload/Up1) such as the one available at:
it: Puoi caricare lo screenshot a un [encrypted Up1 host](https://github.com/Upload/Up1) come quello disponibile a:

source: Make sure to include in your bug report a link to the screenshot.
it: Assicurati di includere nella segnalazione del bug un link allo screenshot.

source: Optional email address
it: Indirizzo email facoltativo

source: Giving us an email address allows us to contact you to clarify the problem. This is needed for the vast majority of the reports we receive as most reports without any contact information are useless. But note that it also provides an opportunity for eavesdroppers, like your email or Internet provider, to confirm that you are using Tails.
it: Fornire un indirizzo email ci permetterà di contattarti per delucidazioni sul problema. Questo si rende necessario per la vasta maggioranza dei rapporti che riceviamo, perché la maggior parte dei rapporti che non contengono informazioni di contatto sono inutili. Ma ti facciamo notare che questo dà anche l'opportunità a orecchie indiscrete, come quelle del tuo fornitore di posta elettronica o del tuo fornitore di accesso a Internet, di ottenere una conferma del fatto che tu stia utilizzando Tails.

source: Optional OpenPGP key
it: Chiave OpenPGP facoltativa

source: You can also indicate an OpenPGP key corresponding to this email address. You can either give:
it: Puoi anche indicare una chiave OpenPGP corrispondente al tuo indirizzo email. Puoi fornire a tua scelta:

source: a **key ID**, if the key is available on public key servers
it: l'**identificativo della chiave**, se la chiave è disponibile sui server di chiavi pubbliche

source: a **link to the key**, if the key is available on the web
it: un **collegamento alla chiave**, se la chiave è disponibile sul web

source: a **public key block**, if the key is not publicly available
it: il **blocco chiave pubblica**, se la chiave non è disponibile pubblicamente

source: Send your report
it: Invia il tuo rapporto

source: Once you are done writing your report, send it by clicking the *Send* button.
it: Una volta compilato il tuo rapporto, invialo facendo clic sul bottone *Invia*.

source: Once your email has been sent correctly you will get the following notification: <span class="guilabel">Your message has been sent</span>.
it: Una volta che la tua email è stata inviata correttamente otterrai la seguente notifica: <span class="guilabel">Il tuo messaggio è stato inviato</span>.

source: <h1 id="special-cases">If you cannot use <span class="application">WhisperBack</span></h1>
it: <h1 id="special-cases">Se non puoi usare <span class="application">WhisperBack</span></h1>

source: You might not always be able to use WhisperBack. In those cases, you can also send your bug report by [[email|support/talk]] directly.
it: A volte potresti non essere in grado di usare WhisperBack. In questi casi, puoi anche inviare il tuo rapporto bug direttamente via [[email|support/talk]].

source: Note that if you send the report yourself, it might not be anonymous unless you take special care (for example, using Tor with a throw-away email account).
it: Ti facciamo notare che se lo invii in questo modo, il rapporto potrebbe non essere anonimo a meno che tu non prenda misure particolari (per esempio, usare Tor con un account email usa-e-getta).

source: <h2 id="no-internet-access">No Internet access</h2>
it: <h2 id="no-internet-access">Nessun accesso Internet</h2>

source: If you are not able to connect to the Internet from Tails, you can try following our [[instructions on troubleshooting Wi-Fi|doc/anonymous_internet/no-wifi]] to fix your Internet connection.
it: Se non ti è possibile connetterti a Internet da Tails, puoi provare seguendo le nostre [[istruzioni per la risoluzione dei problemi Wi-Fi|doc/anonymous_internet/no-wifi]] per correggere la connessione a Internet.

source: WhisperBack won't be able to send your bug report if you are not connected to the Internet.
it: WhisperBack non sarà in grado di inviare la segnalazione del bug se non sei connesso a Internet.

source: The following steps can be used as an alternative method to send your bug report:
it: I passaggi seguenti possono essere utilizzati come metodo alternativo per inviare la segnalazione del bug:

source: In Tails, start WhisperBack
it: Da Tails, avvia WhisperBack

source: In the bug report window, expand "technical details to include"
it: Nella finestra del rapporto bug, fai clic sulla linguetta "Dettagli tecnici da includere nel report"

source: Copy everything in the "debugging info" box
it: Copia l'intero contenuto della sezione "informazioni di debug"

source: Paste it to another document (using the *Text Editor* for instance)
it: Incollalo in un altro documento (utilizzando ad esempio l'"editor di testo")

source: Save the document on a USB stick
it: Salva il documento su una chiavetta USB

source: Boot into a system with Internet connection and send your report
it: Avvia un sistema provvisto di connessione Internet e invia il tuo rapporto

source: <h2 id="does-not-start">Tails does not start</h2>
it: <h2 id="does-not-start">Tails non si avvia</h2>

source: For troubleshooting instructions in case Tails fails to start, refer to our installation instructions on:
it: Per istruzioni sulla risoluzione dei problemi nel caso in cui Tails non si avvii, fai riferimento alle nostre istruzioni di installazione:

source: [[Starting a PC on a USB stick|doc/first_steps/start/pc]]
it: [[Avviare il PC da una chiavetta USB|doc/first_steps/start/pc]]

source: [[Starting a Mac on a USB stick|doc/first_steps/start/mac]]
it: [[Avviare un Mac da una chiavetta USB|doc/first_steps/start/mac]]

source: <h1 id="debian">Reproducing the bug in Debian (for advanced users)</h1>
it: <h1 id="debian">Riprodurre il bug in Debian (per utenti esperte)</h1>

source: It is very useful for us to know if your bug only affects Tails or also affects Debian, on which Tails is based.
it: Per noi è molto utile sapere se il tuo bug riguarda solo Tails o riguarda anche Debian, su cui Tails è basato.

source: Doing so takes much more time so, in doubt, report your bug as instructed earlier and wait for guidance from our help desk.
it: Fare questa verifica richiede molto più tempo, quindi, nel dubbio, segnala il tuo bug come ti abbiamo indicato prima e attendi istruzioni dal nostro help desk.

source: If your bug also affects Debian *stable* then it will have to be fixed in Debian directly and not in Tails.
it: Se il tuo bug riguarda anche Debian *stable* allora dovrà venire risolto direttamente in Debian e non in Tails.

source: If your bug affects Debian *stable* but not Debian *testing* then it might have been solved already in Debian.
it: Se il tuo bug riguarda Debian *stable* ma non Debian *testing* allora potrebbe essere già stato risolto in Debian.

source: Debian also distributes images (*Debian live*) that you can install on a USB stick using the same installation procedure as for installing Tails.
it: Debian distribuisce anche immagini (*Debian live*) che puoi installare su una chiavetta USB usando la stessa procedura d'installazione usata per installare Tails.

source: Debian stable
it: Debian stabile

source: Images for the stable version of Debian, on which Tails is based, are available on:
it: Immagini per la versione stabile di Debian, sulla quale è basato Tails, sono disponibili su:

source: Download the `gnome+nonfree.iso` image to have the GNOME desktop and all the non-free firmware for better hardware compatibility.
it: Scarica l'immagine `gnome+nonfree.iso` per avere il desktop GNOME e tutto il firmware non libero per una migliore compatibilità hardware.

source: Debian testing
it: Versione testing di Debian

source: Images for the testing version of Debian are available on:
it: Immagini per la versione testing di Debian sono disponibili su:
