Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/encryption_and_privacy/encrypted_volumes.*.po
Languages: ru

source: [[!meta title="Creating and using LUKS encrypted volumes"]]
ru: [[!meta title="Создание и использование зашифрованных томов LUKS"]]

source: Introduction to <span class="application">LUKS</span>
ru: Общие сведения о <span class="application">LUKS</span>

source: <p>The simplest way to carry around the documents that you want to use with Tails encrypted is to use the encrypted [[Persistent Storage|first_steps/persistence]].</p>
ru: <p>Самый простой способ сохранять зашифрованные документы в Tails — использовать зашифрованное [[Постоянное хранилище|first_steps/persistence]].</p>

source: You can create other encrypted volumes using <span class="application">LUKS</span> to encrypt, for example, another USB stick or an external hard disk. <span class="application">LUKS</span> is the standard for disk encryption in Linux.
ru: Для создания зашифрованных томов (например, флешек, внешних жёстких дисков) можно использовать <span class="application">LUKS</span>. Это стандарт шифрования дисков в Linux.

source: <span class="application">GNOME Disks</span> allows you to create encrypted volumes.
ru: Утилита <span class="application">Диски</span> в GNOME позволяет создавать зашифрованные тома.

source: The GNOME desktop allows you to open encrypted volumes.
ru: Их можно открыть на рабочем столе GNOME.

source: Comparison between <span class="application">LUKS</span> and <span class="application">VeraCrypt</span>
ru: Сравнение <span class="application">LUKS</span> и <span class="application">VeraCrypt</span>

source: You can also open <span class="application">VeraCrypt</span> encrypted volumes in Tails. <span class="application">VeraCrypt</span> is a disk encryption tool for Windows, macOS, and Linux. [[See our documentation about <span class="application">VeraCrypt</span>.|veracrypt]]
ru: Вы можете открывать в Tails тома, зашифрованные с помощью <span class="application">VeraCrypt</span>. Это шифровальная программа, которая работает в Windows, macOS и Linux. [[См. наше описание <span class="application">VeraCrypt</span>.|veracrypt]]

source: [[!inline pages="doc/encryption_and_privacy/luks_vs_veracrypt.inline" raw="yes" sort="age"]]
ru: [[!inline pages="doc/encryption_and_privacy/luks_vs_veracrypt.inline.ru" raw="yes" sort="age"]]

source: Create an encrypted partition
ru: Создание зашифрованного раздела

source: Identify your external storage device
ru: Выбор внешнего носителя данных

source: <span class="application">Disks</span> lists all the current storage devices on the left side of the screen.
ru: В левой части окна утилиты <span class="application">Диски</span> видны все подключённые носители данных.

source: Plug in the external storage device that you want to use.
ru: Подключите внешний носитель данных.

source: A new device appears in the list of storage devices. Click on it:
ru: В списке слева появится новое устройство. Щёлкните по нему:

source: 1. Check that the description of the device on the right side of the screen corresponds to your device: its brand, its size, etc.
ru: 1. Убедитесь, что описание в правой части окна соответствует вашему устройству: модель, объём и т.д.

source: Format the device
ru: Форматирование носителя

source: In the <span class="guilabel">Format Disk</span> dialog:
ru: Появится диалог <span class="guilabel">Форматировать диск</span>.

source: If you want to securely erase all data on the device, choose to <span class="guilabel">Overwrite existing data with zeroes</span> in the <span class="guilabel">Erase</span> drop-down list.
ru: Если хотите надёжно удалить все данные с устройства, в раскрывающемся списке <span class="guilabel">Очистить</span> выберите <span class="guilabel">Перезаписывать существующие данные нулями</span>.

source: Choose <span class="guilabel">Compatible with all systems and devices (MBR/DOS)</span> in the <span class="guilabel">Partitioning</span> drop-down list.
ru: Выберите в раскрывающемся списке <span class="guilabel">Разметка</span> вариант <span class="guilabel">Совместимо со всеми системами и устройствами (MBR / DOS)</span>.

source: In the confirmation dialog, make sure that the device is correct. Click <span class="bold">Format</span> to confirm.
ru: В диалоговом окне убедитесь, что устройство выбрано верно. Нажмите <span class="bold">Форматировать</span> для подтверждения.

source: Create a new encrypted partition
ru: Создание нового зашифрованного раздела

source: Now the schema of the partitions in the middle of the screen shows an empty device:
ru: Теперь схема разделов в середине экрана показывает пустое устройство:

source: Click on the <span class="guimenu">[[!img lib/list-add.png alt="Create partition" class="symbolic" link="no"]]</span> button to create a new partition on the device.
ru: Нажмите кнопку <span class="guimenu">[[!img lib/list-add.png alt="Создать раздел" class="symbolic" link="no"]]</span>, чтобы создать новый раздел на устройстве.

source: 1. Configure the various settings of your new partition in the partition creation assistant:
ru: 1. Настройте новый раздел в помощнике по созданию разделов:

source: In the <span class="guilabel">Create Partition</span> screen:
ru: В окне <span class="guilabel">Создать раздел</span>:

source: <span class="guilabel">Partition Size</span>: you can create a partition on the whole device or only on part of it.
ru: <span class="guilabel">Размер раздела</span>. Можно создать раздел, занимающий всё устройство или только его часть.

source: In the example below, we are creating a partition of 4.0 GB on a device of 8.1 GB.
ru: В этом примере мы создадим раздел 4,0 Гб на устройстве 8,1 Гб.

source: In the <span class="guilabel">Format Volume</span> screen:
ru: В окне <span class="guilabel">Форматировать том</span>:

source: <span class="guilabel">Volume Name</span>: you can give a name to the partition. This name remains invisible until the partition is open but can help you to identify it during use.
ru: <span class="guilabel">Имя тома</span>. Вы можете дать название разделу. Оно остаётся невидимым до тех пор, пока раздел не будет открыт, и может помочь вам идентифицировать его во время работы.

source: <span class="guilabel">Erase</span>: you can choose to securely erase all data on the partition.
ru: <span class="guilabel">Очистить</span>. Можно удалить все данные раздела надёжным способом.

source: <div class="caution"> <p>Secure deletion does not work as expected on USB sticks and SSDs (Solid-State Drives). Choose instead to overwrite existing data on the whole device when [[formatting the device|encrypted_volumes#format]].</p> <p>See also our [[warning about secure deletion on USB sticks and SSDs|secure_deletion#usb_and_ssd]].</p> </div>
ru: <класс div="caution"> <p>Безопасное удаление не работает должным образом на флешках и SSD (твердотельных накопителях). Вместо этого при [[форматировании устройства|encrypted_volumes#format]] выбирайте перезапись существующих данных на всём устройстве.</p> <p>См. также наши [[рекомендации о безопасном удалении данных на флешках и твердотельных накопителях|secure_deletion#usb_and_ssd]].</p> </div>

source: <span class="guilabel">Type</span>: choose <span class="guilabel">Internal disk for use with Linux systems only (Ext4)</span> and <span class="guilabel">Password protect volume (LUKS)</span>.
ru: <span class="guilabel">Тип</span>. Выберите <span class="guilabel">Внутренний диск для использования только с системами Linux (Ext4)</span> и <span class="guilabel">Защищённый паролем том (LUKS)</span>.

source: In the <span class="guilabel">Set Password</span> screen:
ru: В окне <span class="guilabel">Установить пароль</span>:

source: <span class="guilabel">Password</span>: type a passphrase for the encrypted partition and repeat it to confirm.
ru: <span class="guilabel">Пароль.</span> Введите пароль для зашифрованного тома и повторите его для подтверждения.

source: Then click <span class="bold">Create</span>.
ru: Затем нажмите <span class="bold">Создать</span>.

source: Creating the partition takes from a few seconds to a few minutes. After that, the new encrypted partition appears in the volumes on the device:
ru: Создание раздела занимает от нескольких секунд до нескольких минут. Примерно так выглядит результат:

source: If you want to create another partition in the free space on the device, click on the free space and then click on the <span class="guimenu">[[!img lib/list-add.png alt="Create partition" class="symbolic" link="no"]]</span> button again.
ru: Если хотите создать ещё один раздел в свободном пространстве на устройстве, щёлкните по свободному месту, а затем снова нажмите кнопку <span class="guimenu">[[!img lib/list-add.png alt="Создать раздел" class="symbolic" link="no"]]</span>.

source: Use the new partition
ru: Использование нового раздела

source: You can open this new partition from the sidebar of the file browser with the name you gave it.
ru: Новый раздел можно открыть в боковой панели файлового менеджера с той меткой (именем), которую вы ему присвоили.

source: After opening the partition with the file browser, you can also access it from the <span class="guimenu">Places</span> menu.
ru: После открытия раздела с помощью файлового менеджера вы также можете получить к нему доступ из меню <span class="guimenu">Места</span>.

source: Open an existing encrypted partition
ru: Открытие существующего зашифрованного раздела

source: When plugging in a device containing an encrypted partition, Tails does not open the partition automatically but you can do so from the file browser.
ru: При подключении устройства с зашифрованным разделом Tails не открывает этот раздел автоматически. Вы можете сделать это с помощью файлового менеджера.

source: Click on the encrypted partition that you want to open in the sidebar.
ru: В левой панели нажмите на зашифрованный раздел, который хотите открыть.

source: [[!img nautilus_encrypted.png link="no" alt="File browser with '4.0 GB Encrypted' entry in the sidebar"]]
ru: [[!img nautilus_encrypted.png link="no" alt="Файловый менеджер с зашифрованным томом"]]

source: Enter the passphrase of the partition in the password prompt and click <span class="bold">Unlock</span>.
ru: Введите пароль раздела в поле для ввода пароля и нажмите <span class="bold">Разблокировать</span>.

source: After opening the partition with the file browser, you can also access it from the <span class="guimenu">Places</span> menu.
ru: После открытия раздела с помощью файлового менеджера вы также можете получить к нему доступ из меню <span class="guimenu">Места</span> .

source: To close the partition after you finished using it, click on the <span class="guimenu">[[!img lib/media-eject.png alt="Eject" class="symbolic" link="no"]]</span> button next to the partition in the sidebar of the file browser.
ru: Чтобы закрыть раздел после окончания работы нажмите кнопку <span class="guimenu">[[!img lib/media-eject.png alt="Извлечь" class="symbolic" link="no"]]</span> рядом с разделом на боковой панели файлового менеджера.

source: Storing sensitive documents
ru: Хранение важных документов

source: Such encrypted volumes are not hidden. An attacker in possession of the device can know that there is an encrypted volume on it. Take into consideration that you can be forced or tricked to give out its passphrase.
ru: Описанные нами зашифрованные тома не скрыты от чужих глаз. Если злоумышленник получит физический доступ к устройству, он может выяснить, что на устройстве есть зашифрованный том. В определённых ситуациях вас могут заставить сообщить пароль или обманным путем завладеть им.

source: Opening encrypted volumes from other operating systems
ru: Открытие зашифрованных томов в других операционных системах

source: It is possible to open such encrypted volumes from other operating systems. But, doing so might compromise the security provided by Tails.
ru: Зашифрованные тома можно открывать и в других операционных системах. Но это может поставить под сомнение защиту, обеспечиваемую Tails.

source: For example, image thumbnails might be created and saved by the other operating system. Or, the contents of files might be indexed by the other operating system.
ru: Например, в другой операционной системе могут быть созданы (и сохранены) значки изображений. Содержимое файлов тоже может быть проиндексировано.

source: Change the passphrase of an existing encrypted partition
ru: Смена пароля зашифрованного раздела

source: 1. Plug in the external storage device containing the encrypted partition that you want to change the passphrase for.
ru: 1. Подключите внешний носитель с зашифрованным разделом, для которого вы хотите изменить пароль.

source: The device appears in the list of storage devices. Click on it:
ru: Устройство появится в списке носителей. Щёлкните по нему:

source: 1. Check that the description of the device on the right side of the screen corresponds to your device: its brand, its size, etc.
ru: 1. Убедитесь, что описание в правой части экрана соответствует вашему устройству: модель, объём и т.д.

source: Click on the partition displaying a [[!img lib/network-wireless-encrypted.png alt="padlock" class="symbolic" link="no"]] at the bottom-right corner.
ru: Нажмите на раздел со значком [[!img lib/network-wireless-encrypted.png alt="замочек" class="symbolic" link="no"]] в правом нижнем углу.

source: Click on the <span class="guimenu">
ru: Щёлкните по <span class="guimenu">

source: [[!img lib/system-run.png alt="Additional partition options" class="symbolic" link="no"]]
ru: кнопке [[!img lib/system-run.png alt="Дополнительные параметры раздела" class="symbolic" link="no"]]
