Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/encryption_and_privacy/secure_deletion.*.po
Languages: ru

source: [[!meta title="Securely deleting files and clean diskspace"]]
ru: [[!meta title="Надёжное удаление файлов и очистка дискового пространства"]]

source: Why use secure deletion?
ru: Зачем нужно надёжно удалять данные?

source: **Operating systems do not actually remove the contents of a file when it is deleted**, even after emptying the trash or explicitly removing the file, from the command line for example.
ru: **Операционные системы фактически не удаляют содержимое файла при его удалении**, даже после очистки корзины или явного удаления файла, например, из командной строки.

source: Likewise, reformatting, repartitioning or reimaging a system is not always guaranteed to write to every area of the disk, though all will cause the disk to appear empty or, in the case of reimaging, empty except for the files present in the image, to most software.
ru: Аналогично: переформатирование, разбиение на разделы или переустановка операционной системы не всегда гарантируют запись в каждую область диска. Все эти действия, впрочем, приведут к тому, что диск будет казаться пустым или почти пустым.

source: Warning about USB sticks and solid-state disks
ru: Оговорка о флешках и твердотельных накопителях

source: The only way to securely delete any data, even a single file, from a USB stick or an SSD (Solid-State Disk) is to [[securely erase the entire device|secure_deletion#erase-device]].
ru: Единственный способ безопасно удалить любые данные, даже один файл, с USB-накопителя или SSD (твердотельного накопителя) — [[надёжно очистить всё устройство|secure_deletion#erase-device]].

source: Securely delete files
ru: Надёжное удаление файлов

source: <p>Securely deleting files does not erase the potential backup copies of the file (for example LibreOffice creates backup copies that allow you to recover your work in case LibreOffice stops responding).</p>
ru: <p>Надёжное удаление файла ещё не означает удаление возможных резервных копий файла. Например, LibreOffice создает резервные копии, которые помогут восстановить работу, если программа зависнет.</p>

source: Open the <span class="application">Files</span> browser.
ru: Откройте файловый менеджер <span class="application">Файлы</span>.

source: Navigate to the folder containing the files that you want to delete.
ru: Перейдите в папку с файлами, которые хотите удалить.

source: Select the files that you want to delete with the mouse.
ru: С помощью мыши выберите файлы, которые хотите удалить.

source: Right-click (on Mac, click with two fingers) on the files and choose <span class="guimenuitem">Wipe</span>.
ru: Щёлкните правой кнопкой мыши (на компьютере Mac щёлкните двумя пальцами) по файлам и выберите <span class="guimenuitem">Затереть</span>.

source: Confirm.
ru: Подтвердите.

source: Securely clean available disk space
ru: Надёжная очистка дискового пространства

source: In order to clean up the contents of all files that were previously suppressed but not securely deleted from a disk, it is also possible to securely clean all the free space on the disk.
ru: Такое действие понадобиться, чтобы навсегда избавиться от файлов, которые ранее были удалены обычным способом. Можно очистить всё свободное пространство на диске.

source: <p>This method does not work as expected on solid-state disks or USB sticks.</p>
ru: <p>Этот метод не работает должным образом на твердотельных накопителях и флешках.</p>

source: Click on the disk that you want to clean in the left pane to navigate to the root of this disk.
ru: В левой панели щёлкните по диску, который хотите очистить. Перейдите в корневую папку этого диска.

source: If you want to empty the trash, delete the <span class="filename">.Trash-1000</span> folder or similar.
ru: Если хотите очистить корзину, удалите папку <span class="filename">.Trash-1000</span> или аналогичную папку.

source: Right-click (on Mac, click with two fingers) in empty space in the right pane and choose <span class="guimenuitem">Wipe available diskspace</span>.
ru: Щёлкните правой кнопкой мыши (на компьютере Mac щёлкните двумя пальцами) по пустому пространству в правой панели и выберите <span class="guimenuitem">Wipe available diskspace</span>.

source: Note that a file with a name similar to <span class="filename">tmp.7JwHAyBvA9</span> is created in the folder. It is made as big as possible to use all the available diskspace and then securely deleted.
ru: Обратите внимание, что в папке появился файл с именем вроде <span class="filename">tmp.7jwhaybva9</span>. Этот файл максимально большой и занимает всё доступное дисковое пространство. В конце он будет надёжным образом удалён.

source: Securely erasing an entire device
ru: Надёжное стирание всего носителя

source: <p>This technique is the only way to securely delete any data, even a single file, from a USB stick or an SSD (Solid-State Disk).</p>
ru: <p>Это единственный способ надёжного удаления любых данных, даже одного-единственного файла, с флешки или SSD (твердотельного накопителя).</p>

source: Open the <span class="application">Disks</span> utility.
ru: Откройте утилиту <span class="application">Диски</span>.

source: All the current storage devices are listed in the left pane.
ru: Все подключённые носители данных видны в левой панели.

source: Plug in the USB stick or SSD that you want to securely delete.
ru: Подключите флешку или SSD-накопитель, который хотите надёжно стереть.

source: A new device appears in the list of storage devices. Click on it:
ru: В списке слева появится новое устройство. Щёлкните по нему:

source: Check that the description of the device on the right side of the screen corresponds to your device: its brand, its size, etc.
ru: Убедитесь, что описание в правой части окна соответствует вашему носителю: модель, объём и т.д.

source: In the <span class="guilabel">Format Disk</span> dialog:
ru: Появится диалог <span class="guilabel">Форматировать диск</span>.

source: Choose to <span class="guilabel">Overwrite existing data with zeroes</span> in the <span class="guilabel">Erase</span> drop-down list.
ru: Выберите в раскрывающемся списке <span class="guilabel">Очистить</span> вариант <span class="guilabel">Перезаписать существующие данные нулями</span>.

source: Choose <span class="guilabel">Compatible with all systems and devices (MBR/DOS)</span> in the <span class="guilabel">Partitioning</span> drop-down list.
ru: Выберите в раскрывающемся списке <span class="guilabel">Разметка</span> вариант <span class="guilabel">Совместимо со всеми системами и устройствами (MBR / DOS)</span>.

source: In the confirmation dialog, make sure that the device is correct. Click <span class="bold">Format</span> to confirm.
ru: В диалоговом окне убедитесь, что устройство выбрано верно. Нажмите <span class="bold">Форматировать</span> для подтверждения.
