Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/encryption_and_privacy/veracrypt.*.po
Languages: ru

source: [[!meta title="Using VeraCrypt encrypted volumes"]]
ru: [[!meta title="Использование зашифрованных томов VeraCrypt"]]

source: Introduction to <span class="application">VeraCrypt</span>
ru: Знакомство с <span class="application">VeraCrypt</span>

source: <span class="application">[VeraCrypt](https://www.veracrypt.fr/)</span> is a disk encryption tool that works on Windows, macOS, and Linux.
ru: <span class="application">[VeraCrypt](https://www.veracrypt.fr/)</span> – программа для шифрования диска, совместимая с Windows, macOS и Linux.

source: Comparison between <span class="application">LUKS</span> and <span class="application">VeraCrypt</span>
ru: Сравнение <span class="application">LUKS</span> и <span class="application">VeraCrypt</span>

source: You can also create and open <span class="application">LUKS</span> encrypted volumes in Tails. <span class="application">LUKS</span> is the standard for disk encryption in Linux. [[See our documentation about <span class="application">LUKS</span>.|encrypted_volumes]]
ru: Вы можете создавать и открывать в Tails зашифрованные тома <span class="application">LUKS</span>. Это стандарт шифрования в Linux. [[См. описание <span class="application">LUKS</span>.|encrypted_volumes]]

source: [[!inline pages="doc/encryption_and_privacy/luks_vs_veracrypt.inline" raw="yes" sort="age"]]
ru: [[!inline pages="doc/encryption_and_privacy/luks_vs_veracrypt.inline.ru" raw="yes" sort="age"]]

source: Difference between file containers and partitions
ru: Разница между файловыми контейнерами и разделами

source: With <span class="application">VeraCrypt</span> you can store your files encrypted in two different kinds of *volumes*:
ru: С помощью <span class="application">VeraCrypt</span> вы можете хранить ваши файлы зашифрованными в *томах* двух разных типов:

source: <h3>File containers</h3>
ru: <h3>Файловые контейнеры</h3>

source: <div class="text"> <p>A file container is a single big file inside which you can store several files encrypted, a bit like a ZIP file.</p> </div> </div>
ru: <div class="text"> <p>Файловый контейнер – большой файл, в котором вы можете хранить другие, зашифрованные файлы. Он чем-то похож на ZIP-архив.</p> </div> </div>

source: <h3>Partitions or drives</h3>
ru: <h3>Разделы и диски</h3>

source: <div class="text"> <p>Usually, drives (USB sticks and hard disks) have a single partition of their entire size. This way, you can encrypt a whole USB stick, for example. But, drives can also be split into several partitions. </div> </div>
ru: <div class="text"> <p>Обычно у накопителя (USB-флешки или жёсткого диска) только один раздел, который занимает весь объём. Так вы можете зашифровать всю флешку. Однако на накопителе можно создать и несколько разделов. </div> </div>

source: Unlocking parameters
ru: Параметры разблокирования

source: To unlock a <span class="application">VeraCrypt</span> volume, you might need the following parameters, depending on the options that were selected when the volume was created:
ru: Для разблокирования тома <span class="application">VeraCrypt</span> обратите внимание на следующее (в зависимости от опций, выбранных в процессе создания тома):

source: - **Passphrase**
ru: - **Пароль**

source: **Keyfiles**: instead of or in addition to the passphrase, a <span class="application">VeraCrypt</span> volume can be unlocked using a particular file or set of files.
ru: **Ключевой файл.** Вместо пароля или в дополнение к нему для разблокировки тома <span class="application">VeraCrypt</span> можно использовать какой-либо файл или набор файлов.

source: [See the <span class="application">VeraCrypt</span> documentation on keyfiles.](https://www.veracrypt.fr/en/Keyfiles.html)
ru: [О ключевых файлах в документации<span class="application">VeraCrypt</span>](https://www.veracrypt.fr/en/Keyfiles.html)

source: **PIM**: a number that is needed if it was specified when creating the <span class="application">VeraCrypt</span> volume.
ru: **PIM.** Номер, который вам понадобится, если он был указан при создании тома <span class="application">VeraCrypt</span>.

source: [See the <span class="application">VeraCrypt</span> documentation on PIM.](https://www.veracrypt.fr/en/Personal%20Iterations%20Multiplier%20\(PIM\).html)
ru: [Информация о PIM в документации <span class="application">VeraCrypt</span>](https://www.veracrypt.fr/en/Personal%20Iterations%20Multiplier%20\(PIM\).html)

source: **Hidden volume**: if you want to unlock the hidden volume inside the <span class="application">VeraCrypt</span> volume.
ru: **Скрытый том.** Если вы хотите разблокировать скрытый том <span class="application">VeraCrypt</span>.

source: [See the <span class="application">VeraCrypt</span> documentation on hidden volumes.](https://www.veracrypt.fr/en/Hidden%20Volume.html)
ru: [О скрытых томах в документации <span class="application">VeraCrypt</span>](https://www.veracrypt.fr/en/Hidden%20Volume.html)

source: - **System volume**: if you want to unlock an encrypted Windows system partition.
ru: - **Системный диск.** Если вы хотите разблокировать зашифрованный системный диск Windows.

source: [See the <span class="application">VeraCrypt</span> documentation on encrypting a Windows system partition.](https://www.veracrypt.fr/en/System%20Encryption.html)
ru: [О шифровании системного диска Windows в документации <span class="application">VeraCrypt</span>](https://www.veracrypt.fr/en/System%20Encryption.html)

source: Using a file container
ru: Файловые контейнеры

source: Unlocking a file container without keyfiles
ru: Разблокирование файлового контейнера без ключевых файлов

source: Click <span class="bold">Add</span> and choose the file container that you want to unlock.
ru: Нажмите <span class="bold">Add</span> (*Добавить*) и выберите файловый контейнер, который хотите разблокировать.

source: Enter the parameters to unlock the volume. For more information, see the [[Unlocking parameters|veracrypt#parameters]] section above.
ru: Введите параметры для разблокирования тома. Подробнее см. раздел выше [[Параметры разблокирования|veracrypt#parameters]].

source: Click <span class="bold">Unlock</span>.
ru: Нажмите <span class="bold">Unlock</span> (Разблокировать).

source: <span class="application">Unlock VeraCrypt Volumes</span> unlocks your volume.
ru: <span class="application">Unlock VeraCrypt Volumes</span> разблокирует ваш том.

source: If unlocking the volume fails (for example, if you mistyped the password), click on <span class="bold">Unlock</span> to try unlocking again.
ru: Если разблокировать том не удаётся (например, вы неправильно ввели пароль), нажмите на <span class="bold">Unlock</span> и попытайтесь снова.

source: Click <span class="bold">Open</span> to open the volume in the <span class="application">Files</span> browser.
ru: Нажмите <span class="bold">Open</span>, чтобы открыть том в файловом менеджере <span class="application">Файлы</span>.

source: Unlocking a file container with keyfiles
ru: Разблокирование файлового контейнера с помощью ключевых файлов

source: In the <span class="bold">Select Disk Image to Attach</span> dialog:
ru: В диалоговом окне <span class="bold">Выберите образ диска для присоединения</span>:

source: Unselect the <span class="guilabel">Set up read-only loop device</span> check box in the bottom-left corner if you want to modify the content of the file container.
ru: Если хотите иметь возможность изменять содержимое файлового контейнера, снимите галочку в поле <span class="guilabel">Настроить петлевое устройство только для чтения</span>.

source: Choose <span class="guilabel">All Files</span> in the file filter in the bottom-right corner.
ru: Выберите <span class="guilabel">Все файлы</span> в правом нижнем углу.

source: Navigate to the folder containing the file container that you want to open.
ru: Перейдите в папку с файлом-контейнером, который вы хотите открыть.

source: Select the file container and click <span class="bold">Attach</span>.
ru: Выберите файл-контейнер и нажмите кнопку <span class="bold">Подключить</span> в правом верхнем углу.

source: In the left pane, select the new <span class="guilabel">Loop Device</span> that corresponds to your file container.
ru: В левой панели выберите новое <span class="guilabel">Петлевое устройство</span>, соответствующее вашему файловому контейнеру.

source: In the right pane, it should have an <span class="guilabel">Encrypted?</span> label.
ru: В правой панели можете видеть надпись <span class="guilabel">Encrypted?</span>.

source: Click the <span class="bold">[[!img lib/unlock.png alt="Unlock selected encrypted partition" class="symbolic" link="no"]]</span> button in the right pane.
ru: Нажмите кнопку <span class="bold">[[!img lib/unlock.png alt="Разблокировать выбранный зашифрованный раздел" class="symbolic" link="no"]]</span> на правой панели.

source: Select the file system that appears below the unlocked volume. It probably has a <span class="guilabel">FAT</span> or <span class="guilabel">NTFS</span> content.
ru: Выберите файловую систему, которая отображается под разблокированным томом. Вероятно, это <span class="guilabel">FAT</span> или <span class="guilabel">NTFS</span>.

source: Click the <span class="bold">[[!img lib/media-playback-start.png alt="Mount selected partition" class="symbolic" link="no"]]</span> button to mount the volume.
ru: Нажмите кнопку <span class="bold">[[!img lib/media-playback-start.png alt="Смонтировать выбранный раздел" class="symbolic" link="no"]]</span> монтирования тома.

source: Click on the <span class="filename">*/media/amnesia/*</span> link in the right pane to open the volume in the <span class="application">Files</span> browser.
ru: Нажмите ссылку <span class="filename">*/media/amnesia/*</span> в правой панели, чтобы открыть том в менеджере <span class="application">Файлы</span>.

source: Closing a file container
ru: Закрытие файла-контейнера

source: You can either:
ru: Есть два способа.

source: In the sidebar of the <span class="application">Files</span> browser, click on the <span class="bold">[[!img lib/media-eject.png alt="Eject" class="symbolic" link="no"]]</span> button on the label of the volume corresponding to your file container.
ru: В боковой панели файлового менеджера <span class="application">Файлы</span> нажмите кнопку <span class="bold">[[!img lib/media-eject.png alt="Извлечь" class="symbolic" link="no"]]</span> на ярлыке тома, соответствующего файловому контейнеру.

source: In <span class="application">Unlock VeraCrypt Volumes</span>, click on the <span class="bold">[[!img lib/window-close.png class="symbolic" link="no" alt=""]]</span> button in the line that corresponds to your file container.
ru: В приложении <span class="application">Unlock VeraCrypt Volumes</span> нажмите кнопку <span class="bold">[[!img lib/window-close.png class="symbolic" link="no" alt=""]]</span> в строке, соответствующей вашему файловому контейнеру.

source: Using a partition or drive
ru: Разделы и диски

source: Unlocking a partition or drive without keyfiles
ru: Разблокирование раздела/диска без ключевого файла

source: If your partition or drive is on an internal hard disk, [[set up an administration password|doc/first_steps/welcome_screen/administration_password]] when starting Tails.
ru: Если ваш раздел находится на внутреннем жёстком диске, [[установите пароль администратора|doc/first_steps/welcome_screen/administration_password]] при запуске Tails.

source: Otherwise, plug in the USB stick or the hard disk that you want to unlock.
ru: В противном случае подключите флешку или жёсткий диск, которые хотите разблокировать.

source: In the list of partitions, click <span class="bold">Unlock</span> in the line that corresponds to your USB stick or hard disk.
ru: Нажмите <span class="bold">Unlock</span> (Разблокировать) в строке, соответствующей вашей флешке или жёсткому диску.

source: Unlocking a partition or drive with keyfiles
ru: Разблокирование раздела/диска с ключевым файлом

source: In the left pane, select the drive that corresponds to your USB stick or hard disk.
ru: В левой панели выберите диск, соответствующий вашей флешке или жёсткому диску.

source: In the right pane, select the partition that corresponds to your *VeraCrypt* volume.
ru: В правой панели выберите раздел, соответствующий вашему тому *VeraCrypt*.

source: It should have an <span class="guilabel">Encrypted?</span> label.
ru: У него должна быть надпись <span class="guilabel">Encrypted?</span>.

source: Closing a partition or drive
ru: Закрытие раздела/диска

source: In the sidebar of the <span class="application">Files</span> browser, click on the <span class="bold">[[!img lib/media-eject.png alt="Eject" class="symbolic" link="no"]]</span> button on the label of the volume corresponding to your partition.
ru: В боковой панели менеджера <span class="application">Файлы</span> нажмите кнопку <span class="bold">[[!img lib/media-eject.png alt="Извлечь" class ="symbolic" link ="no"]]</span> на ярлыке тома, соответствующего вашему разделу.

source: In <span class="application">Unlock VeraCrypt Volumes</span>, click on the <span class="bold">[[!img lib/window-close.png class="symbolic" link="no" alt=""]]</span> button in the line that corresponds to your USB stick or hard disk.
ru: В приложении <span class="application">Unlock VeraCrypt Volumes</span> нажмите кнопку <span class="bold">[[!img lib/window-close.png class="symbolic" link ="no" alt=""]]</span> в строке, соответствующей вашей флешке или жёсткому диску.
