Repository: KaushalIngle/CuOS
Catalog: wiki/src/support/known_issues/graphics.*.po
Languages: fr

source: [[!meta title="Known issues with graphics cards"]]
fr: [[!meta title="Problèmes connus avec des cartes graphiques"]]

source: - For other hardware compatibility issues, refer to our [[known issues|support/known_issues]].
fr: - Pour d'autres problèmes de compatibilité matérielle, consultez notre [[liste des problèmes connus|support/known_issues]].

source: <h1 id="error-starting-gdm">Error starting GDM</h1>
fr: <h1 id="error-starting-gdm">Erreur de démarrage de GDM</h1>

source: This section applies if you see the following error message when starting Tails:
fr: Cette section s'applique si vous voyez le message suivant au démarrage de Tails :

source: <p class="pre"> Error starting GDM with your graphics card: <i>name of your graphics card [id] (rev number)</i>. Please take note of this error and visit https://tails.boum.org/gdm for troubleshooting. </p>
fr: <p class="pre"> Erreur de démarrage GDM avec votre carte graphique : <i>nom de votre carte graphique [identifiant] (numéro de version)</i>. Merci de noter l'erreur et de consulter https://tails.boum.org/gdm pour la corriger. </p>

source: Identify the name, ID, and revision number (if any) of your graphics card.
fr: Identifiez le nom, l'identifiant et le numéro de version (si il existe) de votre carte graphique.

source: For example, if your error message starts with:
fr: Par exemple, si votre message d'erreur commence par :

source: <p class="pre">Error starting GDM with your graphics card: NVIDIA Corporation [10de:0a6c] GT218M [NVS 3100M] (rev a2)</p>
fr: <p class="pre">Erreur de démarrage GDM avec votre carte graphique : NVIDIA Corporation [10de:0a6c] GT218M [NVS 3100M] (rev a2)</p>

source: The name is *NVIDIA Corporation GT218M [NVS 3100M]*.
fr: Le nom est *NVIDIA Corporation GT218M [NVS 3100M]*.

source: The ID is *[10de:0a6c]*. The ID is unique to the model of your graphics card, it is not unique to your computer.
fr: L'identifiant est *[10de:0a6c]*. L'identifiant est unique à votre modèle de carte graphique, il n'est pas unique à votre ordinateur.

source: The revision number is *a2*. Your graphics card might have no revision number.
fr: Le numéro de version est *a2*. Votre carte graphique peut ne pas avoir de numéro de version.

source: Check if your graphics card is listed below. For example, you can search for its name or ID on this page.
fr: Vérifiez si votre carte graphique est listée ci-dessous. Par exemple, vous pouvez chercher son nom ou son identifiant dans cette page.

source: If your graphics card is listed, check if a workaround is documented to make it work on Tails.
fr: Si votre carte graphique est listée, vérifiez si un contournement est documenté pour la faire fonctionner dans Tails.

source: If the workaround doesn't work, we are sorry that Tails does not work well on this computer. Our best hope is that a future update of Linux drivers will solve the problem.
fr: Si ce contournement ne fonctionne pas, l'équipe de Tails est désolée que cela ne fonctionne pas très bien sur cet ordinateur. Notre plus grand espoir est que les futures mises à jour des pilotes Linux permettrons de résoudre le problème.

source: If your graphics card is not listed, please [[contact our support team by email|support/talk]].
fr: Si votre carte graphique n'est pas listée, veuillez [[contacter notre équipe d'assistance par courrier électronique|support/talk]].

source: Mention in your email:
fr: Mentionnez dans votre message :

source: The version of Tails that you are trying to start.
fr: La version de Tails que vous essayez de démarrer.

source: The name, ID, and revision number (if any) of your graphics card.
fr: Le nom, l'identifiant et le numéro de version (s'il existe) de votre carte graphique.

source: <p>You can send us a photo of the error message as it appears on your screen.</p>
fr: <p>Vous pouvez nous envoyer une photographie du message d'erreur tel qu'il apparaît sur votre écran.</p>

source: If your problem gets fixed in a future version of Tails, please let us know so we can update this page.
fr: Si votre problème est corrigé dans une future version de Tails, veuillez nous le faire savoir pour que nous puissions mettre à jour cette page.

source: Name and ID in /usr/share/misc/pci.ids
fr: Nom et identifiant dans /usr/share/misc/pci.ids

source: The correspondence between the name and ID is established in /usr/share/misc/pci.ids.
fr: La correspondance entre le nom et l'identifiant est établie dans /usr/share/misc/pci.ids.

source: For example:
fr: Par exemple :

source: Corresponds to:
fr: Correspond à :

source: Template for new section
fr: Modèle pour une nouvelle section

source: $LT!-- Issues: #XXXXX #XXXXX --$GT
fr: $LT!-- Problèmes : #XXXXX #XXXXX --$GT

source: Affected graphics cards
fr: Cartes graphiques concernées

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>$VENDOR $DEVICE</td><td>[$VENDOR_ID:$PRODUCT_ID]</td><td>(rev $REVISION_NUMBER)</td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>$VENDOR $DEVICE</td><td>[$VENDOR_ID:$PRODUCT_ID]</td><td>(rev $REVISION_NUMBER)</td></tr> </table>

source: Workaround
fr: Contournement

source: <!-- Issues: #11095 #12482 -->
fr: <!-- Problèmes : #11095 #12482 -->

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Mars XTX [Radeon HD 8790M]</td><td>[1002:6606]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Mars XTX [Radeon HD 8790M]</td><td>[1002:6606]</td><td>(rev ff)</td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Turks XT [Radeon HD 6670/7670]</td><td>[1002:6758]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Seymour LP [Radeon HD 6430M]</td><td>[1002:6761]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Cedar [Radeon HD 5000/6000/7350/8350 Series]</td><td>[1002:68f9]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Broadway PRO [Mobility Radeon HD 5850]</td><td>[1002:68a1]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] RV730/M96 [Mobility Radeon HD 4650/5165]</td><td>[1002:9480]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] RV630/M76 [Mobility Radeon HD 2600 XT/2700]</td><td>[1002:9583]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Device</td><td>[1002:98e4]</td><td>(rev da)</td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Trinity [Radeon HD 7520G]</td><td>[1002:9990]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Beavercreek [Radeon HD 6550D]</td><td>[1002:9640]</td><td></td></tr> <tr><td>Advanced Micro Devices, INC. [AMD/ATI] RX 6800</td><td>[1002:73bf]</td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Mars XTX [Radeon HD 8790M]</td><td>[1002:6606]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Mars XTX [Radeon HD 8790M]</td><td>[1002:6606]</td><td>(rev ff)</td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Turks XT [Radeon HD 6670/7670]</td><td>[1002:6758]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Seymour LP [Radeon HD 6430M]</td><td>[1002:6761]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Cedar [Radeon HD 5000/6000/7350/8350 Series]</td><td>[1002:68f9]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Broadway PRO [Mobility Radeon HD 5850]</td><td>[1002:68a1]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] RV730/M96 [Mobility Radeon HD 4650/5165]</td><td>[1002:9480]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] RV630/M76 [Mobility Radeon HD 2600 XT/2700]</td><td>[1002:9583]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Device</td><td>[1002:98e4]</td><td>(rev da)</td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Trinity [Radeon HD 7520G]</td><td>[1002:9990]</td><td></td></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Beavercreek [Radeon HD 6550D]</td><td>[1002:9640]</td><td></td></tr> <tr><td>Advanced Micro Devices, INC. [AMD/ATI] RX 6800</td><td>[1002:73bf]</td><td></td></tr> </table>

source: Other graphics cards in the Radeon HD family might be affected:
fr: D'autres cartes graphiques de la famille Radeon HD peuvent être concernées :

source: Try starting Tails using the following [[boot options|doc/advanced_topics/boot_options]]. You should try only one of these boot options per start attempt.
fr: Essayez de démarrer Tails en utilisant ces [[options de démarrage|doc/advanced_topics/boot_options]]. Vous devriez essayer une seule de ces options par essai de démarrage.

source: If the computer has another, integrated graphics card, try configuring the computer to use that one instead of the AMD graphics card. For example, using the following [[boot option|doc/advanced_topics/boot_options]]:
fr: Si l'ordinateur a une autre carte graphique, intégrée, essayez de configurer l'ordinateur pour qu'il l'utilise plutôt que la carte graphique AMD. Par exemple, en utilisant l'[[option de démarrage|doc/advanced_topics/boot_options]] suivante :

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Exo UL/ULT/ULP [Radeon R5 M320]</td><td></td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Exo UL/ULT/ULP [Radeon R5 M320]</td><td></td><td></td></tr> </table>

source: Adding `radeon.modeset=0 xorg-driver=modesetting` to the [[boot options|doc/advanced_topics/boot_options]] fixes the issue.
fr: Ajouter `radeon.modeset=0 xorg-driver=modesetting` aux [[options de démarrage|doc/advanced_topics/boot_options]] corrige le problème.

source: <!-- Issues: #12218 #11850 -->
fr: <!-- Problèmes : #12218 #11850 -->

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Hawaii PRO [Radeon R9 290/390]</td><td>[1002:67b1]</td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>Advanced Micro Devices, Inc. [AMD/ATI] Hawaii PRO [Radeon R9 290/390]</td><td>[1002:67b1]</td><td></td></tr> </table>

source: Adding `radeon.dpm=0` to the [[boot options|doc/advanced_topics/boot_options]] fixes the issue.
fr: Ajouter `radeon.dpm=0` dans les [[options de démarrage|doc/advanced_topics/boot_options]] corrige le problème.

source: <h2 id="amd-radeon-rx-400">AMD Radeon RX 400 family</h2>
fr: <h2 id="amd-radeon-rx-400">Famille AMD Radeon RX 400</h2>

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>Radeon RX 480</td><td></td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>Radeon RX 480</td><td></td><td></td></tr> </table>

source: Adding `amdgpu.dc=0` to the [[boot options|doc/advanced_topics/boot_options]] fixes the issue.
fr: Ajouter `amdgpu.dc=0` dans les [[options de démarrage|doc/advanced_topics/boot_options]] corrige le problème.

source: Other possibly affected graphics cards
fr: Autres cartes graphiques potentiellement concernées

source: Other graphics cards in the [[!wikipedia Radeon_RX_400_series]] might be affected.
fr: Les autres cartes graphiques dans [[!wikipedia_fr Radeon_RX_400_series]] peuvent être concernées.

source: <h2 id="amd-vega">AMD Radeon RX Vega family</h2>
fr: <h2 id="amd-vega">Famille AMD Radeon RX Vega</h2>

source: Graphics cards in the [[!wikipedia Radeon_RX_Vega_series]], as found in some AMD Ryzen processors, might be affected.
fr: Les cartes graphiques dans [[!wikipedia_fr Radeon_RX_Vega_series]], que l'on trouve dans certains processeurs AMD Ryzen, peuvent être concernées.

source: To start Tails successfully, [[add the following boot option when starting Tails|doc/advanced_topics/boot_options]]:
fr: Pour permettre à Tails de démarrer correctement, [[ajoutez les options suivantes lors du démarrage de Tails|doc/advanced_topics/boot_options]] :

source: <h2 id="amd-renoir">AMD Renoir family</h2>
fr: <h2 id="amd-renoir">Famille AMD Renoir</h2>

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>AMD/ATI Renoir</td><td>1002:1636</td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>AMD/ATI Renoir</td><td>1002:1636</td><td></td></tr> </table>

source: We don't know any workaround so far. If you find one, please [[tell our help desk about it|support/talk]].
fr: À ce jour nous ne connaissons pas de moyen de contournement. Si vous en trouvez un, merci [[de le signaler à notre centre d'aide|support/talk]].

source: Graphics cards in the [[!wikipedia Ryzen desc="Renoir"]] family, as found in some AMD Threadripper and Ryzen processors, might be affected.
fr: Les cartes graphiques dans la famille [[!wikipedia Ryzen desc="Renoir"]], que l'on trouve dans les processeurs AMD Threadripper et Ryzen, peuvent être concernées.

source: <h2 id="amd-radeon-rx-5000">AMD Radeon RX 5000 family</h2>
fr: <h2 id="amd-radeon-rx-5000">Famille AMD Radeon RX 5000</h2>

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>AMD Radeon RX 5500 XT</td><td>1002:7340</td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>AMD Radeon RX 5500 XT</td><td>1002:7340</td><td></td></tr> </table>

source: Graphics cards in the [[!wikipedia Radeon_RX_5000_series desc="Radeon RX 5000 series"]] might be affected.
fr: Les cartes graphiques dans [[!wikipedia_fr Radeon_RX_5000_series desc="Famille Radeon RX 5000"]] peuvent être concernées.

source: <!-- Issue: #12219 Issue: #16224 -->
fr: <!-- Problème : #12219 Problème : #16224 -->

source: Various Intel graphics card.
fr: Diverses cartes graphiques Intel.

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>Intel Corporation</td><td></td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>Intel Corporation</td><td></td><td></td></tr> </table>

source: Otherwise, try starting in the *Troubleshooting Mode*.
fr: Dans le cas contraire, essayez de démarrer dans le mode *Troubleshooting Mode*.

source: <!-- Issue: #11096, Debian #776911
fr: <!-- Problème : #11096, Debian #776911

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>Intel Corporation 82852/855GM Integrated Graphics Device</td><td>[8086:3582]</td><td>(rev 02)</td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>Intel Corporation 82852/855GM Integrated Graphics Device</td><td>[8086:3582]</td><td>(rev 02)</td></tr> </table>

source: <!-- Issue: #15491 -->
fr: <!-- Problème : #15491 -->

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>NVIDIA Corporation MCP89 (GeForce 320M)</td><td>[10de:08a0]</td><td>a2</td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>NVIDIA Corporation MCP89 (GeForce 320M)</td><td>[10de:08a0]</td><td>a2</td></tr> </table>

source: Other graphics cards in the [NV50 family (Tesla)](https://nouveau.freedesktop.org/CodeNames.html#NV50) might be affected:
fr: Autres cartes graphiques de la [famille NV50 (Tesla)](https://nouveau.freedesktop.org/CodeNames.html#NV50) pouvant être concernées :

source: <table> <tr> <th><strong>Code name</strong> </th> <th><strong>Official Name</strong> </th> </tr> <tr> <td>NV50 (G80) </td> <td>GeForce 8800 (GTS, GTX, Ultra)<br/>Quadro FX (4600 (SDI), 5600) </td> </tr> <tr> <td>NV84 (G84) </td> <td>GeForce 8600 (GT, GTS, M GT, M GS), 8700M GT, GeForce 9500M GS, 9650M GS <br/>Quadro FX (370, 570, 570M, 1600M, 1700), NVS 320M </td> </tr> <tr> <td>NV86 (G86) </td> <td>GeForce 8300 GS, 8400 (GS, M G, M GS, M GT), 8500 GT, GeForce 9300M G <br/>Quadro FX 360M, NVS (130M, 135M, 140M, 290) </td> </tr> <tr> <td>NV92 (G92) </td> <td>GeForce 8800 (GT, GS, GTS 512, M GTS, M GTX) <br/> GeForce 9600 GSO, 9800 (GT, GTX, GTX+, GX2, M GT, M GTX) <br/> GeForce GTS 150(M), GTS 160M, GTS 240, GTS 250, GTX (260M, 280M, 285M), GT (330, 340) <br/> Quadro FX (2800M, 3600M, 3700, 3700M, 3800M, 4700 X2), VX 200 </td> </tr> <tr> <td>NV94 (G94) </td> <td>GeForce 9600 (GSO 512, GT, S), 9700M GTS, 9800M GTS, GeForce G 110M, GT 130(M), GT 140 <br/>Quadro FX (1800, 2700M) </td> </tr> <tr> <td>NV96 (G96) </td> <td>GeForce 9400 GT, 9500 (GT, M G), 9600 (M GS, M GT), 9650M GT, 9700M GT <br/> GeForce G 102M, GT 120 <br/> Quadro FX (380, 580, 770M, 1700M) </td> </tr> <tr> <td>NV98 (G98) </td> <td>GeForce 8400 GS, GeForce 9200M GS, 9300 (GE, GS, M GS)<br/> GeForce G 100, G 105M <br/>Quadro FX (370 LP, 370M), NVS (150M, 160M, 295, 420, 450) </td> </tr> <tr> <td>NVA0 (GT200) </td> <td>GeForce GTX (260, 275, 280, 285, 295) <br/>Quadro CX, FX (3800, 4800, 5800) </td> </tr> <tr> <td>NVA3 (GT215) </td> <td>GeForce GT (240, 320, 335M), GTS (250M, 260M, 350M, 360M) <br/>Quadro FX 1800M </td> </tr> <tr> <td>NVA5 (GT216) </td> <td>GeForce GT (220, 230M, 240M, 325M, 330M), 315 <br/>Quadro 400, FX 880M, NVS 5100M </td> </tr> <tr> <td>NVA8 (GT218) </td> <td>GeForce 8400 GS, ION 2, GeForce 205, 210, G 210M, 305M, 310(M), 405 <br/>Quadro FX (380 LP, 380M), NVS (300, 2100M, 3100M) </td> </tr> <tr> <td>NVAA (MCP77/MCP78) </td> <td>GeForce 8100, 8200, 8300 mGPU / nForce 700a series, 8200M G </td> </tr> <tr> <td>NVAC (MCP79/MCP7A) </td> <td>ION, GeForce 9300, 9400 mGPU / nForce 700i series, 8200M G, 9100M, 9400M (G) </td> </tr> </table>
fr: <table> <tr> <th><strong>Nom de code</strong> </th> <th><strong>Nom officiel</strong> </th> </tr> <tr> <td>NV50 (G80) </td> <td>GeForce 8800 (GTS, GTX, Ultra)<br/>Quadro FX (4600 (SDI), 5600) </td> </tr> <tr> <td>NV84 (G84) </td> <td>GeForce 8600 (GT, GTS, M GT, M GS), 8700M GT, GeForce 9500M GS, 9650M GS <br/>Quadro FX (370, 570, 570M, 1600M, 1700), NVS 320M </td> </tr> <tr> <td>NV86 (G86) </td> <td>GeForce 8300 GS, 8400 (GS, M G, M GS, M GT), 8500 GT, GeForce 9300M G <br/>Quadro FX 360M, NVS (130M, 135M, 140M, 290) </td> </tr> <tr> <td>NV92 (G92) </td> <td>GeForce 8800 (GT, GS, GTS 512, M GTS, M GTX) <br/> GeForce 9600 GSO, 9800 (GT, GTX, GTX+, GX2, M GT, M GTX) <br/> GeForce GTS 150(M), GTS 160M, GTS 240, GTS 250, GTX (260M, 280M, 285M), GT (330, 340) <br/> Quadro FX (2800M, 3600M, 3700, 3700M, 3800M, 4700 X2), VX 200 </td> </tr> <tr> <td>NV94 (G94) </td> <td>GeForce 9600 (GSO 512, GT, S), 9700M GTS, 9800M GTS, GeForce G 110M, GT 130(M), GT 140 <br/>Quadro FX (1800, 2700M) </td> </tr> <tr> <td>NV96 (G96) </td> <td>GeForce 9400 GT, 9500 (GT, M G), 9600 (M GS, M GT), 9650M GT, 9700M GT <br/> GeForce G 102M, GT 120 <br/> Quadro FX (380, 580, 770M, 1700M) </td> </tr> <tr> <td>NV98 (G98) </td> <td>GeForce 8400 GS, GeForce 9200M GS, 9300 (GE, GS, M GS)<br/> GeForce G 100, G 105M <br/>Quadro FX (370 LP, 370M), NVS (150M, 160M, 295, 420, 450) </td> </tr> <tr> <td>NVA0 (GT200) </td> <td>GeForce GTX (260, 275, 280, 285, 295) <br/>Quadro CX, FX (3800, 4800, 5800) </td> </tr> <tr> <td>NVA3 (GT215) </td> <td>GeForce GT (240, 320, 335M), GTS (250M, 260M, 350M, 360M) <br/>Quadro FX 1800M </td> </tr> <tr> <td>NVA5 (GT216) </td> <td>GeForce GT (220, 230M, 240M, 325M, 330M), 315 <br/>Quadro 400, FX 880M, NVS 5100M </td> </tr> <tr> <td>NVA8 (GT218) </td> <td>GeForce 8400 GS, ION 2, GeForce 205, 210, G 210M, 305M, 310(M), 405 <br/>Quadro FX (380 LP, 380M), NVS (300, 2100M, 3100M) </td> </tr> <tr> <td>NVAA (MCP77/MCP78) </td> <td>GeForce 8100, 8200, 8300 mGPU / nForce 700a series, 8200M G </td> </tr> <tr> <td>NVAC (MCP79/MCP7A) </td> <td>ION, GeForce 9300, 9400 mGPU / nForce 700i series, 8200M G, 9100M, 9400M (G) </td> </tr> </table>

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>NVIDIA Corporation GK107 (GeForce GTX 650)</td><td>[10de:0fc6]</td><td>a1</td></tr> <tr><td>NVIDIA Corporation GK208 (Geforce GT 710B)</td><td>[10de:128b]</td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>NVIDIA Corporation GK107 (GeForce GTX 650)</td><td>[10de:0fc6]</td><td>a1</td></tr> <tr><td>NVIDIA Corporation GK208 (Geforce GT 710B)</td><td>[10de:128b]</td><td></td></tr> </table>

source: Other graphics cards in the [NVE0 family (Kepler)](https://nouveau.freedesktop.org/CodeNames.html#NVE0) might be affected.
fr: Les autres cartes graphiques de la [famille NVE0 (Kepler)](https://nouveau.freedesktop.org/CodeNames.html#NVE0) peuvent être concernées.

source: We don't know any workaround for these graphics cards yet. Please let us know if you find one.
fr: Nous ne savons pas encore s'il y a des solutions de contournement pour ces cartes graphiques. Merci de nous le faire savoir si vous en trouvez une.

source: <h2 id="nvidia-maxwell">Nvidia NV110 family (Maxwell)</h2>
fr: <h2 id="nvidia-maxwell">Famille Nvidia NV110 (Maxwell)</h2>

source: <!-- Issue: #15116 -->
fr: <!-- Problème : #15116 -->

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>NVIDIA Corporation GM107 [GeForce GTX 750 Ti]</td><td>?</td><td>a2</td></tr> <tr><td>NVIDIA Corporation GM204 [GeForce GTX 970]</td><td>[10de:13c2]</td><td></td></tr> <tr><td>NVIDIA Corporation GM204M [GeForce GTX 970M]</td><td>[10de:13d8]</td><td></td></tr> <tr><td>NVIDIA Corporation GM204M [GeForce GTX 970M]</td><td>[10de:1618]</td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>NVIDIA Corporation GM107 [GeForce GTX 750 Ti]</td><td>?</td><td>a2</td></tr> <tr><td>NVIDIA Corporation GM204 [GeForce GTX 970]</td><td>[10de:13c2]</td><td></td></tr> <tr><td>NVIDIA Corporation GM204M [GeForce GTX 970M]</td><td>[10de:13d8]</td><td></td></tr> <tr><td>NVIDIA Corporation GM204M [GeForce GTX 970M]</td><td>[10de:1618]</td><td></td></tr> </table>

source: This problem has been fixed for some of these graphic cards.
fr: Ce problème a été corrigé pour plusieurs de ces cartes graphiques.

source: Otherwise, try starting Tails using the following [[boot options|doc/advanced_topics/boot_options]]. You should try only one of these boot options per start attempt.
fr: Sinon, essayez de démarrer Tails en utilisant ces [[options de démarrage|doc/advanced_topics/boot_options]]. Vous devriez essayer une seule de ces options par essai de démarrage.

source: Other graphics cards in the [NV110 family (Maxwell)](https://nouveau.freedesktop.org/CodeNames.html#NV110) might be affected:
fr: Autres cartes graphiques de la [famille NV110 (Maxwell)](https://nouveau.freedesktop.org/CodeNames.html#NV110) pouvant être concernées :
