Repository: KaushalIngle/CuOS
Catalog: wiki/src/support/known_issues/graphics.*.po
Languages: fr

source: <table> <tr> <th><strong>Code name</strong> </th> <th><strong>Official Name</strong> </th> </tr> <tr> <td>NV117 (GM107) </td> <td>GeForce GTX (745, 750, 840M, 845M, 850M, 860M, 950M, 960M) <br/>Quadro K620, K1200, K2200, M1000M, M1200M; GRID M30, M40</td> </tr> <tr> <td>NV118 (GM108) </td> <td>GeForce 830M, 840M, 930M, 940M[X]</td> </tr> <tr> <td>NV120 (GM200) </td> <td>GeForce GTX Titan X</td> </tr> <tr> <td>NV124 (GM204) </td> <td>GeForce GTX (980)</td> </tr> <tr> <td>NV126 (GM206) </td> <td>GeForce GTX (950, 960)</td> </tr> <tr> <td>NV12B (GM20B) </td> <td>Tegra X1</td> </tr> </table>
fr: <table> <tr> <th><strong>Nom de code</strong> </th> <th><strong>Nom officiel</strong> </th> </tr> <tr> <td>NV117 (GM107) </td> <td>GeForce GTX (745, 750, 840M, 845M, 850M, 860M, 950M, 960M) <br/>Quadro K620, K1200, K2200, M1000M, M1200M ; GRID M30, M40</td> </tr> <tr> <td>NV118 (GM108) </td> <td>GeForce 830M, 840M, 930M, 940M[X]</td> </tr> <tr> <td>NV120 (GM200) </td> <td>GeForce GTX Titan X</td> </tr> <tr> <td>NV124 (GM204) </td> <td>GeForce GTX (980)</td> </tr> <tr> <td>NV126 (GM206) </td> <td>GeForce GTX (950, 960)</td> </tr> <tr> <td>NV12B (GM20B) </td> <td>Tegra X1</td> </tr> </table>

source: <h2 id="nvidia-pascal">Nvidia NV130 family (Pascal)</h2>
fr: <h2 id="nvidia-pascal">Famille Nvidia NV130 (Pascal)</h2>

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>$VENDOR $DEVICE</td><td>[$VENDOR_ID:$PRODUCT_ID]</td><td>(rev $REVISION_NUMBER)</td></tr> </table> -->
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>$VENDOR $DEVICE</td><td>[$VENDOR_ID:$PRODUCT_ID]</td><td>(rev $REVISION_NUMBER)</td></tr> </table> -->

source: Possibly affected graphics cards
fr: Cartes graphiques potentiellement concernées

source: Graphics cards in the [NV130 family (Pascal)](https://nouveau.freedesktop.org/CodeNames.html#NV130) might be affected:
fr: Cartes graphiques de la [famille NV130 (Pascal)](https://nouveau.freedesktop.orgCodeNames.html#NV130) pouvant être concernées :

source: <table> <tr> <th><strong>Code name</strong> </th> <th><strong>Official Name</strong> </th> </tr> <tr> <td>NV132 (GP102) </td> <td>NVIDIA Titan (X, Xp), GeForce GTX 1080 Ti</td> </tr> <tr> <td>NV134 (GP104) </td> <td>GeForce GTX (1070, 1080)</td> </tr> <tr> <td>NV136 (GP106) </td> <td>GeForce GTX 1060</td> </tr> <tr> <td>NV137 (GP107) </td> <td>GeForce GTX (1050, 1050 Ti)</td> </tr> <tr> <td>NV138 (GP108) </td> <td>GeForce GT 1030</td> </tr> </table>
fr: <table> <tr> <th><strong>Nom de code</strong> </th> <th><strong>Nom officiel</strong> </th> </tr> <tr> <td>NV132 (GP102) </td> <td>NVIDIA Titan (X, Xp), GeForce GTX 1080 Ti</td> </tr> <tr> <td>NV134 (GP104) </td> <td>GeForce GTX (1070, 1080)</td> </tr> <tr> <td>NV136 (GP106) </td> <td>GeForce GTX 1060</td> </tr> <tr> <td>NV137 (GP107) </td> <td>GeForce GTX (1050, 1050 Ti)</td> </tr> <tr> <td>NV138 (GP108) </td> <td>GeForce GT 1030</td> </tr> </table>

source: <h2 id="nvidia-turing">Nvidia NV160 family (Turing)</h2>
fr: <h2 id="nvidia-turing">Famille Nvidia NV160 (Turing)</h2>

source: As of 2020-03-19, much of these Nvidia graphics cards are [not supported](https://nouveau.freedesktop.org/wiki/FeatureMatrix/) by Tails yet.
fr: Au 19/03/2020, beaucoup de ces cartes graphiques Nvidia ne sont [pas encore supportées](https://nouveau.freedesktop.org/wiki/FeatureMatrix/) par Tails.

source: <table> <tr> <th><strong>Code name</strong> </th> <th><strong>Official Name</strong> </th> </tr> <tr> <td>NV167 (TU117)</td> <td>GeForce GTX 1650</td> <td>GeForce RTX 2060 Mobile</td> <td>GeForce RTX 2070</td> <td>GeForce RTX 2070 Super</td> <td>GeForce RTX 2070m</td> <td>GeForce RTX 2080 Super</td> </tr> </table>
fr: <table> <tr> <th><strong>Nom de code</strong> </th> <th><strong>Nom officiel</strong> </th> </tr> <tr> <td>NV167 (TU117)</td> <td>GeForce GTX 1650</td> <td>GeForce RTX 2060 Mobile</td> <td>GeForce RTX 2070</td> <td>GeForce RTX 2070 Super</td> <td>GeForce RTX 2070m</td> <td>GeForce RTX 2080 Super</td> </tr> </table>

source: Graphics cards in the [NV160 family (Turing)](https://nouveau.freedesktop.org/CodeNames.html#NV160) might be affected.
fr: Les cartes graphiques de la [famille NV160 (Turing)](https://nouveau.freedesktop.org/CodeNames.html#NV160) pouvent être concernées.

source: <h2 id="nvidia-ampere">Nvidia RTX 30X0 family (Ampere)</h2>
fr: <h2 id="nvidia-ampere">Famille Nvidia RTX 30X0 (Ampere)</h2>

source: As of 2020-11-07, these Nvidia graphics cards are [not supported](https://nouveau.freedesktop.org/wiki/FeatureMatrix/) out of the box by Tails yet.
fr: Au 07/11/2020, ces cartes graphiques Nvidia ne sont [pas encore supportées directement](https://nouveau.freedesktop.org/wiki/FeatureMatrix/) par Tails.

source: Graphics cards in the [[!wikipedia GeForce_30_series desc="Ampere family"]] are affected.
fr: Les cartes graphiques dans la [[!wikipedia GeForce_30_series desc="famille Ampere"]] sont concernées.

source: <h1 id="other-issues">Other issues</h1>
fr: <h1 id="other-issues">Autres problèmes</h1>

source: <h2 id="black-screen-switchable-graphics">Black screen with switchable graphics computers</h2>
fr: <h2 id="black-screen-switchable-graphics">Écran noir pour les ordinateurs avec cartes graphiques commutables</h2>

source: Some computers with switchable graphics (such as Optimus) fail to choose a video card and end up on a black screen. This has been reported for MacBook Pro 6,2, MacBook Pro 10,1 Retina, MacBook Pro 15-inch (early 2011) and might affect many others.
fr: Certains ordinateurs avec cartes graphiques commutables (comme Optimus) échouent dans le choix de la carte vidéo et se bloquent sur un écran noir. Ceci a été constaté sur MacBook Pro 6.2, MacBook Pro 10.1 Retina, MacBook Pro 15 pouces (début 2011) et peut en affecter beaucoup d'autres.

source: There are several possible workarounds for this issue:
fr: Il y a plusieurs possibilités pour contourner ce problème :

source: Explicitly select one of the two graphics adapters in the BIOS instead of letting the system choose one automatically. If this does not solve the problem, try selecting the other graphics adapter.
fr: Sélectionnez explicitement une des deux cartes graphiques dans le BIOS au lieu de laisser le système en choisir une automatiquement. Si cela ne résout pas le problème, essayez en sélectionnant l'autre carte graphique.

source: For the Mac computers, it is possible to use a third-party application, <http://gfx.io/>, to force integrated graphics only through macOS. Then restart in that special mode that works with Tails.
fr: Pour les ordinateurs Mac, il est possible d'utiliser une application tierce, <http://gfx.io/>, pour forcer la carte graphique intégrée uniquement avec macOS. Redémarrez dans ce mode spécial pour faire fonctionner Tails.

source: Expert Linux users can also do the following:
fr: Les personnes expertes de Linux peuvent aussi :

source: Add the `i915.modeset=0 rootpw=pass` option in the [[Boot Loader|doc/advanced_topics/boot_options]].
fr: Ajouter l'option `i915.modeset=0 rootpw=pass` dans le [[menu du chargeur d’amorçage|doc/advanced_topics/boot_options]].

source: Create a file `/etc/X11/xorg.conf.d/switchable.conf` with the following content:
fr: Créer un fichier `/etc/X11/xorg.conf.d/switchable.conf` avec le contenu suivant :

source: Restart X with the command:
fr: Redémarrer X avec la commande :

source: After the GNOME session has started, change again the root password with the command:
fr: Après le démarrage de la session GNOME, modifier à nouveau le mot de passe root avec la commande :

source: For more details, see our issue on [[!tails_ticket 7505 desc="Video is broken with switchable graphics"]].
fr: Pour plus de détails, voir notre problème [[!tails_ticket 7505 desc="Plus d'affichage avec les cartes graphiques commutables"]].

source: <h2 id="sg-segfault">Cannot start GNOME session with switchable graphics computers</h2>
fr: <h2 id="sg-segfault">La session GNOME ne peut pas démarrer sur les ordinateurs avec cartes graphiques commutables</h2>

source: On some computers with switchable graphics, Tails 2.10 and later fails to start the GNOME session and keeps returning to the [[Welcome Screen|doc/first_steps/welcome_screen]].
fr: Sur certains ordinateurs avec cartes graphiques commutables, Tails 2.10 et suivants échouent à ouvrir une session GNOME et reviennent systématiquement à l'[[Écran d'accueil|doc/first_steps/welcome_screen]].

source: <!-- Issue: #12217, Linux #187001 -->
fr: <!-- Problème : #12217, Linux #187001 -->

source: <table> <tr><th>Name</th><th>ID</th><th>Revision number</th></tr> <tr><td>Intel Corporation Mobile GM965/GL960 Integrated Graphics Controller (primary)</td><td>[8086:2a02]</td><td></td></tr> <tr><td>Intel Corporation Mobile GM965/GL960 Integrated Graphics Controller (secondar)</td><td>[8086:2a03]</td><td></td></tr> </table>
fr: <table> <tr><th>Nom</th><th>Identifiant</th><th>Numéro de version</th></tr> <tr><td>Intel Corporation Mobile GM965/GL960 Integrated Graphics Controller (primary)</td><td>[8086:2a02]</td><td></td></tr> <tr><td>Intel Corporation Mobile GM965/GL960 Integrated Graphics Controller (secondar)</td><td>[8086:2a03]</td><td></td></tr> </table>

source: The laptop crashes while running Tails.
fr: L'ordinateur portable plante lors de l'utilisation de Tails.

source: Adding `video=SVIDEO-1:d` to the [[boot options|doc/advanced_topics/boot_options]] fixes the issue.
fr: Ajouter `video=SVIDEO-1:d` dans les [[options de démarrage|doc/advanced_topics/boot_options]] corrige le problème.

source: <h2 id="qemu">Virtual machines with <span class="application">virt-manager</span>, <span class="application">libvirt</span> and <span class="application">QEMU</span></h2>
fr: <h2 id="qemu">Machines virtuelles avec <span class="application">virt-manager</span>, <span class="application">libvirt</span> et <span class="application">QEMU</span></h2>

source: See the [[dedicated troubleshooting documentation|doc/advanced_topics/virtualization/virt-manager#graphics-issues]] about graphics issues in Tails running inside a virtual machine with <span class="application">virt-manager</span>.
fr: Voir la [[documentation de dépannage dédiée|doc/advanced_topics/virtualization/virt-manager#graphics-issues]] à propos des problèmes graphiques lorsque Tails fonctionne dans une machine virtuelle avec <span class="application">virt-manager</span>.

source: <h2 id="vmware">Virtual machines with <span class="application">VMware</span></h2>
fr: <h2 id="vmware">Machines virtuelles avec <span class="application">VMware</span></h2>

source: To improve support of Tails running inside a virtual machine with <span class="application">VMware</span>, [[install|doc/first_steps/additional_software]] the <code>open-vm-tools-desktop</code> software package in Tails.
fr: Pour améliorer le support de Tails tournant à l'intérieur d'une machine virtuelle avec <span class="application">VMware</span>, [[installez|doc/first_steps/additional_software]] le paquet <code>open-vm-tools-desktop</code> dans Tails.

source: <h2 id="boot-options">Probing EDD error</h2> Use these instructions if Tails failed to start and displayed the following error:
fr: <h2 id="boot-options">Sonder l'erreur EDD</h2> Utilisez ces instructions is Tails n'a pas pu démarrer et affiche l'erreur suivante :

source: Follow [[our guide for editing boot options|doc/advanced_topics/boot_options]].
fr: Suivez [[notre guide pour changer les options de démarrage|doc/advanced_topics/boot_options]].

source: For the guide's "Modify the boot options as needed" step, type `edd=off` to add this option to the command line.
fr: Pour l'étape "Modifiez les options de démarrage selon les besoins" du guide, tapez `edd=off` pour ajouter cette option à la ligne de commande.
