Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/upgrade/error/check.*.po
Languages: ru

source: [[!meta title="Error while checking for upgrades"]]
ru: [[!meta title="Ошибка при проверке обновлений"]]

source: Tails could not determine whether an upgrade is available from our website. This is most likely caused by a network connection problem.
ru: Tails не может определить, есть ли нужное обновление на нашем сайте. Скорее всего, ошибка вызвана проблемами с подключением к сети.

source: To solve it:
ru: Выполните следующие шаги.

source: Check your network connection and restart Tails to check for upgrades again.
ru: Проверьте сетевое подключение и перезапустите Tails, чтобы снова проверить обновления.

source: Read our [[release notes|doc/upgrade/release_notes]] to see if there are known issues with automatically upgrading to the latest version of Tails.
ru: Прочтите [[информацию о версиях|doc/upgrade/release_notes]]: может быть, там упоминаются проблемы с автоматическим обновлением до свежей версии Tails.

source: If the problem persists, do a [[manual upgrade|doc/upgrade#manual]].
ru: Если проблема сохраняется, выполните [[обновление вручную|doc/upgrade#manual]].

source: - Do a [[manual upgrade|doc/upgrade#manual]].
ru: - Выполните [[обновление вручную|doc/upgrade#manual]].

source: - Fix the automatic upgrade from a terminal. To do so:
ru: - Исправьте автоматическое обновление из терминала.

source: Start Tails and set up an [[administration password|doc/first_steps/welcome_screen/administration_password]].
ru: Запустите Tails и установите [[пароль администратора|doc/first_steps/welcome_screen/administration_password]].

source: In a terminal, execute the following command:
ru: Выполните в терминале следующую команду:

source: torsocks curl --silent https://tails.boum.org/isrg-root-x1-cross-signed.pem \ | sudo tee --append /usr/local/etc/ssl/certs/tails.boum.org-CA.pem \ && systemctl --user restart tails-upgrade-frontend
ru: torsocks curl --silent https://gitlab.tails.boum.org/tails/tails/-/raw/master/config/chroot_local-includes/usr/share/tails/certs/lets-encrypt-r3.pem \ | sudo tee --append /usr/local/etc/ssl/certs/tails.boum.org-CA.pem \ && systemctl --user restart tails-upgrade-frontend

source: <p>This command is a single command that wraps across several lines. Copy and paste the entire block at once and make sure that it executes as a single command.</p>
ru: <p>Это одна команда, хотя на вид она занимает несколько строк. Скопируйте весь блок и вставьте его в терминал. Убедитесь, что команда исполняется.</p>

source: Approximately 30 seconds later, you should be prompted to upgrade to the latest version of Tails. If no prompt appears, you might already be running the latest version of Tails.
ru: Примерно через 30 секунд вам предложат обновиться до свежей версии Tails. Если вы не видите такое предложение, значит, вы, вероятно, уже используете последнюю версию Tails.
