Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/upgrade/error/install.*.po
Languages: it, pt, ru

source: [[!meta title="Error while installing the upgrade"]]
it: [[!meta title="Errore durante l'installazione dell'aggiornamento"]]
pt: [[!meta title="Erro ao instalar a atualização"]]
ru: [[!meta title="Ошибка при установке обновления"]]

source: The upgrade could not be installed.
it: Non è stato possibile installare l'aggiornamento.
pt: A atualização não pôde ser instalada.
ru: Обновление не устанавливается.

source: <p>Your Tails USB stick needs to be repaired and might be unable to restart.</p>
it: <p>La tua chiavetta USB Tails deve essere riparata e potrebbe non essere in grado di riavviarsi.</p>
pt: <p>O seu pendrive USB com Tails precisa ser reparado e pode não conseguir reiniciar.</p>
ru: <p>Ваша флешка Tails сломалась. Возможно, с неё нельзя перезагрузить систему.</p>

source: This is probably caused by a software error in Tails Upgrader.
it: Probabilmente questo è dovuto a un errore software nell'Upgrader di Tails.
pt: Isto provavelmente foi causado por um erro de software no Atualizador do Tails.
ru: Возможно, это связано с программной ошибкой в Tails Upgrader.

source: Reporting the problem to our help desk
it: Segnalare il problema al nostro help desk
pt: Reportando o problema para nossa central de ajuda
ru: Как сообщить о проблеме в техподдержку

source: If you are comfortable with the command line, please [[report the problem to our help desk|support/talk]].
it: Se sai usare la riga di comando, ti preghiamo di [[segnalare il problema al nostro help desk|support/talk]].
pt: Se você se sente confortável com a linha de comando, por favor [[relate o problema para o nosso suporte|support/talk]].
ru: Если вы умеете обращаться с командной строкой, пожалуйста, [[сообщите о проблеме нашей службе техподдержки|support/talk]].

source: Include in your report:
it: Includi nel tuo rapporto:
pt: Inclua no seu relatório:
ru: Включите в своё сообщение:

source: the debugging information that appears in the error message
it: le informazioni di debug che appaiono nel messaggio d'errore
pt: o conteúdo que aparece na mensagem de erro
ru: отладочную информацию из сообщения об ошибке;

source: - the output of the five following commands, run in a [[<span class=\"application\">Terminal</span>|first_steps/desktop#terminal]]: <pre> ls -l /lib/live/mount/medium/live cat /lib/live/mount/medium/live/Tails.module mount df -h free -m </pre>
it: - l'output dei cinque comandi seguenti, eseguiti in un [[<span class=\"application\">Terminale</span>|first_steps/desktop#terminal]]: <pre> ls -l /lib/live/mount/medium/live cat /lib/live/mount/medium/live/Tails.module mount df -h free -m </pre>
pt: - o resultado dos cinco seguintes comandos, executados em um [[<span class=\"application\">Terminal</span>|first_steps/desktop#terminal]]: <pre> ls -l /lib/live/mount/medium/live cat /lib/live/mount/medium/live/Tails.module mount df -h free -m </pre>
ru: - результаты выполнения следующих пяти команд, выполненных в [[<span class=\"application\">терминале</span>|first_steps/desktop#terminal]]: <pre> ls -l /lib/live/mount/medium/live cat /lib/live/mount/medium/live/Tails.module mount df -h free -m </pre>

source: Repairing your Tails USB stick
pt: Reparando seu pendrive USB com Tails
ru: Восстановление флешки Tails

source: To repair your Tails USB stick, please try doing a [[manual upgrade|upgrade#manual]].
it: Per riparare la tua chiavetta USB Tails, ti preghiamo di provare a eseguire un [[aggiornamento manuale|upgrade#manual]].
pt: Para reparar seu pendrive USB com Tails, por favor tente fazer uma [[atualização manual|upgrade#manual]].
ru: Для восстановления флешки Tails нужно выполнить [[обновление вручную|upgrade#manual]].

source: <p>The Persistent Storage on the USB stick will be preserved.</p>
pt: <p>O Armazenamento Persistente no pendrive USB será preservado.</p>
ru: <p>Постоянное хранилище на флешке сохранится.</p>

source: If the manual upgrade fails as well, please [[report another error|first_steps/bug_reporting]].
it: Se anche l'aggiornamento manuale fallisce, ti preghiamo di [[segnalare anche il nuovo errore|first_steps/bug_reporting]].
pt: Se a atualização manual também falhar, por favor [[relate outro erro|first_steps/bug_reporting]].
ru: Если и вручную обновиться не выходит, пожалуйста, [[напишите нам об этой ошибке|first_steps/bug_reporting]].
