Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/first_steps/start/mac.*.po
Languages: fr

source: [[!meta title="Starting Tails on Mac"]]
fr: [[!meta title="Démarrer Tails sur Mac"]]

source: This page describes the technique to start Tails from a USB stick on Mac.
fr: Cette page décrit la technique pour démarrer Tails depuis une clé USB sur Mac.

source: <h1 id="mac-start">Starting on Mac</h1>
fr: <h1 id="mac-start">Démarrer sur Mac</h1>

source: [[!inline pages="install/inc/steps/mac_startup_disks.inline" raw="yes" sort="age"]]
fr: [[!inline pages="install/inc/steps/mac_startup_disks.inline.fr" raw="yes" sort="age"]]

source: <div class="next"> <p>If the Boot Loader appears, you can continue reading our [[instructions on the Welcome Screen and configuring the Persistent Storage|install/mac#tails]].</p> </div>
fr: <div class="next"> <p>Si le chargeur d'amorçage apparaît, vous pouvez continuer à lire nos [[instructions sur l'Écran de bienvenue et la configuration du stockage persistant|install/mac#tails]].</p> </div>

source: <h1 id="not-at-all">Troubleshooting Tails not starting at all</h1>
fr: <h1 id="not-at-all">Résolution de problèmes : Tails ne démarre pas du tout</h1>

source: Use this section if the computer does not start from the USB stick and the Boot Loader does not display:
fr: Utilisez cette partie si l'ordinateur ne démarre pas depuis la clé USB et si le chargeur d'amorçage ne s'affiche pas :

source: [[!img install/inc/screenshots/grub.png link="no" alt="Black screen ('GNU GRUB') with Tails logo and 2 options: 'Tails' and 'Tails (Troubleshooting Mode)'."]]
fr: [[!img install/inc/screenshots/grub.png link="no" alt="Écran noir ('GNU GRUB') avec le logo Tails et deux options : 'Tails' et 'Tails (Troubleshooting Mode)'."]]

source: <h2 id="verify">Verify your Tails USB stick</h2>
fr: <h2 id="verify">Vérifiez votre clé USB Tails</h2>

source: [[!inline pages="install/inc/steps/basic_troubleshooting.inline" raw="yes" sort="age"]]
fr: [[!inline pages="install/inc/steps/basic_troubleshooting.inline.fr" raw="yes" sort="age"]]

source: <p>If you get the following error message in macOS:</p>
fr: <p>Si vous obtenez le message d'erreur suivant dans macOS :</p>

source: <p class="pre">There may be a problem with this disk image. Are you sure you want to open it?</p>
fr: <p class="pre">il se peut qu'il y ait un problème avec cette image disque. Êtes-vous sûr de vouloir l'ouvrir ?</p>

source: <p>Then, you have to [[install Tails using <i>balenaEtcher</i>|install/mac#etcher]].</p>
fr: <p>Alors vous devez [[installer Tails à l'aide de <i>balenaEtcher</i>|install/mac#etcher]].</p>

source: <h2 id="known-issues-not-at-all">Check our list of known issues</h2>
fr: <h2 id="known-issues-not-at-all">Consultez notre liste des problèmes connus</h2>

source: <h1 id="not-entirely">Troubleshooting Tails not starting after the Boot Loader</h1>
fr: <h1 id="not-entirely">Résolution de problèmes : Tails ne démarre pas après le chargeur d'amorçage</h1>

source: [[!inline pages="doc/first_steps/start/not_entirely.inline" raw="yes" sort="age"]]
fr: [[!inline pages="doc/first_steps/start/not_entirely.inline.fr" raw="yes" sort="age"]]
