Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/first_steps/start/pc.*.po
Languages: fr, it

source: [[!meta title="Starting Tails on PC"]]
fr: [[!meta title="Démarrer Tails sur PC"]]
it: [[!meta title="Avvia Tails on PC"]]

source: This page describes the basic and advanced techniques to start Tails from a USB stick on PC.
fr: Cette page décrit les techniques de base et avancées pour démarrer Tails depuis une clé USB sur un PC.
it: Questa pagina descrive le tecniche di base e avanzate per avviare Tails da una chiavetta USB su PC.

source: <h1 id="windows-restart">Starting from Windows 8 or 10</h1>
fr: <h1 id="windows-restart">Démarrer depuis Windows 8 ou 10</h1>
it: <h1 id="windows-restart">Avvia da Windows 8 o 10</h1>

source: From Windows or the sign-in screen of Windows:
fr: Depuis Windows ou depuis l'écran de connexion de Windows :
it: Da Windows o dalla schermata di accesso di Windows:

source: [[!inline pages="install/inc/steps/windows_boot_menu.inline" raw="yes" sort="age"]]
fr: [[!inline pages="install/inc/steps/windows_boot_menu.inline.fr" raw="yes" sort="age"]]
it: [[!inline pages="install/inc/steps/windows_boot_menu.inline.it" raw="yes" sort="age"]]

source: <div class="next"> <p>If the Boot Loader appears, you can continue reading our [[instructions on the Welcome Screen and configuring the Persistent Storage|install/windows#tails]].</p> </div>
fr: <div class="next"> <p>Si le chargeur d'amorçage apparaît, vous pouvez continuer à lire nos [[instructions sur l'Écran de bienvenue et la configuration du stockage persistant|install/windows#tails]].</p> </div>
it: <div class="next"> <p>Se viene visualizzato il Boot Loader, puoi continuare a leggere le nostre [[istruzioni sulla Schermata di Benvenuto e configurare L'Archivio Persistente|install/windows#tails]].</p> </div>

source: <h1 id="boot-menu-key">Starting with the Boot Menu key</h1>
fr: <h1 id="boot-menu-key">Démarrer avec la touche d'accès au Menu de démarrage</h1>
it: <h1 id="boot-menu-key">Avvio con il tasto Boot Menu </h1>

source: [[!inline pages="install/inc/steps/pc_boot_menu.inline" raw="yes" sort="age"]]
fr: [[!inline pages="install/inc/steps/pc_boot_menu.inline.fr" raw="yes" sort="age"]]
it: [[!inline pages="install/inc/steps/pc_boot_menu.inline.it" raw="yes" sort="age"]]

source: <h1 id="not-at-all">Troubleshooting Tails not starting at all</h1>
fr: <h1 id="not-at-all">Résolution de problèmes : Tails ne démarre pas du tout</h1>
it: <h1 id="not-at-all">Risoluzione dei problemi Tails non si avvia</h1>

source: Use this section if the computer does not start from the USB stick and the Boot Loader does not display:
fr: Utilisez cette partie si l'ordinateur ne démarre pas depuis la clé USB et si le chargeur d'amorçage ne s'affiche pas :
it: Usa questa sezione se il computer non si avvia dalla chiavetta USB e il Boot Loader non compare:

source: [[!img install/inc/screenshots/grub.png link="no" alt="Black screen ('GNU GRUB') with Tails logo and 2 options: 'Tails' and 'Tails (Troubleshooting Mode)'."]]
fr: [[!img install/inc/screenshots/grub.png link="no" alt="Écran noir ('GNU GRUB') avec le logo Tails et deux options : 'Tails' et 'Tails (Troubleshooting Mode)'."]]
it: [[!img install/inc/screenshots/grub.png link="no" alt="Schermo nero ('GNU GRUB') con logo Tails e 2 opzioni: 'Tails' e 'Tails (Modalità risoluzione dei problemi)'."]]

source: <h2 id="verify">Verify your Tails USB stick</h2>
fr: <h2 id="verify">Vérifiez votre clé USB Tails</h2>
it: <h2 id="verify">Verifica la tua chiavetta USB con Tails </h2>

source: [[!inline pages="install/inc/steps/basic_troubleshooting.inline" raw="yes" sort="age"]]
fr: [[!inline pages="install/inc/steps/basic_troubleshooting.inline.fr" raw="yes" sort="age"]]

source: <p>If you get the following error message in Windows:</p>
fr: <p>Si vous obtenez le message d'erreur suivant dans Windows :</p>
it: <p>Se ti appare il seguente messaggio in Windows:</p>

source: <p class="pre">The disc image file is corrupted.</p>
fr: <p class="pre">Le fichier d'image disque est corrompu.</p>
it: <p class="pre">L'immagine disco è corrotta.</p>

source: <p>Then, you have to [[install Tails using <i>balenaEtcher</i>|install/windows#etcher]].</p>
fr: <p>Alors vous devez [[installer Tails à l'aide de <i>balenaEtcher</i>|install/windows#etcher]].</p>
it: <p>Poi, devi [[installare Tails usando <i>balenaEtcher</i>|install/windows#etcher]].</p>

source: <h2 id="known-issues">Check our list of known issues</h2>
fr: <h2 id="known-issues">Consultez notre liste des problèmes connus</h2>
it: <h2 id="problemi noti">Controlla la nostra lista dei problemi noti</h2>

source: Similar problems might have been reported already for your computer model in our [[list of known issues about Tails not starting at all|support/known_issues#pc-not-at-all]].
fr: Des problèmes identiques ont peut-être déjà été signalés pour le modèle de votre ordinateur dans notre [[liste des problèmes connus au sujet de Tails ne démarrant pas du tout|support/known_issues#pc-not-at-all]].
it: Problemi simili al tuo potrebbero essere già stati segnalati per il tuo modello di computer nella nostra [[lista dei problemi noti riguardo a Tails che non parte proprio|support/known_issues#pc-not-at-all]].

source: <h2 id="bios-settings">Edit the BIOS or UEFI settings (advanced users)</h2>
fr: <h2 id="bios-settings">Modifier les paramètres du BIOS ou de l'UEFI (utilisation avancée)</h2>
it: <h2 id="bios-settings">Modifica le impostazioni del BIOS o UEFI (utenti avanzati)</h2>

source: To learn how to edit the BIOS or UEFI settings, search for the user manual of the computer on the support website of the manufacturer.
fr: Pour savoir comment modifier les paramètres du BIOS ou de l'UEFI, recherchez le manuel d'utilisation de l'ordinateur sur le site Web d'assistance du fabricant.
it: Per imparare a modificare le impostazioni del BIOS o UEFI, cerca il manuale d'uso del computer sul sito web di supporto del produttore.

source: <p>Take note of the changes that you apply to the BIOS or UEFI settings. That way, you can revert the changes if they prevent the computer from starting on its usual operating system.</p>
fr: <p>Notez les modifications que vous appliquez aux paramètres du BIOS ou de l'UEFI. De cette façon, vous pourrez rétablir les anciens paramètres s'ils empêchent l'ordinateur de démarrer sur son système d'exploitation habituel.</p>
it: <p> Prendi nota delle modifiche che applichi alle impostazioni del BIOS o UEFI. In questo modo, puoi ripristinare le modifiche se impediscono l'avvio del computer sul suo solito sistema operativo.</p>

source: In the BIOS or UEFI settings, try to apply the following changes:
fr: Dans les paramètres du BIOS ou de l'UEFI, essayez d'appliquer les modifications suivantes :
it: Nelle impostazioni del BIOS o UEFI prova ad applicare le seguenti modifiche:

source: Make sure that the Boot Menu key is enabled, in your BIOS or UEFI options. This option might be called **Boot Device List** or something similar, depending on the computer.
fr: Assurez-vous qu'elle est bien activée dans les options de votre BIOS ou de votre UEFI. Cette option peut s'appeler **liste des périphériques de démarrage (Boot Device List)** ou un nom approchant selon l'ordinateur.
it: Verifica che il tasto Menù di avvio sia abilitato, nelle opzioni del tuo BIOS o UEFI. Questa opzione potrebbe essere denominata **Elenco Dispositivi di Avvio** o in modo simile a seconda del computer.

source: Edit the **Boot Order**. You might see an entry for **Removable devices** or **USB media**. Move this entry to the top of the list to force the computer to start from the USB stick before starting from the internal hard disk.
fr: Modifiez **l'ordre de démarrage (Boot Order**). Vous pouvez voir une entrée pour les **périphériques amovibles** ou **média USB**. Déplacez cette entrée en haut de la liste pour forcer l'ordinateur à démarrer à partir de la clé USB avant de démarrer à partir du disque dur interne.
it: Modifica **L'Ordine di Avvio**. È possibile che sia visualizzato un messaggio per **Dispositivi rimovibili** o **Supporto USB**. Sposta questa voce nella parte superiore dell'elenco per forzare il computer ad avviarsi dalla chiavetta USB prima di avviarsi dal disco rigido interno.

source: - Disable **Fast Boot**.
fr: - Désactiver le **démarrage rapide (Fast Boot)**.
it: - Disabilita **Avvio rapido**.

source: - Enable **CSM Boot**.
fr: - Activer l'option de **démarrage « CSM » (CSM Boot)**.
it: - Abilita **Avvio CSM**.

source: Enable **Legacy Boot**, in addition to UEFI. The computer might not start anymore on its regular operating system if you disable UEFI completely or if you only enable Legacy boot.
fr: Activer le mode **Legacy Boot**, en plus de l'UEFI. L'ordinateur pourrait ne plus démarrer du tout sur le système d'exploitation habituel si vous désactivez complètement l'UEFI ou que vous activez uniquement le mode « Legacy ».
it: Abilita **Avvio Legacy**, in aggiunta a UEFI. Il computer potrebbe non avviarsi più sul solito sistema operativo se disabiliti completamente UEFI o se abiliti solo l'avvio Legacy.

source: Try to upgrade the BIOS or UEFI. To do so, refer to the support website of the computer manufacturer.
fr: Essayez de mettre à jour le BIOS ou l'UEFI. Pour ce faire, consultez le site Web d'assistance du fabricant de l'ordinateur.
it: Prova ad aggiornare il BIOS o UEFI. Per farlo, fai riferimento al sito web di supporto del produttore del computer.

source: <h1 id="not-entirely">Troubleshooting Tails not starting after the Boot Loader</h1>
fr: <h1 id="not-entirely">Résolution de problèmes : Tails ne démarre pas après le chargeur d'amorçage</h1>
it: <h1 id="not-entirely">Troubleshooting Tails non si avvia dopo il Boot Loader</h1>

source: [[!inline pages="doc/first_steps/start/not_entirely.inline" raw="yes" sort="age"]]
fr: [[!inline pages="doc/first_steps/start/not_entirely.inline.fr" raw="yes" sort="age"]]
it: [[!inline pages="doc/first_steps/start/not_entirely.inline.it" raw="yes" sort="age"]]
