Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet/thunderbird/openpgp_migration.*.po
Languages: fr, ru

source: [[!meta title="Migrating OpenPGP configuration from Enigmail in Thunderbird 78"]]
fr: [[!meta title="Migrer la configuration OpenPGP d'Enigmail à Thunderbird 78"]]
ru: [[!meta title="Перенос настроек OpenPGP из Enigmail в Thunderbird 78"]]

source: Since Tails 4.13 (November 2020), *Thunderbird* 78 replaces the *Enigmail* extension with built-in support for OpenPGP encryption.
fr: Depuis Tails 4.13 (novembre 2020), le chiffrement OpenPGP est directement intégré dans *Thunderbird* 78 et remplace l'extension *Enigmail*.
ru: Начиная с версии 4.13 (ноябрь 2020 года), в *Thunderbird* 78 расширение *Enigmail* меняется на встроенную поддержку шифрования OpenPGP.

source: If you used *Enigmail* before Tails 4.13, follow the instructions below to migrate from *Enigmail* to *Thunderbird* 78. Tails does not include *Enigmail* 2.2, the last version of the extension, which automates this migration.
fr: Si vous utilisiez *Enigmail* avant Tails 4.13, suivez les instructions ci-dessous pour migrer d'*Enigmail* à *Thunderbird* 78. Tails n'inclut pas *Enigmail* 2.2, la dernière version de l'extension, qui automatise la migration.
ru: Если вы использовали *Enigmail* до Tails 4.13, следуйте инструкциям ниже. Они помогут перейти с *Enigmail* на *Thunderbird* 78. Последняя версия расширения *Enigmail* 2.2, которая автоматизирует перенос данных, в Tails не включена.

source: See also the official [OpenPGP in Thunderbird - HOWTO and FAQ](https://support.mozilla.org/kb/openpgp-thunderbird-howto-and-faq).
fr: Voir aussi le lien officiel [OpenPGP dans Thunderbird - Guide et questions fréquentes](https://support.mozilla.org/fr/kb/openpgp-thunderbird-guide-faq).
ru: См. также официальное руководство по [OpenPGP в Thunderbird](https://support.mozilla.org/ru/kb/openpgp-v-thunderbird-instrukcii-po-ispolzovaniyu-).

source: <h1 id="private">Migrate your private key</h1>
fr: <h1 id="private">Transférer vos clés secrètes</h1>
ru: <h1 id="private">Перенос секретного (закрытого) ключа</h1>

source: <h2 id="export-private">Export your private key using the <em>Passwords and Keys</em> utility</h2>
fr: <h2 id="export-private">Transférez votre clé secrète en utilisant l'utilitaire <em>Mots de passe et clés</em></h2>
ru: <h2 id="export-private">Перенос секретного ключа с помощью утилиты <em>Пароли и ключи</em></h2>

source: From the desktop:
fr: Depuis le bureau :
ru: В Tails:

source: In the left pane, choose **GnuPG keys**.
fr: Dans le panneau de gauche, choisir **Clés GnuPG**.
ru: В левой панели выберите **Ключи GnuPG**.

source: In the right pane, double-click on the private key that you want to export and use in *Thunderbird*.
fr: Dans le panneau de droite, double-cliquez sur la clé privée que vous voulez exporter et utiliser dans *Thunderbird*.
ru: В правой панели дважды щёлкните по секретному ключу, который хотите экспортировать и использовать в *Thunderbird*.

source: In the **Details** tab of properties dialog, click **Export**.
fr: Dans l'onglet **Détails** de la boîte de dialogue, cliquez sur **Exporter**.
ru: Перейдите на вкладку **Подробности** и щёлкните по кнопке **Экспортировать**.

source: Save your private key in your *Home* directory.
fr: Enregistrez votre clé privée dans votre *Dossier personnel*.
ru: Сохраните секретный ключ в своей *Домашней папке*.

source: Close the *Passwords and Keys* utility.
fr: Fermer l'utilitaire *Mots de passe et clés*.
ru: Закройте утилиту *Пароли и ключи*.

source: <h2 id="import-private">Import your private key in <em>Thunderbird</em></h2>
fr: <h2 id="import-private">Importez votre clé secrète dans <em>Thunderbird</em></h2>
ru: <h2 id="import-private">Импорт секретного ключа в <em>Thunderbird</em></h2>

source: In *Thunderbird*:
fr: Dans *Thunderbird* :
ru: В *Thunderbird*:

source: In the left pane, identify the account that corresponds to the private key that you want to import and choose **End-to-End Encryption**.
fr: Dans le panneau de gauche, identifier le compte pour lequel vous voulez importer la clé privée et choisir **Chiffrement de bout en bout**.
ru: В левой панели определите учётную запись, соответствующую секретному ключу, который хотите импортировать. Выберите **Сквозное шифрование**.

source: In the **Add a Personal OpenPGP Key** dialog, choose **Import an existing OpenPGP Key** and click **Continue**.
fr: Dans la boîte de dialogue **Ajouter une clé OpenPGP personnelle** choisir **Importer une clé OpenPGP existante** et cliquer sur **Continuer**.
ru: В диалоговом окне **Добавить персональный ключ OpenPGP** выберите **Импортировать существующий ключ OpenPGP** и нажмите **Продолжить**.

source: In the next dialog, make sure that your private key is listed and that the option **Treat this key as a Personal Key** is selected.
fr: Dans la boîte de dialogue suivante, vérifiez que votre clé privée est bien listée et que l'option **Considérer cette clé comme une clé personnelle** est sélectionnée.
ru: В следующем диалоговом окне убедитесь, что видите именно ваш секретный ключ, и что выбрана опция **Рассматривать этот ключ в качестве Личного ключа**.

source: Click **Continue**, enter the passphrase for your private key (if any), and click **Continue** again.
fr: Cliquer **Continuer**, entrez la phrase de passe pour votre clé privée (s'il y en a une) et cliquez sur **Continuer** à nouveau.
ru: Нажмите **Продолжить**, введите пароль для вашего секретного ключа (если пароль имеется), нажмите **ОК**, а затем **Продолжить**.

source: Your private key should now be listed in the **End-to-End Encryption** settings of your account.
fr: Votre clé privée doit maintenant être listée dans les paramètres **Chiffrement de bout en bout** de votre compte.
ru: Теперь ваш секретный ключ должен быть указан в настройках **Сквозного шифрования** вашей учётной записи.

source: Select your private key to enable OpenPGP encryption for this account.
fr: Sélectionner votre clé privée pour activer le chiffrement OpenPGP pour ce compte.
ru: Выберите свой ключ, чтобы включить шифрование OpenPGP для этой учётной записи.

source: <h2 id="master-password">Set up a Master Password</h2>
fr: <h2 id="master-password">Configurer un mot de passe principal</h2>
ru: <h2 id="master-password">Установка мастер-пароля</h2>

source: In *Thunderbird* 78, OpenPGP private keys are not protected by a passphrase. That's why we recommend that you set up a Master Password.
fr: Dans *Thunderbird* 78, les clés secrètes OpenPGP ne sont pas protégées par une phrase de passe. C'est pourquoi nous vous recommandons de mettre en place un mot de passe principal.
ru: В *Thunderbird* 78 секретные ключи OpenPGP не защищены паролем. Поэтому мы рекомендуем установить мастер-пароль.

source: With a Master Password, your private key is encrypted in your *Thunderbird* profile and only unlocked while *Thunderbird* is running. If your *Thunderbird* profile is stored in your Persistent Storage, then your private key is encrypted twice: once by *Thunderbird* in your profile and a second time by the encryption of the Persistent Storage.
fr: Avec un mot de passe principal, votre clé privée est chiffrée dans votre profil *Thunderbird* et est déverrouillée uniquement lorsque *Thunderbird* est en cours d’exécution. Si votre profil *Thunderbird* est stocké dans votre stockage persistant, alors votre clé secrète est chiffrée deux fois : une fois par *Thunderbird* dans votre profil et une seconde fois par le chiffrement du stockage persistant.
ru: Если установлен мастер-пароль, ваш секретный ключ шифруется в профиле *Thunderbird* и разблокируется только при работе *Thunderbird*. Если ваш профиль *Thunderbird* хранится в Постоянном хранилище, секретный ключ шифруется дважды. Первый раз это делает *Thunderbird* в профиле, второй раз — в Постоянном хранилище.

source: Choose **Privacy & Security**.
fr: Choisir **Vie privée et sécurité**.
ru: Выберите **Приватность и защита**.

source: In the **Passwords** section, select the option **Use a master password**.
fr: Dans la rubrique **Mots de passe**, sélectionnez l'option **Utiliser un mot de passe principal**.
ru: В разделе **Пароли** выберите опцию **Использовать мастер-пароль**.

source: In the **Change Master Password** dialog, enter your Master Password and click **Ok**.
fr: Dans la boîte de dialogue **Modifier le mot de passe principal**, entrez votre mot de passe principal et cliquez sur **OK**.
ru: В диалоговом окне **Смена мастер-пароля** введите свой мастер-пароль и нажмите **ОК**.

source: <h1 id="public">Migrate the public keys of your contacts</h1>
fr: <h1 id="public">Migrer les clés publiques de vos contacts</h1>
ru: <h1 id="public">Перенос открытых ключей контактов</h1>

source: <h2 id="export-public">Export the public keys using the <em>Password and Keys</em> utility</h2>
fr: <h2 id="export-public">Exporter les clés publiques en utilisant l'utilitaire <em>Mots de passe et clés</em></h2>
ru: <h2 id="export-public">Экспорт открытых ключей с помощью утилиты <em>Пароли и ключи</em></h2>

source: Select the public keys that you want to migrate to *Thunderbird*.
fr: Sélectionnez les clés publiques que vous voulez migrer dans *Thunderbird*.
ru: Выберите открытые ключи для переноса в *Thunderbird*.

source: You can use **Shift+click** and **Ctrl+click** to select multiple keys.
fr: Vous pouvez utiliser **Maj+clic** et **Ctrl+clic** pour sélectionner plusieurs clés.
ru: Можно использовать **Shift** и **Ctrl** одновременно с нажатиями мышью для выбора нескольких ключей.

source: <h2 id="import-public">Import the public keys in <em>Thunderbird</em></h2>
fr: <h2 id="import-public">Importer les clés publiques dans <em>Thunderbird</em></h2>
ru: <h2 id="import-public">Импорт открытых ключей в <em>Thunderbird</em></h2>

source: Choose the file containing the public keys that you exported from the *Passwords and Keys* utility.
fr: Choisissez le fichier contenant les clés publiques que vous avez exporté depuis l'utilitaire *Mots de passe et clés*.
ru: Выберите файл с открытыми ключами, которые вы сохранили ранее с помощью утилиты *Пароли и ключи*.

source: If *Thunderbird* fails to import many public keys at once, split these public keys into several smaller files. *Thunderbird* can only import public key files of less than 5 MB.
fr: Si *Thunderbird* échoue à importer plusieurs clés publiques en une fois, découpez ces clés publiques en plusieurs fichiers plus petits. *Thunderbird* peut uniquement importer des fichiers de clés publiques qui font moins de 5 Mo.
ru: Если *Thunderbird* не удастся импортировать сразу много открытых ключей, раздели их на несколько файлов поменьше. *Thunderbird* может импортировать файлы ключей объёмом менее 5 Мб.

source: <h2 id="accept-public">Mark the public keys as accepted</h2>
fr: <h2 id="accept-public">Marquer les clés publiques comme acceptées</h2>
ru: <h2 id="accept-public">Пометка открытых ключей как принятых</h2>

source: By default, new public keys are not marked as "*accepted*" by *Thunderbird* and you cannot encrypt emails to "unaccepted" keys.
fr: Par défaut, les nouvelles clés publiques ne sont pas marquées comme « *acceptées* » par *Thunderbird* et vous ne pouvez pas chiffrer les messages avec des clés « non acceptées ».
ru: Новые открытые ключи по умолчанию не помечаются как "*принятые*" самим *Thunderbird*. Вы не сможете использовать такие ключи для шифрования почты.

source: To mark a public key as accepted:
fr: Pour marquer une clé publique comme acceptée :
ru: Чтобы пометить открытый ключ как принятый:

source: Double-click on the public key that you want to mark as accepted.
fr: Double-cliquez sur la clé publique que vous voulez marquer comme acceptée.
ru: Дважды щёлкните по открытому ключу, который хотите пометить как принятый.

source: In the **Your Acceptance** tab of the **Key Properties** dialog, select the option that applies to how much you verified the public key.
fr: Dans l'onglet **Votre acceptation** de la boîte de dialogue **Propriétés de la clé**, sélectionner l'option qui correspond à la manière dont vous avez vérifié la clé publique.
ru: Во вкладке **Ваше согласие** диалогового окна **Свойства ключа** выберите вариант в зависимости от того, насколько тщательно вы проверили этот открытый ключ.

source: <h2 id="disable-gnupg">Turn off the GnuPG feature of your Persistent Storage</h2>
fr: <h2 id="disable-gnupg">Désactiver la fonction GnuPG de votre stockage persistant</h2>
ru: <h2 id="disable-gnupg">Выключение опции GnuPG в Постоянном хранилище</h2>

source: If you only use OpenPGP in *Thunderbird*, you can turn off the GnuPG feature of the Persistent Storage:
fr: Si vous utilisez OpenPGP uniquement dans *Thunderbird*, vous pouvez désactiver la fonction GnuPG de votre stockage persistant :
ru: Если вы используете OpenPGP только в *Thunderbird*, можно выключить опцию GnuPG в Постоянном хранилище.

source: Turn off the GnuPG feature.
fr: Désactivez la fonction GnuPG.
ru: Выключите опцию GnuPG.

source: Click **Save**.
fr: Cliquez sur **Enregistrer**.
ru: Нажмите **Save**.
