Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/about/openpgp_keys/signing_key_revocation.*.po
Languages: fr

source: Unfortunately, this reveals some membership information to these two people.
fr: Malheureusement, cela révèle certaines informations à ces deux personnes.

source: Ask the new member to confirm the reception of their share.
fr: Demander à la nouvelle personne de confirmer la réception de sa part.

source: Sharing email
fr: Courrier électronique de partage

source: <pre> Subject: sharing
fr: <pre> Sujet : partage

source: We asked someone else from your group to send you a copy of your share.
fr: Nous avons demandé à une autre personne de votre groupe de vous envoyer une copie de votre part.

source: Please tell us once you receive it.
fr: Veuillez nous prévenir quand vous l'aurez reçu.

source: The address of the mailing list that you should write to in case you want to assemble the revocation certificate is:
fr: L’adresse de la liste de diffusion où vous devez écrire dans le cas où vous voulez assembler le certificat de révocation est :
