Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/about/openpgp_keys/signing_key_revocation.*.po
Languages: fr

source: [[!meta title="Revocation of the Tails signing key"]]
fr: [[!meta title="Révocation de la clé de signature de Tails"]]

source: This document proposes a mechanism for the distribution and activation of the revocation certificate of the Tails signing key.
fr: Ce document propose un mécanisme de distribution et d'activation du certificat de révocation de la clé de signature de Tails.

source: Goals
fr: Objectifs

source: Covered by the current proposal:
fr: Couverts par la proposition actuelle :

source: - Prevent any single individual from revoking our signing key.
fr: - Éviter qu'une seule personne puisse révoquer notre clé de signature.

source: Allow a coalition of people from the Board to revoke our signing key in case most of the people from the Board become unavailable.
fr: Permettre à un regroupement de personnes du conseil d'administration de révoquer notre clé de signature dans le cas où la plupart des personnes du conseil d'administration deviendraient indisponibles.

source: Allow a coalition of people, not necessarily from the Board, to revoke our signing key in case everybody or almost everybody from the Board becomes unavailable.
fr: Permettre à un regroupement de personnes, pas nécessairement du conseil d'administration, de révoquer notre clé de signature dans le cas où tout le monde ou presque tout le conseil d'administration deviendrait indisponible.

source: Make it hard for a coalition of people not from the Board to revoke our signing key unless everybody or almost everybody from the Board becomes unavailable.
fr: Rendre difficile à un regroupement de personnes n'étant pas du conseil d'administration de révoquer notre clé de signature à moins que tout le monde ou presque tout le conseil d'administration ne devienne indisponible.

source: People not from the Board shouldn't know how the shares are spread and who has them.
fr: Les personnes n'étant pas du conseil d'administration ne doivent pas savoir comment les parts sont distribuées et qui en a.

source: People in possession of a share of the revocation certificate of the signing key should have instructions on how to use it if needed.
fr: Une personne en possession d'une part du certificat de révocation de la clé de signature doit avoir des instructions sur comment l'utiliser en cas de besoin.

source: Groups
fr: Groupes

source: We define four complementary groups of trusted people:
fr: Nous définissons quatre groupes complémentaires de personnes de confiance :

source: Group A: people from the Board themselves
fr: Groupe A : les personnes du conseil d'administration

source: Group B
fr: Groupe B

source: Group C
fr: Groupe C

source: Group D
fr: Groupe D

source: All these people should have an OpenPGP key and understand what a revocation certificate is.
fr: Toutes ces personnes doivent avoir une clé OpenPGP et comprendre ce qu'est un certificat de révocation.

source: Cryptographic shares
fr: Parts cryptographiques

source: We generate a revocation certificate of the signing key and split it into a number of cryptographic shares, using for example Shamir's secret sharing scheme implemented by `gfshare`.
fr: Nous générons un certificat de révocation de la clé de signature et le découpons en un certain nombre de parts cryptographiques, par exemple en utilisant la méthode du partage de clé secrète de Shamir, implémentée par `gfshare`.

source: The following combinations of people could get together and reassemble their shares to reconstruct a complete revocation certificate:
fr: Les combinaisons suivantes de personnes pourraient se regrouper et réassembler leurs parts pour reconstruire un certificat de révocation complet :

source: Three people from the Board: A{3}
fr: Trois personnes du conseil d'administration : A{3}

source: Two people from the Board and one person not from the Board: A{2}+(B|C|D)
fr: Deux personnes du conseil d'administration et une autre personne n'appartenant pas au conseil d'administration : A{2}+(B|C|D)

source: One person from the Board, and two people not from the Board but from two different groups: A+(B|C|D){2}
fr: Une personne du conseil d'administration et deux personnes n'appartenant pas au conseil d'administration mais de deux groupes différents : A+(B|C|D){2}

source: Three people not from the Board but from three different groups: (B+C+D){3}
fr: Trois personnes n'appartenant pas au conseil d'administration mais de trois groupes différents : (B+C+D){3}

source: We generate these shares:
fr: Nous générons ces parts :

source: N shares, one for each person from the Board
fr: N parts, une pour chaque personne du conseil d'administration

source: 1 share for people in group B
fr: 1 part pour les personnes du groupe B

source: 1 share for people in group C
fr: 1 part pour les personnes du groupe C

source: 1 share for people in group D
fr: 1 part pour les personnes du groupe D

source: Who knows what
fr: Qui sait quoi

source: People from the Board know the composition of each group
fr: Les personnes du conseil d'administration connaissent la composition de chaque groupe

source: Everybody who owns a share is subscribed to a mailing list.
fr: Toutes les personnes ayant une part sont inscrites à une liste de diffusion.

source: This mailing list is hosted on a trusted server different from boum.org to be more resilient than our usual communication channels.
fr: Cette liste de diffusion est hébergée sur un serveur de confiance différent de boum.org afin d'être plus résilient que nos canaux habituels de communication.

source: Someone hosting the mailing list is part of group B, C, or D so they can ensure that the list keeps working even if it never used.
fr: La personne hébergeant la liste de diffusion fait partie du groupe B, C ou D, ainsi elle peut s'assurer que la liste continue de fonctionner même si elle n'est jamais utilisée.

source: Changing the members of the groups B, C, or D
fr: Changer les membres des groupes B, C, ou D

source: To add someone to a given group:
fr: Pour ajouter une personne à un groupe donné :

source: Request someone from that group to send her share to the new person in the group.
fr: Demander à une personne de ce groupe d'envoyer sa part à la nouvelle personne.

source: To remove someone from a given group:
fr: Pour retirer une personne d'un groupe :

source: Send new shares to everybody except to the person who is being removed.
fr: Envoyer de nouvelles parts à tout le monde sauf à la personne qui est retirée.

source: Request everybody to delete their previous share and track this. Once everybody in 2 groups amongst B, C, or D have deleted their share, it becomes impossible for them to reassemble the revocation certificate with the previous set of shares.
fr: Demander à tout le monde de supprimer leur part précédente et garder une trace de ceci. Une fois que tous les membres de 2 groupes parmi les groupes B, C ou D ont supprimé leur part, il est impossible de reconstituer le certificat avec les anciennes parts.

source: Let's hope that this doesn't happen very often :)
fr: Espérons que cela n'arrive pas souvent :)

source: Expiry
fr: Expiration

source: There is no expiry date on revocation certificates. One way of cancelling the revocation power is to destroy all copies of shares of 2 groups amongst B, C, or D.
fr: Les certificats de révocation n'ont pas de date d'expiration. Une manière d'annuler le pouvoir de révocation est de détruire toutes les copies des parts de deux groupes parmi les groupes B, C ou D.

source: Invitation email
fr: Courrier électronique d'invitation

source: Someone who has a personal trust relationship with the person being invited sends this email.
fr: Une personne qui a une relation de confiance personnelle avec la personne invitée envoi ce courrier électronique.

source: <pre> Subject: distribution
fr: <pre> Sujet : distribution

source: Hi,
fr: Salut,

source: We want to propose you to be part of a distributed mechanism for the revocation certificate of the Tails signing key.
fr: Nous voulons vous proposer de faire partie de notre mécanisme de distribution du certificat de révocation de la clé de signature de Tails.

source: The idea is to distribute cryptographic shares of this revocation certificate to people that we trust. These cryptographic shares can be put together to reassemble the revocation certificate and revoke the Tails signing key. This may be needed in case something really bad happens to us and we are not able to do the revocation ourselves.
fr: L'idée est de distribuer des parts cryptographiques du certificat de révocation à des personnes en qui nous avons confiance. Ces parts cryptographiques peuvent être mises ensemble pour réassembler le certificat de révocation et révoquer la clé de signature de Tails. Cela peut être nécessaire dans le cas où quelque chose de vraiment mauvais nous arriverais et où nous ne serions pas capable de faire la révocation nous-mêmes.

source: Note: In all this document, 'us' refers to the Board.
fr: Note : dans tout ce document, « nous » fait référence au conseil d'administration.

source: You can read a complete description of the distribution mechanism on:
fr: Vous pouvez lire la description complète du mécanisme de distribution sur :

source: https://tails.boum.org/doc/about/openpgp_keys/signing_key_revocation.
fr: https://tails.boum.org/doc/about/openpgp_keys/signing_key_revocation/index.fr.html.

source: The recipe is public and the only secret component is the list of people who are in possession of the cryptographic material.
fr: La procédure est publique et le seul élément secret est la liste des personnes en possession du matériel cryptographique.

source: We are proposing this to you because we trust in both your technical abilities to store your share in a safe place and manipulate it as required. But also because we trust you as a human being to make informed judgment on when to use your share and act only in the interest of Tails.
fr: Nous vous proposons cela car nous vous faisons confiance à la fois pour vos capacités techniques à stocker votre part dans un lieu sûr et à faire les manipulations nécessaires. Mais également car nous vous faisons confiance en tant qu'être humain pour avoir un jugement éclairé sur quand utiliser cette part et pour agir uniquement dans l'intérêt de Tails.

source: The bad things that could happen if the mechanism fails are:
fr: Les pires choses qui pourraient arriver si le mécanisme échoue sont :

source: A. The signing key is not revoked when it should be. This could allow possible attackers to distribute malicious Tails images or publish malicious information on our name.
fr: A. La clé de signature n'est pas révoquée lorsqu'elle le devrait. Cela pourrait rendre possible à des attaquants de distribuer des images Tails malveillantes ou de publier des informations malveillantes en notre nom.

source: B. The signing key is revoked when it should not have been. This would prevent people from verifying our images with OpenPGP until we publish a new signing key and build trust in it.
fr: B. La clé de signature est révoquée alors qu'elle n'aurait pas dû. Cela pourrait empêcher des personnes de vérifier nos images avec OpenPGP jusqu'à ce que nous publions une nouvelle clé de signature et construisions la confiance en elle.

source: Distribution of the shares
fr: Distribution des parts

source: Each person from the Board, group A, has a *different* share, A1, A2, ..., An.
fr: Chaque personne du conseil d'administration, groupe A, a une part *différente*, A1, A2, ..., An.

source: On top of this, we defined three complementary groups, B, C, and D of trusted people who have a close relationship with Tails but different interests and different access to information about us. You are part of one of these groups.
fr: En plus de ça, nous définissons trois groupes complémentaires, B, C, et D de personnes de confiance qui sont proches de Tails mais avec des intérêts différents et des accès différents aux informations nous concernant. Vous faites partie d'un de ces groupes.

source: Everybody in group B has an *identical* share B.
fr: Tout le monde dans le groupe B a une part B *identique*.

source: Everybody in group C has an *identical* share C.
fr: Tout le monde dans le groupe C a une part C *identique*.

source: Everybody in group D has an *identical* share D.
fr: Tout le monde dans le groupe D a une part D *identique*.

source: Three different shares are needed to reassemble the revocation certificate. For example, shares A1, A2, and A3, or shares A1, B, and C.
fr: Trois parts différentes sont nécessaires pour réassembler le certificat de révocation. Par exemple, les parts A1, A2 et A3, ou les parts A1, B et C.

source: How to store your share
fr: Comment stocker vos parts

source: Please keep your share in an encrypted storage and make it as hard as you can for untrusted people to get a copy of it.
fr: Veillez conserver votre part dans un stockage chiffré et rendre aussi difficile que possible à une personne non-fiable d'en faire une copie.

source: You can rename the file as long as you keep the number in the file name of your share as it is needed to use the share.
fr: Vous pouvez renommer le fichier tant que vous conservez le nombre dans le nom du fichier de votre part car il est nécessaire pour utiliser la part.

source: Feel free to back up the file but we might also request you to delete it at some point and you should be able to know whether you still have a copy of it or not. It is all-right to lose your share as long as you tell us that you have lost it. It is actually worse to still have a copy of the share "somewhere" while thinking that you don't, than to lose it by mistake.
fr: N'hésitez pas à faire une sauvegarde du fichier mais à un moment nous pourrions vous demander de le supprimer et vous devrez pouvoir être en mesure de savoir si vous avez encore une copie ou non. Ce n'est pas grave de perde votre part si vous nous prévenez que vous l'avez perdu. Il est actuellement pire de continuer à avoir une copie de votre part "quelque part" en pensant ne pas en avoir que de l'avoir perdu par erreur.

source: Don't hesitate to ask us if you need clarification on the technical aspects of this.
fr: N'hésitez pas à nous demander si vous avez besoin de clarification sur les aspects techniques de cela.

source: When to use your share
fr: Quand utiliser votre part

source: Everybody in possession of a share is subscribed to a mailing list.
fr: Tout le monde en possession d'une part est inscrit à une liste de diffusion.

source: If someone in possession of a share gets to learn about a very bad event that happened to many of us and really thinks that we are not capable of revoking the Tails signing key ourselves anymore, then this person should write to the mailing list explaining why she thinks that the signing key needs to be revoked.
fr: Si une personne en possession d'une part apprenait qu'un très mauvais événement était arrivé à un grand nombre d'entre nous et pense vraiment que nous ne serons plus capable de révoquer la clé de signature de Tails nous-mêmes, alors cette personne doit écrire à la liste de diffusion en expliquant pourquoi elle pense que la clé de signature doit être révoquée.

source: Yes, there is no mathematically proven algorithm for this and here is where your judgment as a human being is needed. The description of the very bad event should be checked or backed by enough people to be plausible.
fr: Oui, il y a un algorithme mathématiquement prouvé pour cela et c'est ici que votre jugement en tant qu'être humain est nécessaire. La description du très mauvais évènement doit être vérifié ou soutenu par suffisamment de personnes pour être plausible.

source: People on the list who are also convinced that the signing key should be revoked share their shares until they have 3 different shares. Then they can assemble the revocation certificate and publish it to revoke the signing key.
fr: Les personnes de cette liste qui sont convaincues que la clé de signature doit être révoquée partagent leurs parts jusqu'à avoir 3 parts différentes. Ensuite elles peuvent assembler le certificat de révocation et le publier pour révoquer la clé de signature.

source: Keep in mind that we could still revoke the signing key ourselves as long as three of us are able to communicate and gather their shares. So we only need your help if no more than two of us are still able to communicate.
fr: Gardez en tête que nous pouvons toujours révoquer la clé de signature nous-mêmes si trois d'entre nous sont capables de communiquer et d'échanger leurs parts. Donc nous avons besoin de votre aide seulement si pas plus de deux d'entre nous sont capables de communiquer.

source: Unless you really want to start the key revocation process, do not write to this mailing list.
fr: À moins que n’ayez réellement besoin de commencer le processus de révocation de la clé, n'écrivez pas à la liste de diffusion.

source: Further communications
fr: Communications futures

source: In case we need to communicate with you about this revocation mechanism in the future, we will always do it through the tails@boum.org mailing list. We might do so for example to:
fr: Dans le cas où nous aurions besoin à l'avenir de communiquer avec vous à propos de ce mécanisme de révocation, nous le ferons toujours par la liste de diffusion tails@boum.org. Nous pourrions faire ça pour par exemple :

source: Ask you to send your share to a new member of your group.
fr: Vous demander d'envoyer votre part à un nouveau membre de votre groupe.

source: Ask you to delete your share. This could be needed to cancel the power of others people's share: as long as enough of you delete their shares, the few people that might not delete them would end up with unusable shares.
fr: Vous demander de supprimer votre part. Cela peut-être nécessaire pour annuler le fonctionnement de la part d'une autre personne : dès que suffisamment d'entre vous avez supprimé votre part, les quelques personnes ne l'ayant pas supprimé se retrouvent avec des parts inutilisables.

source: The tails@boum.org mailing list has its own OpenPGP key, which is signed by the Tails signing key itself:
fr: La liste de diffusion tails@boum.org a sa propre clé OpenPGP, qui est signée par la clé de signature de Tails elle-même :

source: So, can we count on you for this?
fr: Donc, pouvons-nous compter sur vous ?

source: If you answer positively, we will send you your share and subscribe you to the mailing list.
fr: Si vous répondez positivement, nous allons vous envoyer votre part et vous inscrire à la liste de diffusion.

source: Thanks, and may the force be with you! </pre>
fr: Merci et que la force soit avec vous ! </pre>

source: Keeping the members of the groups B, C, and D up-to-date
fr: Garder les membres des groupes B, C et D à jour

source: At least every 2 years, we make sure that the mechanism still works:
fr: Au moins tous les 2 ans, nous nous assurons que le mécanisme fonctionne toujours :

source: We review internally the list of members of each group and decide possible additions to, and removals from, each group.
fr: Nous vérifions en interne la liste des membres de chaque groupe et décidons de possibles ajouts ou retraits de chaque groupe.

source: We write to every individual member of each group to ask them to check that they still have their share and the number in the file name.
fr: Nous écrivons individuellement à chaque membre de chaque groupe pour demander de vérifier si il a toujours sa part et le numéro dans le nom du fichier.

source: We log in to the administration interface of the mailing list, make sure that it still exists, and is configured correctly.
fr: Nous nous connectons à l'interface d'administration de la liste de diffusion pour s'assurer qu'elle existe toujours et qu'elle est configurée correctement.

source: Update email
fr: Courrier électronique de mise à jour

source: We send these emails through tails@boum.org to avoid the need for a personal trust relationship between the person sending the mail and the recipient. We don't send shares from groups B, C, or D with tails@boum.org by doing so.
fr: Nous envoyons ces courriers électroniques depuis tails@boum.org pour éviter d'avoir besoin d'une relation de confiance personnelle entre la personne envoyant le courrier et celle le recevant. Nous n'envoyons pas les parts des groupes B, C ou D avec tails@boum.org de cette façon.

source: <pre> Subject: update
fr: <pre> Sujet : mise à jour

source: Some years ago, you agreed to be part of a distributed mechanism for the revocation certificate of the Tails signing key and we sent you a cryptographic share of this revocation certificate.
fr: Il y a plusieurs années, vous avez accepté de faire partie de notre mécanisme de distribution du certificat de révocation de la clé de signature de Tails et nous vous avions envoyé une part cryptographique du certificat de révocation.

source: Today, we are asking you to:
fr: Aujourd’hui, nous vous demandons de :

source: Verify the authenticity of this email, either by verifying that it is signed by the tails@boum.org mailing or by talking directly to someone from the Board.
fr: Vérifier l'authenticité de ce courrier électronique, au choix en vérifiant qu'il soit signé par tails@boum.org ou en discutant directement avec une personne du conseil d'administration.

source: The tails@boum.org mailing list has its own OpenPGP key, which is signed by the Tails signing key itself:
fr: La liste de diffusion tails@boum.org a sa propre clé OpenPGP, qui est signée par la clé de signature de Tails elle-même :

source: Confirm whether you still have in your possession:
fr: Confirmer que vous avez toujours en votre possession :

source: Your share of the revocation certificate.
fr: Votre part du certificat de révocation.

source: The number NNN in the file name of your share.
fr: Le numéro NNN dans le nom de fichier de votre part.

source: The file was named tails-signing-key-revocation-cert.asc.NNN, where NNN is a 3 digit number.
fr: Le fichier est nommé tails-signing-key-revocation-cert.asc.NNN, où NNN est un numéro à 3 chiffres.

source: For the record, the address of the mailing list that you should write to in case you want to assemble the revocation certificate is:
fr: Pour votre information, l’adresse de la liste de diffusion où vous devez écrire dans le cas où vous voulez assembler le certificat de révocation est :

source: address@example.org
fr: adresse@exemple.org

source: Do not write to this mailing list unless you really want to start the key revocation process.
fr: N'écrivez pas à cette liste de diffusion à moins que n’ayez réellement besoin de commencer le processus de révocation de la clé.

source: We are also copying below a summary of the mechanism.
fr: Nous avons également copié ci-dessous le résumé du mécanisme.

source: XXX: Copy the invitation email: XXX: - Include "You can read a complete description of the distribution mechanism on:" XXX: - Stop before "So, can we count on you for this?" </pre>
fr: XXX : Copier le courrier électronique d'invitation : XXX : - Inclure "Vous pouvez lire la description complète du mécanisme de distribution sur :" XXX : - Arrêter avant "Donc, pouvons-nous compter sur vous ?" </pre>

source: Adding a new member
fr: Ajouter une nouvelle personne

source: Send the [[invitation email|signing_key_revocation#invitation]] to the new member.
fr: Envoyer le [[courrier électronique d'invitation|signing_key_revocation#invitation]] à la nouvelle personne.

source: If they agree, ask someone else from the same group to send them their share of the key.
fr: Si elle est d'accord, demander à une autre personne du même groupe de lui envoyer sa part de la clé.
