Repository: KaushalIngle/CuOS
Catalog: wiki/src/donate/thanks.*.po
Languages: es, it

source: [[!meta title="Thank you!"]]
es: [[!meta title="¡Gracias!"]]
it: [[!meta title="Grazie!"]]

source: [[!img thanks.png link="no" alt="Tails protects the most vulnerable"]]
es: [[!img thanks.png link="no" alt="Tails protege a los más vulnerables"]]
it: [[!img thanks.png link="no" alt="Tails protegge le persone più vulnerabili"]]

source: Thank you so much for your support!
es: ¡Muchas gracias por tu apoyo!
it: Grazie mille per il tuo supporto!

source: Your generous donation will keep safe the people who need it the most and protect freedom in the digital age.
es: Tu generosa donación mantendrá segura a la gente que más lo necesita y protegerá la libertad en la era digital.
it: La tua generosa donazione manterrà al sicuro le persone che ne hanno più bisogno e proteggerà la libertà nell'era digitale.

source: Most Internet tools fund themselves by spying on their users. At Tails, we do things differently and we couldn't do it without you.
es: La mayoría de las herramientas de internet se financian espiando a sus usuarios. En Tails hacemos las cosas de manera distinta y no podríamos hacerlo sin ti.
it: Numerosi applicativi di Internet si autofinanziano spiando i propri utenti. In Tails, noi facciamo le cose diversamente e non potremmo farcela senza di te.

source: If you need a donation receipt, contact us at <a href="mailto:tails-fundraising@boum.org">tails-fundraising@boum.org</a> ([[OpenPGP key|tails-fundraising.key]]).
es: Si necesitas un recibo de donación, contáctanos en <a href="mailto:tails-fundraising@boum.org">tails-fundraising@boum.org</a> ([[Clave OpenPGP|tails-fundraising.key]]).

source: Your donation will appear as made to Riseup Labs, our fiscal sponsor.
es: Tu donación aparecerá como hecha a Riseup Labs, nuestro sponsor fiscal.
it: La tua donazione verrà visualizzata in favore di Riseup Labs, il nostro sponsor fiscale.

source: <em>We train human-rights activists and journalists to use Tails if they are gonna be looking deep into shady business.
es: <em>Entrenamos a activistas y periodistas en el uso de Tails si investigan negocios sucios.
it: <em>Formiamo attivisti dei diritti umani e giornalisti a usare Tails se vogliono approfondire affari loschi.

source: Mexico is a dangerous place to research issues when the organized crime and private companies are together behind some of the most violent stuff that we see here.</em>
es: Mexico es un lugar peligroso para investigar problemas ya que el crimen organizado y compañía privadas están detrás de algunas de las cosas más violentas que vemos aquí.</em>
it: Il Messico è un posto pericoloso per scavare nelle questioni quando il crimine organizzato e le compagnie private sono coinvolte nelle cose più violente che si vedono qui.</em>

source: &mdash; <strong>Digital security trainer, Mexico</strong>
es: &mdash; <strong>Entrenador de seguridad digital, Mexico</strong>
it: &mdash; <strong>Docente di sicurezza digitale, Messico</strong>

source: <em>I always have a Tails USB stick handy, especially when traveling. Pakistan really isn't the safest place for journalists.
es: <em>Siempre tengo una memoria USB con Tails, especialmente cuando viajo. Pakistán no es un lugar seguro para periodistas.
it: <em>Ho sempre una chiavetta USB Tails a portata di mano, soprattutto quando si viaggia. Il Pakistan non è esattamente il posto più sicuro per i giornalisti.

source: Thanks Tails for an amazing tool!</em>
es: ¡Gracias Tails por una herramienta asombrosa!</em>
it: Grazie Tails per il fantastico strumento!</em>

source: &mdash; <strong>Freelance journalist, Pakistan</strong>
es: &mdash; <strong>Periodista independiente, Pakistán</strong>
it: &mdash; <strong>Giornalista indipendente, Pakistan</strong>

source: Help us spread the word
es: Ayúdanos a pasar la palabra
it: Aiutaci a diffondere il messaggio

source: <a href="https://twitter.com/intent/tweet?url=https%3A%2F%2Ftails.boum.org%2Fdonate%2F%3Fr%3Dtn&text=I%20donate%20to%20@Tails_live%20because%20nobody%20should%20have%20to%20pay%20to%20be%20safe%20while%20using%20computers." class="tweet" target="_blank"> [[!img godzilla.png link="no" alt=""]]
es: <a href="https://twitter.com/intent/tweet?url=https%3A%2F%2Ftails.boum.org%2Fdonate%2F%3Fr%3Dtn&text=Yo%20dono%20a%20@Tails_live%20porque%20nadie%20deber%C3%ADa%20tener%20que%20pagar%20para%20estar%20seguro%20mientras%20usa%20una%20computadora." class="tweet" target="_blank"> [[!img godzilla.png link="no" alt=""]]

source: I donate to @Tails_live because nobody should have to pay to be safe while using computers.
es: Yo dono a @Tails_live porque nadie debería tener que pagar para estar seguro mientras usa una computadora.
it: Sostengo @Tails_live perchè nessuno dovrebbe pagare per essere al sicuro mentre si usa il computer.

source: </a> <a href="https://twitter.com/intent/tweet?url=https%3A%2F%2Ftails.boum.org%2Fdonate%2F%3Fr%3Dts&text=I%20proudly%20support%20@Tails_live%20to%20keep%20safe%20activists%2C%20journalists%2C%20and%20domestic%20violence%20survivors." class="tweet" target="_blank"> [[!img godzilla.png link="no" alt=""]]
es: </a> <a href="https://twitter.com/intent/tweet?url=https://twitter.com/intent/tweet?url=https%3A%2F%2Ftails.boum.org%2Fdonate%2F%3Fr%3Dts&text=Yo apoyo orgullosamente a @Tails_live para mantener a salvo activistas, periodistas, y sobrevivientes de violencia doméstica." class="tweet" target="_blank"> [[!img godzilla.png link="no" alt=""]]

source: I proudly support @Tails_live to keep safe activists, journalists, and domestic violence survivors.
es: Yo apoyo orgullosamente a @Tails_live para mantener a salvo activistas, periodistas, y sobrevivientes de violencia doméstica.
it: Sostengo con orgoglio @Tails_live per mantenere al sicuro chi è attivista, giornalista e le vittime di violenza domestica.

source: Follow us
es: Síguenos
it: Seguici
