Repository: KaushalIngle/CuOS
Catalog: wiki/src/donate.*.po
Languages: es

source: [[!meta title="Donate to fight surveillance and censorship"]]
es: [[!meta title="Dona para luchar contra la vigilancia y la censura"]]

source: Tails is their strongest protection
es: Tails es su protección más fuerte

source: At Tails, we build a liberating operating system that puts people in control of their digital lives:
es: En Tails, creamos un sistema operativo liberador que pone a las personas en control de sus vidas digitales:

source: <b>Journalists and whistleblowers</b> use Tails to denounce the wrongdoings of governments and corporations.
es: <b>Periodistas e informantes</b> usan Tails para denunciar los delitos de gobiernos y corporaciones.

source: <b>Activists</b> use Tails to avoid surveillance and organize their struggles for liberatory social change.
es: <b>Activistas</b> usan Tails para evitar la vigilancia y organizar sus luchas por un cambio social liberador.

source: <b>Domestic violence survivors</b> use Tails to escape surveillance at home.
es: <b>Sobrevivientes de violencia domestica</b> usan Tails para escapar de la vigilancia en casa.

source: <b>Privacy-concerned citizens</b> use Tails to avoid online tracking and censorship.
es: <b>Ciudadanos preocupados por su privacidad</b> usan Tails para evadir la vigilancia y la censura en Internet.

source: Tails is and will remain Free Software because the most vulnerable and oppressed people are the most in need of privacy and security.
es: Tails es gratis y seguirá siendo Software Libre, porque la gente más vulnerable y oprimida es precisamente la que necesita más privacidad y seguridad.

source: Donations from passionate people like you are our most valuable source of funding because they guarantee our independence. We are a very small non-profit and our yearly budget is ridiculously small compared to the value of Tails.
es: Las donaciones de gente comprometida como tú, son nuestra fuente de financiación más valiosa porque garantizan nuestra independencia. Somos una organización muy pequeña sin fines de lucro y nuestro presupuesto anual es ridículamente pequeño comparado con el valor de Tails.

source: <input type="hidden" name="cmd" value="_xclick-subscriptions" id="cmd"/> <input type="hidden" name="business" value="tailsriseuplabs@riseup.net" id="business"/> <input type="hidden" name="currency_code" value="USD" id="currency_code"/> <input type="hidden" name="item_name" value="Donation to Tails"/> <input type="hidden" name="custom" id="custom"/> <input type="hidden" name="no_note" value="1"/> <input type="hidden" name="return" value="https://tails.boum.org/donate/thanks/" class="return-url"/> <input type="hidden" name="cancel_return" value="https://tails.boum.org/donate/canceled/" class="return-url"/> <input type="hidden" name="lc" value="US"/> <input type="hidden" name="a3" value="5" id="a3"/> <input type="hidden" name="t3" value="M" id="t3"/> <input type="hidden" name="p3" value="1"/> <input type="hidden" name="src" value="1"/> <input type="hidden" name="amount" value="5" id="amount"/>
es: <input type="hidden" name="cmd" value="_xclick-subscriptions" id="cmd"/> <input type="hidden" name="business" value="tailsriseuplabs@riseup.net" id="business"/> <input type="hidden" name="currency_code" value="USD" id="currency_code"/> <input type="hidden" name="item_name" value="Donation to Tails"/> <input type="hidden" name="custom" id="custom"/> <input type="hidden" name="no_note" value="1"/> <input type="hidden" name="return" value="https://tails.boum.org/donate/thanks/" class="return-url"/> <input type="hidden" name="cancel_return" value="https://tails.boum.org/donate/canceled/" class="return-url"/> <input type="hidden" name="lc" value="ES"/> <input type="hidden" name="a3" value="5" id="a3"/> <input type="hidden" name="t3" value="M" id="t3"/> <input type="hidden" name="p3" value="1"/> <input type="hidden" name="src" value="1"/> <input type="hidden" name="amount" value="5" id="amount"/>

source: <label class="btn btn-lg btn-primary active" id="currency-dollar"> <input type="radio" id="dollars" autocomplete="off" checked data-complete-text="finished!"/> Dollars </label> <label class="btn btn-lg btn-primary" id="currency-euro"> <input type="radio" id="euros" autocomplete="off" checked data-complete-text="finished!"/> Euros </label>
es: <label class="btn btn-lg btn-primary active" id="currency-dollar"> <input type="radio" id="dollars" autocomplete="off" checked data-complete-text="finished!"/> Dólares </label> <label class="btn btn-lg btn-primary" id="currency-euro"> <input type="radio" id="euros" autocomplete="off" checked data-complete-text="finished!"/> Euros </label>

source: <span class="input-group-addon">$</span> <input type="text" pattern="\d+" class="form-control" id="other-dollar" placeholder="Other"/>
es: <span class="input-group-addon">$</span> <input type="text" pattern="\d+" class="form-control" id="other-dollar" placeholder="Otro"/>

source: <label class="col-sm-4 col-xs-12"><input type="radio" name="frequency" id="one-time"/>One-time</label> <label class="col-sm-4 col-xs-12"><input type="radio" name="frequency" id="monthly"/>Monthly</label> <label class="col-sm-4 col-xs-12"><input type="radio" name="frequency" id="yearly"/>Yearly</label>
es: <label class="col-sm-4 col-xs-12"><input type="radio" name="frequency" id="one-time"/>Única vez</label> <label class="col-sm-4 col-xs-12"> <input type="radio" name="frequency" id="monthly"/>Mensual</label> <label class="col-sm-4 col-xs-12"><input type="radio" name="frequency" id="yearly"/>Anual </label>

source: Monthly and yearly donations, even the smallest, are the most valuable for the sustainability of Tails. They require a [[!img paypal-inline.png link="no" class="paypal-inline" alt="PayPal"]] account.
es: Las donaciones mensuales y anuales, incluso las más pequeñas, son las más valiosas para la sostenibilidad de Tails. Requieren una cuenta de [[!img paypal-inline.png link="no" class="paypal-inline" alt="PayPal"]].

source: <label> <input type="checkbox" id="opt-in"/>I want to receive a newsletter 2&ndash;3 times a year. </label>
es: <label> <input type="checkbox" id="opt-in"/>Quiero recibir un boletín informativo 2&ndash;3 veces al año. </label>

source: We will use the email address provided in the PayPal form.
es: Usaremos la dirección de correo electrónico proporcionada en el formulario de PayPal.

source: <button class="btn btn-primary btn-lg btn-block col-md-12">Donate</button>
es: <button class="btn btn-primary btn-lg btn-block col-md-12">Donar</button>

source: Your donation goes entirely to Tails and will be handled by Riseup Labs which is a 501(c)(3) non-profit organization in the USA.
es: Tu donación llegará a Tails en su totalidad y será gestionada por Riseup Labs que es una organización sin fines de lucro 501(c)(3) en Estados Unidos.

source: <strong>Donations are [[!toggle id="tax-deductible" text="tax-deductible"]] to the full extent permitted by law.</strong>
es: <strong>Las donaciones son [[!toggle id="tax-deductible" text="deducibles de impuestos"]] dentro de los límites impuestos por la ley</strong>

source: Your donation goes entirely to Tails and will be handled by CCT which is a non-profit organization in Germany.
es: Tu donación llegará a Tails en su totalidad y será gestionada por CCT que es una organización sin fines de lucro de Alemania.

source: If you need a donation receipt, contact us at
es: Si necesitas el recibo de una donación, contáctanos a

source: Donate in dollars
es: Dona en dólares

source: Recurring donation
es: Donación recurrente

source: <input type="hidden" name="cmd" value="_xclick-subscriptions"/> <input type="hidden" name="business" value="tailsriseuplabs@riseup.net"/> <input type="hidden" name="currency_code" value="USD" id="currency_code"/> <input type="hidden" name="item_name" value="Donation to Tails"/> <input type="hidden" name="no_note" value="1"/> <input type="hidden" name="return" value="https://tails.boum.org/donate/thanks/" class="return-url"/> <input type="hidden" name="cancel_return" value="https://tails.boum.org/donate/canceled/" class="return-url"/> <input type="hidden" name="lc" value="US"/> <input type="hidden" name="src" value="1"/> <input type="hidden" name="p3" value="1"/> <label for="sub5"><input type="radio" name="a3" value="5" id="sub5" checked="checked"/>$5</label> <label for="sub10"><input type="radio" name="a3" value="10" id="sub10"/>$10</label> <label for="sub25"><input type="radio" name="a3" value="25" id="sub25"/>$25</label> <label for="sub50"><input type="radio" name="a3" value="50" id="sub50"/>$50</label>
es: <input type="hidden" name="cmd" value="_xclick-subscriptions"/> <input type="hidden" name="business" value="tailsriseuplabs@riseup.net"/> <input type="hidden" name="currency_code" value="USD" id="currency_code"/> <input type="hidden" name="item_name" value="Donation to Tails"/> <input type="hidden" name="no_note" value="1"/> <input type="hidden" name="return" value="https://tails.boum.org/donate/thanks/" class="return-url"/> <input type="hidden" name="cancel_return" value="https://tails.boum.org/donate/canceled/" class="return-url"/> <input type="hidden" name="lc" value="ES"/> <input type="hidden" name="src" value="1"/> <input type="hidden" name="p3" value="1"/> <label for="sub5"><input type="radio" name="a3" value="5" id="sub5" checked="checked"/>$5</label> <label for="sub10"><input type="radio" name="a3" value="10" id="sub10"/>$10</label> <label for="sub25"><input type="radio" name="a3" value="25" id="sub25"/>$25</label> <label for="sub50"><input type="radio" name="a3" value="50" id="sub50"/>$50</label>

source: <label for="sub_m"><input type="radio" name="t3" value="M" id="sub_m" checked="checked"/>Monthly</label> <label for="sub_y"><input type="radio" name="t3" value="Y" id="sub_y"/>Yearly</label>
es: <label for="sub_m"><input type="radio" name="t3" value="M" id="sub_m" checked="checked"/>Mensual</label> <label for="sub_y"><input type="radio" name="t3" value="Y" id="sub_y"/>Anual</label>

source: <label><input type="checkbox" name="custom"/>I want to receive a newsletter 2&ndash;3 times a year.</label>
es: <label><input type="checkbox" name="custom"/>Quiero recibir un boletín informativo 2&ndash;3 veces al año.</label>

source: <input type="submit" value="Donate (recurring)"/>
es: <input type="submit" value="Dona (recurrente)"/>

source: One-time donation
es: Donar por única vez

source: Does not require a [[!img paypal-inline.png link="no" class="paypal-inline" alt="PayPal"]] account.
es: No requiere una cuenta de [[!img paypal-inline.png link="no" class="paypal-inline" alt="PayPal"]].

source: <input type="hidden" name="cmd" value="_donations"/> <input type="hidden" name='business' value="tailsriseuplabs@riseup.net"/> <input type="hidden" name="currency_code" value="USD" id="currency_code"/> <input type="hidden" name="item_name" value="Donation to Tails"/> <input type="hidden" name="no_note" value="1"/> <input type="hidden" name="return" value="https://tails.boum.org/donate/thanks/" class="return-url"/> <input type="hidden" name="cancel_return" value="https://tails.boum.org/donate/canceled/" class="return-url"/> <input type="hidden" name="lc" value="US"/> <label for="pp_5"><input type="radio" name="amount" value="5" id="pp_5" checked="checked"/>$5</label> <label for="pp_10"><input type="radio" name="amount" value="10" id="pp_10"/>$10</label> <label for="pp_25"><input type="radio" name="amount" value="25" id="pp_25"/>$25</label> <label for="pp_50"><input type="radio" name="amount" value="50" id="pp_50"/>$50</label>
es: <input type="hidden" name="cmd" value="_donations"/> <input type="hidden" name='business' value="tailsriseuplabs@riseup.net"/> <input type="hidden" name="currency_code" value="USD" id="currency_code"/> <input type="hidden" name="item_name" value="Donation to Tails"/> <input type="hidden" name="no_note" value="1"/> <input type="hidden" name="return" value="https://tails.boum.org/donate/thanks/index.es.html" class="return-url"/> <input type="hidden" name="cancel_return" value="https://tails.boum.org/donate/canceled/index.es.html" class="return-url"/> <input type="hidden" name="lc" value="ES"/> <label for="pp_5"><input type="radio" name="amount" value="5" id="pp_5" checked="checked"/>$5</label> <label for="pp_10"><input type="radio" name="amount" value="10" id="pp_10"/>$10</label> <label for="pp_25"><input type="radio" name="amount" value="25" id="pp_25"/>$25</label> <label for="pp_50"><input type="radio" name="amount" value="50" id="pp_50"/>$50</label>

source: <input type="submit" value="Donate (one-time)"/>
es: <input type="submit" value="Donar (única vez)"/>

source: <strong>Donations are tax-deductible to the full extent permitted by law.</strong>
es: <strong>Las donaciones son deductibles de impuestos dentro de los límites impuestos por la ley</strong>

source: If you need a donation receipt, contact us at <a href="mailto:tails-fundraising@boum.org">tails-fundraising@boum.org</a>.
es: Si necesitas un recibo de donación, contáctanos en <a href="mailto:tails-fundraising@boum.org">tails-fundraising@boum.org</a>.

source: Other ways to donate
es: Otras formas de donar

source: <a id="other-cryptos"></a> [[!toggle id="other-cryptos" text="Other cryptocurrencies"]] [[!toggleable id="other-cryptos" text="""
es: <a id="other-cryptos"></a> [[!toggle id="other-cryptos" text="Otras criptomonedas"]] [[!toggleable id="other-cryptos" text="""

source: Supporting more cryptocurrencies implies more work for us: learning how they works, installing the software in a secure place, monitoring their value and trading them, etc.
es: Dar soporte a más criptomonedas implica más trabajo para nosotros: aprender cómo funcionan, instalar el software en un lugar seguro, monitorear su valor e intercambiarlas, etc.

source: To make a good use of our time, we focus on the cryptocurrencies that are the easiest for us to accept and the most popular.
es: Para hacer un buen uso de nuestro tiempo, nos centramos en las criptomonedas que nos son más fáciles de aceptar y más populares.

source: Until now, cryptocurrencies other than Bitcoin, Ethereum, and Monero represent less than 1% of our donations in cryptocurrencies. We want to see other cryptocurrencies gain real popularity before spending more time on them.
es: Hasta ahora, las criptomonedas distintas de Bitcoin, Ethereum y Monero representan menos del 1% de nuestras donaciones en criptomonedas. Queremos que otras criptomonedas ganen suficiente popularidad antes de dedicar más tiempo a ellas.

source: Bank transfer
es: Transferencia bancaria

source: German bank account (preferred)
es: Cuenta de banco alemana (preferida)

source: <em>Account holder</em>: Center for Cultivation of Technology gGmbH
es: <em>Beneficiario de cuenta</em>: Center for Cultivation of Technology gGmbH

source: <em>Bank</em>: GLS Gemeinschaftsbank eG
es: <em>Banco</em>: GLS Gemeinschaftsbank eG

source: <em>Bank address</em>: Christstrasse 9, 44789, Bochum, Germany
es: <em>Dirección del banco</em>: Christstrasse 9, 44789, Bochum, Germany

source: Please make sure to mention the purpose of transfer:
es: Asegúrate de mencionar el propósito de la transferencia:

source: <em>Purpose of transfer</em>: TAILS-R43NGFR9
es: <em>Propósito de la transferencia</em>: TAILS-R43NGFR9

source: Your donation goes entirely to Tails and will be handled by the Center for the Cultivation of Technology (CCT) which is a non-profit organization in Germany.
es: Tu donación llegará en su totalidad para Tails y será gestionada por el Center for the Cultivation of Technology (CCT) que es una organización sin fines de lucro de Alemania.

source: <a href="https://techcultivation.org/donate.html">Donations are tax-deductible to the full extent permitted by law.</a>
es: <a href="https://techcultivation.org/donate.html">Las donaciones son deductibles de impuestos dentro de los límites impuestos por la ley</a>

source: Cash and US check
es: Efectivo y cheque de Estados Unidos

source: You can send us cash in any currency and US checks by post:
es: Puede enviarnos efectivo en cualquier moneda y cheques estadounidenses por correo postal:

source: Please add a note that your donation is for Tails.
es: Por favor añade una nota de que tu donación es para Tails.

source: Checks should be made payable to Riseup Labs.
es: Los cheques deben hacerse a nombre de Riseup Labs.

source: Corporate matching donation programs
es: Programas corporativos de donación de contrapartida

source: Search for <strong>Riseup Labs</strong> and donate to <strong>Tails via Riseup Labs</strong>.
es: Busca <strong>Riseup Labs</strong> y dona a <strong>Tails via Riseup Labs</strong>.

source: If you cannot specify that your donation to Riseup Labs is for Tails, please let us know so we can attribute your donation to Tails specifically. Riseup Labs is a 501(c)(3) non-profit in the USA.
es: Si no puedes especificar que tu donación a Riseup Labs es para Tails, dínoslo para que podamos atribuir tu donación a Tails específicamente. Riseup Labs es una organización 501(c)(3) sin fines de lucro en los Estados Unidos.

source: Contact
es: Contacto

source: If you have any question or problem regarding your donation, our fundraising team is here to help you:
es: Si tienes alguna pregunta o problema con respecto a tu donación, nuestro equipo de recaudación de fondos está aquí para ayudarte:

source: <a href="mailto:tails-fundraising@boum.org">tails-fundraising@boum.org</a> ([[OpenPGP key|tails-fundraising.key]])
es: <a href="mailto:tails-fundraising@boum.org">tails-fundraising@boum.org</a>. ([[llave OpenPGP|tails-fundraising.key]])

source: How we spend our money
es: Cómo gastamos el dinero

source: Releases, maintenance, and infrastructure
es: Lanzamientos, mantenimiento e infraestructura

source: Tails is an endless work of updates and maintenance: publishing a new release every 4 weeks to fix security vulnerabilities, adapting to new versions of the underlying software, keeping our website and development infrastructure secure and reliable, etc.
es: Tails es un trabajo interminable de actualizaciones y mantenimiento: publicar una nueva versión cada 4 semanas para corregir vulnerabilidades de seguridad, adaptarse a nuevas versiones del software subyacente, mantener nuestro sitio web y nuestra infraestructura de desarrollo seguros y confiables, etc.

source: New features and major improvements
es: Nuevas funciones y mejoras importantes

source: In 2019&ndash;2020, we simplified the installation procedure for Windows and macOS, added support for Secure Boot, improved the upgrade process, and made it possible to persist the settings of the Welcome Screen.
es: En 2019&ndash;2020, simplificamos el procedimiento de instalación para Windows y macOS, agregamos soporte para Secure Boot, mejoramos el proceso de actualización, e hicimos posible persistir la configuración de la Pantalla de Bienvenida.

source: User experience, documentation, and help desk
es: Experiencia de usuario, documentación y equipo de ayuda

source: Even the most secure software is worthless if the people who need it cannot use it. We work hard to understand our users, make it easy to use Tails, and help them make informed security decisions.
es: Incluso el software más seguro es inútil si las personas que lo necesitan no pueden utilizarlo. Trabajamos arduamente para comprender a nuestros usuarios, facilitar el uso de Tails y ayudarlos a tomar decisiones de seguridad informadas.

source: We make the most of the money that we receive because we prefer spending our time improving Tails for our users.
es: Aprovechamos al máximo el dinero que recibimos porque preferimos dedicar nuestro tiempo a mejorar Tails para nuestros usuarios.

source: Our impact
es: Nuestro impacto

source: Our biggest satisfaction comes from the growing popularity of Tails.
es: Nuestra mayor satisfacción proviene de la creciente popularidad de Tails.

source: From the number of automatic upgrades, we know that Tails was used by around 30&#8239;000 people every day in 2020. This number has been steadily growing by 15% each year on average since 2012.
es: Por el número de actualizaciones automáticas, sabemos que Tails fue usado por aproximadamente 30&#8239;000 personas todos los días en 2020. Este numero ha crecido sostenidamente por un 15% cada año en promedio desde 2012.

source: We keep people safe more than 10 million times every year, for a budget under $300&#8239;000.
es: Mantenemos a las personas seguras más de 10 millones de veces al año, con un presupuesto inferior a $300&#8239;000.

source: See our [[financial records|doc/about/finances]].
es: Vea nuestros [[registros contables|doc/about/finances]].

source: Daily users since 2012
es: Usuarias diarias desde 2012

source: Recommended by
es: Recomendado por

source: [[!inline pages="donate/testimonials.inline" raw="yes" sort="age"]]
es: [[!inline pages="donate/testimonials.inline.es" raw="yes" sort="age"]]

source: Where our money comes from
es: De dónde viene nuestro dinero

source: Passionate people like you
es: Gente apasionada como tú

source: Foundations & NGOs
es: Fundaciones y ONGs

source: like Mozilla or Handshake
es: como Mozilla o Handshake

source: Entities related to the US government
es: Entidades relacionadas con el gobierno de Estados Unidos

source: like the Open Technology Fund or the ISC Project
es: como el Open Technology Fund o el ISC Project

source: Private companies
es: Compañías privadas

source: like DuckDuckGo or Lush
es: como DuckDuckGo o Lush

source: Our sponsors
es: Nuestros patrocinadores

source: All donations, grants, and awards of more than $1&#8239;000 appear in our [[list of sponsors|sponsors]].
es: Todas las donaciones, subvenciones y premios de más de $1&#8239;000 aparecen en nuestra [[lista de patrocinadores|sponsors]].
