Repository: KaushalIngle/CuOS
Catalog: wiki/src/index.*.po
Languages: ru

source: is a portable operating system
ru: портативная операционная система

source: that protects against
ru: с защитой от

source: surveillance and censorship.
ru: слежки и цензуры

source: Avoid surveillance, censorship, advertising, and viruses
ru: Избавьтесь от слежки, цензуры, рекламы и вирусов

source: Tails uses the Tor network to protect your privacy online and help you avoid censorship. Enjoy the Internet like it should be.
ru: Tails использует сеть Tor для защиты вашей онлайн-приватности и помогает избежать цензуры. Пусть Интернет будет таким, какой он должен быть.

source: Your secure computer anywhere
ru: Ваш личный безопасный компьютер повсюду с вами

source: Shut down the computer and start on your Tails USB stick instead of starting on Windows, macOS, or Linux. Tails leaves no trace on the computer when shut down.
ru: Выключите компьютер. Вместо обычной Windows (macOS, Linux) загрузите с флешки Tails. После работы Tails не оставит следов на компьютере.

source: Digital security toolbox
ru: Инструменты цифровой безопасности

source: Tails includes a selection of applications to work on sensitive documents and communicate securely. Everything in Tails is ready-to-use and has safe defaults.
ru: В Tails есть программы для работы с важными документами и для безопасной связи. Все компоненты Tails готовы к использованию и безопасны по умолчанию.

source: Free Software
ru: Свободное программное обеспечение

source: You can download Tails for free and independent security researchers can verify our work. Tails is based on Debian GNU/Linux.
ru: Tails бесплатный и основан на Debian GNU/Linux. Качество нашей работы может оценить любой независимый эксперт по безопасности.

source: [[Learn how Tails works|about]]
ru: [[Как работает Tails|about]]

source: [[Get Tails [[!inline pages="inc/stable_amd64_version" raw="yes" sort="age"]]|install]]
ru: [[Скачать Tails [[!inline pages="inc/stable_amd64_version" raw="yes" sort="age"]]|install]]

source: News
ru: Новости

source: Who uses Tails
ru: Кто пользуется Tails

source: <span class="persona">Activists</span> use Tails to hide their identities, avoid censorship, and communicate securely.
ru: <span class="persona">Активисты</span> — чтобы сохранять анонимность, обходить цензуру и безопасно общаться друг с другом.

source: <span class="persona">Journalists
ru: <span class="persona">Журналисты

source: and their sources</span> use Tails to publish sensitive information and access the Internet from unsafe places.
ru: и их источники</span> — чтобы публиковать важные данные и заходить в Интернет из небезопасных мест.

source: <span class="persona">Domestic violence survivors</span> use Tails to escape surveillance at home.
ru: <span class="persona">Пострадавшие от домашнего насилия</span> — чтобы избежать слежки за собой.

source: <span class="persona">You</span> whenever you need extra privacy in this digital world.
ru: <span class="persona">Вы</span> — когда вам нужно больше приватности в цифровом мире.

source: Recommended by
ru: Кто рекомендует Tails

source: [[!inline pages="donate/testimonials.inline" raw="yes" sort="age"]]
ru: [[!inline pages="donate/testimonials.inline.ru" raw="yes" sort="age"]]

source: Sponsors
ru: Наши спонсоры

source: Our work is funded by donations from people like you and organizations that support Internet freedom. [[Meet our sponsors.|sponsors]]
ru: Мы работаем на пожертвования от людей вроде вас и организаций, которые поддерживают свободный Интернет. ([[Список спонсоров|sponsors]])
