Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/advanced_topics/persistence/change_passphrase.*.po
Languages: fr, ru

source: [[!meta title="Changing the passphrase of the Persistent Storage"]]
fr: [[!meta title="Modifier la phrase de passe du stockage persistant"]]
ru: [[!meta title="Изменение пароля Постоянного хранилища"]]

source: Start Tails and [[set up an administration password |doc/first_steps/welcome_screen/administration_password]].
fr: Démarrer Tails et [[définir un mot de passe d'administration|doc/first_steps/welcome_screen/administration_password]].
ru: Запустите Tails и [[установите пароль администратора|doc/first_steps/welcome_screen/administration_password]].

source: In the Welcome Screen, keep the Persistent Storage locked.
fr: Dans l'écran de bienvenue, maintenir le stockage persistant verrouillé.
ru: На экране приветствия оставьте Постоянное хранилище заблокированным.

source: <span class="application">Disks</span> lists all the current storage devices in the left pane of the window. When you select one of these devices, detailed information about it is displayed in the right pane: its partitions, its brand, its size, etc.
fr: <span class="application">Disques</span> liste tous les périphériques de stockage dans la partie gauche de la fenêtre. Lorsque vous choisissez l'un de ces périphériques, des informations détaillées à son propos sont affichées dans la partie droite : ses partitions, sa marque, sa taille, etc.
ru: В левой части окна приложения <span class="application">Диски</span> можно видеть список всех носителей данных. При выборе устройства в правой панели отображается подробная информация о нём: разделы, модель, объём и т.д.

source: Find which device is your Tails USB stick. It should have 2 partitions: one labeled **Tails** and another one labeled **TailsData**, which corresponds to the Persistent Storage.
fr: Trouver quel périphérique correspond à votre clé USB Tails. Il devrait contenir deux partitions, une appelée **Tails** et une autre appelée **TailsData** qui correspond au stockage persistant.
ru: Выясните, какое из этих устройств — ваша флешка Tails. На ней должно быть два раздела: один с меткой **Tails**, другой — **TailsData** (это и есть Постоянное хранилище).

source: In the right pane, click on the Persistent Storage partition, labeled <span class="guilabel">TailsData</span>.
fr: Dans la partie droite, cliquer sur la partition du stockage persistant, appelée <span class="guilabel">TailsData</span>.
ru: В правой панели щёлкните по разделу Постоянного хранилища с названием <span class="guilabel">TailsData</span>.

source: Type your current passphrase and then type twice a new one.
fr: Taper votre phrase de passe actuelle et taper ensuite deux fois la nouvelle phrase de passe.
ru: Введите текущий пароль. Затем дважды введите новый пароль.

source: Finally confirm by clicking <span class="guilabel">Change</span>.
fr: Confirmer enfin en cliquant sur <span class="guilabel">Modifier</span>.
ru: Нажмите <span class="guilabel">Изменить</span>.

source: In the confirmation dialog, enter your administration password and click <span class="guilabel">Authenticate</span>.
fr: Dans la fenêtre de confirmation, entrer votre mot de passe d'administration et cliquer sur <span class="guilabel">S'authentifier</span>.
ru: В диалоговом окне введите пароль администратора и нажмите <span class="guilabel">Подтвердить</span>.

source: You now can restart Tails and try to unlock the Persistent Storage with its new passphrase.
fr: Vous pouvez désormais redémarrer Tails et essayer de déverrouiller le stockage persistant avec sa nouvelle phrase de passe.
ru: Теперь можно перезапустить Tails. Разблокируйте Постоянное хранилище с новым паролем.
