Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/advanced_topics/persistence/check_file_system.*.po
Languages: ru

source: [[!meta title="Checking the file system of the Persistent Storage"]]
ru: [[!meta title="Проверка файловой системы Постоянного хранилища"]]

source: In rare occasions, you might have to perform a file system check to repair a broken Persistent Storage.
ru: В редких случаях для восстановления поврежденного Постоянного хранилища может понадобиться проверить файловую систему.

source: Unlock the Persistent Storage
ru: Разблокирование Постоянного хранилища

source: When starting Tails, keep the Persistent Storage locked and [[set up an administration password|doc/first_steps/welcome_screen/administration_password]].
ru: При запуске Tails оставьте Постоянное хранилище заблокированным и [[установите пароль администратора|doc/first_steps/welcome_screen/administration_password]].

source: In the left pane, click on the device corresponding to your Tails USB stick.
ru: В левой панели выберите устройство, соответствующее вашей флешке Tails.

source: In the right pane, click on the partition labeled as <span class="guilabel">TailsData LUKS</span>.
ru: В правой панели щёлкните по разделу, помеченному как <span class="guilabel">TailsData LUKS</span>.

source: In the confirmation dialog, enter your administration password and click <span class="guilabel">Authenticate</span>.
ru: В диалоговом окне введите пароль администратора и нажмите <span class="guilabel">Подтвердить</span>.

source: Click on the <span class="guilabel">TailsData Ext4</span> partition that appears below the <span class="guilabel">TailsData LUKS</span> partition.
ru: Нажмите на раздел <span class="guilabel">Tails Data Ext4</span> под разделом <span class="guilabel">Tailsdata LUKS</span>.

source: Identify the device name of your Persistent Storage. The device name appears below the list of volumes. It should look like <code>/dev/mapper/luks-xxxxxxxx</code>.
ru: Обратите внимание на имя устройства вашего Постоянного хранилища. Оно показано под списком томов и выглядит примерно так: <code>/dev/mapper/luks-xxxxxxxx</code>.

source: Triple-click to select it and press **Ctrl+C** to copy it to the clipboard.
ru: Трижды щёлкните, чтобы выделить имя устройства. Нажмите **Ctrl + C**, чтобы скопировать его в буфер обмена.

source: Check the file system using the terminal
ru: Проверка файловой системы в терминале

source: In the terminal, execute the following command, replacing `[device]` with the device name found in step 8:
ru: В терминале выполните следующую команду (замените `[устройство]` на имя устройства, которое определили выше):

source: To do so, you can type <span class="command">fsck -y&nbsp;</span> and press <span class="keycap">Shift+Ctrl+V</span> to paste the device name from the clipboard.
ru: Для этого можно ввести <span class="command">fsck -y&nbsp;</span> и нажать <span class="keycap">Shift+CTRL+V</span>, чтобы вставить имя устройства из буфера обмена.

source: If the file system is free of errors, the last line from the output of <span class="command">fsck</span> starts with <span class="command">TailsData: clean</span>.
ru: Если в файловой системе нет ошибок, последняя строка результата работы команды <span class="command">fsck</span> будет начинаться с <span class="command">Tailsdata: clean</span>.

source: If the file system has errors, <span class="command">fsck</span> tries to fix them automatically. After it finishes, you can try executing the same command again to check if all errors are solved.
ru: Если в файловой системе есть ошибки, <span class="command">fsck</span> попытается их автоматически исправить. После этого попробуйте выполнить ту же команду, чтобы проверить, все ли ошибки устранены.
