Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/first_steps/welcome_screen/administration_password.*.po
Languages: ru

source: [[!meta title="Administration password"]]
ru: [[!meta title="Пароль администратора"]]

source: In Tails, an administration password (also called *root password* or *amnesia password*) is required to perform system administration tasks. For example:
ru: Пароль администратора в Tails также называют *root password* или *amnesia password*. Он нужен для выполнения административных задач, например:

source: To [[install additional software|doc/first_steps/additional_software]]
ru: [[установка дополнительных программ|doc/first_steps/additional_software]];

source: To [[access the internal hard disks of the computer|doc/advanced_topics/internal_hard_disk]]
ru: [[доступ к внутренним жёстким дискам компьютера|doc/advanced_topics/internal_hard_disk]];

source: To execute commands with <span class="command">sudo</span>
ru: выполнение команд с префиксом <span class="command">sudo</span>.

source: Security implications of setting up an administration password
ru: Особенности установки пароля администратора, связанные с безопасностью

source: For better security, no administration password is set up by default.
ru: Для безопасности по умолчанию в Tails пароль администратора не установлен.

source: When you set up an administration password, an attacker who learns your administration password could be able to break all the security measures built in Tails:
ru: Если вы установите пароль администратора и этот пароль станет известен злоумышленнику, тот сможет преодолеть защитные меры Tails и сделать следующее:

source: - Monitor all your activity - Reveal your IP address - Access all the data in your Persistent Storage - Write data to the internal hard disk of the computer - Install such vulnerabilities permanently on your Tails USB stick
ru: - наблюдение за вашими действиями - раскрытие вашего IP-адреса - доступ к данным в Постоянном хранилище - запись информации на внутренний жёсткий диск компьютера - создание уязвимостей на вашей флешке Tails.

source: To learn your administration password, an attacker could:
ru: Как злоумышленнику добраться до вашего пароля администратора?

source: Watch your keyboard while you type your administration password, for example through a video surveillance camera, and then accessing physically your computer before you shut down Tails.
ru: Он может увидеть, какие кнопки вы нажимаете на клавиатуре, чтобы набрать пароль. Например, с помощью камеры наблюдения. Потом злоумышленник может физически добраться до вашего компьютера, пока вы не завершили работу с Tails.

source: To prevent such an attack:
ru: Чтобы предотвратить такую атаку:

source: Hide your keyboard while typing your administration password in public spaces.
ru: старайтесь не демонстрировать свою клавиатуру, когда набираете пароль администратора в публичном месте;

source: Never leave your computer unattended while running Tails.
ru: никогда не оставляйте компьютер с работающим Tails без присмотра;

source: Learn how to [[quickly shut down Tails|doc/first_steps/shutdown]].
ru: научитесь [[быстро завершать работу с Tails|doc/first_steps/shutdown]].

source: Exploit a security vulnerability in an application in Tails before you type your administration password.
ru: Злоумышленник может воспользоваться уязвимостью в программе из комплекта Tails ещё до того, как вы введёте пароль администратора.

source: For example, an attacker could exploit a security vulnerability in *Thunderbird* by sending you a [phishing email](https://ssd.eff.org/en/module/how-avoid-phishing-attacks) that could wait until you type your administration password and reveal it.
ru: Например, злоумышленник может воспользоваться уязвимостью в *Thunderbird*. Он отправит [фишинговое письмо](https://ssd.eff.org/ru/module/%D1%80%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%BE-%D0%BF%D0%BE-%D0%B7%D0%B0%D1%89%D0%B8%D1%82%D0%B5-%D0%BE%D1%82-%D1%84%D0%B8%D1%88%D0%B8%D0%BD%D0%B3%D0%BE%D0%B2%D1%8B%D1%85-%D0%B0%D1%82%D0%B0%D0%BA) и будет дожидаться, когда вы введёте пароль администратора, чтобы перехватить его.

source: Such an attack is very unlikely but could be performed by a strong attacker, such as a government or a hacking firm.
ru: Такая атака маловероятна, но может быть проведена сильным злоумышленником, например правительством или хакерской группой.

source: Only set up an administration password when you need it.
ru: устанавливайте пароль администратора только по необходимости;

source: Always update to the latest version of Tails to fix known vulnerabilities as soon as possible.
ru: обновляйте Tails до самой свежей версии, в которой устранены известные уязвимости.

source: We have plans to fix the root cause of this problem but it requires [[!tails_ticket 12213 desc="important engineering work"]].
ru: У нас есть планы по устранению основной причины этой проблемы, но для этого требуется [[!tails_ticket 12213 desc="серьёзная инженерная работа"]].

source: Set up an administration password
ru: Установка пароля администратора

source: In order to perform administration tasks, you need to set up an administration password when starting Tails, using the [[Welcome Screen|welcome_screen]].
ru: Для выполнения административных задач вам нужно установить пароль администратора. Это можно сделать при запуске Tails на [[экране приветствия|welcome_screen]].

source: When the Welcome Screen appears, click on the **[[!img lib/list-add.png alt="Add Additional Setting" class="symbolic" link="no"]]** button.
ru: На экране приветствия нажмите кнопку **[[!img lib/list-add.png alt="Дополнительные настройки" class="symbolic" link="no"]]**.

source: Choose **Administration Password** in the **Additional Settings** dialog.
ru: В окне **Additional Settings** (дополнительные настройки) выберите **Administration Password** (пароль администратора).

source: Specify a password of your choice in both the <span class="guilabel">Administration Password</span> and <span class="guilabel">Confirm</span> text boxes then click <span class="bold">Add</span>.
ru: Введите выбранный вами пароль в поля <span class="guilabel">Administration Password</span> и <span class="guilabel">Confirm</span>. Нажмите <span class="bold">Add</span>.

source: <p>For security, it is impossible to set up an administration password after starting Tails. Otherwise, a compromised application could bypass some of the security built in Tails.</p>
ru: <p>По соображениям безопасности нельзя установить административный пароль после запуска Tails. В противном случае вредоносное приложение могло бы обойти некоторые меры безопасности Tails.</p>

source: How to open a root terminal
ru: Открытие терминала с правами суперпользователя

source: To open a root terminal during your working session, you can do any of the following:
ru: Открыть терминал с правами суперпользователя можно двумя способами:

source: Execute <span class="command">sudo -i</span> in a terminal.
ru: Выполнить в терминале команду <span class="command">sudo -i</span>.
