Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet/networkmanager.*.po
Languages: es, fr

source: [[!meta title="Connecting to a local network"]]
es: [[!meta title="Conectar a una red local"]]
fr: [[!meta title="Se connecter à un réseau local"]]

source: Connecting to a local network
es: Conectar a una red local
fr: Se connecter à un réseau local

source: You can connect to a local network using a wired, Wi-Fi, or mobile data connection:
es: Puedes conectar a una red local usando una conexión por cable, Wi-Fi o datos móviles:
fr: Vous pouvez vous connecter à un réseau local via une connexion filaire, Wi-Fi, ou de données mobiles :

source: Open the system menu in the top-right corner.
es: Abre el menú del sistema en la esquina superior derecha.
fr: Ouvrez le menu système dans le coin en haut à droite.

source: If a wired connection is detected, Tails automatically connects to the network.
es: Si se detecta una conexión por cable, Tails se conecta automáticamente a la red.
fr: Si une connexion filaire est détectée, Tails s'y connecte automatiquement.

source: To connect to a Wi-Fi network, choose <span class="guilabel">Wi-Fi Not Connected</span> and then <span class="guilabel">Select Network</span>.
es: Para conectarse a una red Wi-Fi, escoge <span class="guilabel">Wi-Fi No Conectada</span> y luego <span class="guilabel">Seleccionar Red</span>.
fr: Pour se connecter à un réseau Wi-Fi, choisissez <span class="guilabel">Wi-Fi non connecté</span> puis <span class="guilabel">Sélectionner un réseau</span>.

source: <p>If there is no option to connect to a Wi-Fi network, your Wi-Fi interface is not working in Tails. See our documentation on [[troubleshooting Wi-Fi not working|no-wifi]].</p>
fr: <p>S'il n'y a pas d'option pour se connecter à un réseau Wi-Fi, votre interface Wi-Fi ne fonctionne pas dans Tails. Consultez notre documentation sur : [[résoudre les problèmes de Wi-FI qui ne fonctionne pas|no-wifi]].</p>

source: To connect to a mobile data network, choose <span class="guilabel">Mobile Broadband</span>.
es: Para conectarte a una red móvil, escoge <span class="guilabel">Mobile Broadband</span>.
fr: Pour se connecter à un réseau de données mobile, choisissez <span class="guilabel">réseau mobile à large bande</span>.

source: <div class="note"> <p>It is currently impossible to connect to a network using:</p>
es: <div class="note"> <p>Por el momento es imposible conectarse a una red usando:</p>
fr: <div class="note"> <p>Il est actuellement impossible de se connecter au réseau avec :</p>

source: <ul> <li>Dial-up modems.</li> <li>VPNs, see [[the corresponding FAQ|support/faq#vpn]].</li> </ul>
es: <ul> <li>Modems de teléfono.</li> <li>VPNs, ver [[la Pregunta Frecuente correspondiente|support/faq#vpn]].</li> </ul>
fr: <ul> <li>Un modem téléphonique.</li> <li>Un VPN, voir [[la FAQ correspondante|support/faq#vpn]].</li> </ul>

source: After you connect to a local network, the *Tor Connection* assistant appears to help you [[connect to the Tor network|tor]].
es: Después de conectarte a una red local, aparece el asistente *Tor Connection* para ayudarte a [[conectarte a la red Tor|tor]].
fr: Après vous être connecté à un réseau local, l'assistant de *Connexion à Tor* apparaît pour vous aider à vous [[connecter au réseau Tor|tor]].

source: For more information, open <span class="application">[[GNOME Help|first_steps/desktop#help]]</span> and choose <span class="guilabel">Networking, web & email</span>.
es: Para más información abre la <span class="application">[[ayuda de GNOME|first_steps/desktop#help]]</span> y elige <span class="guilabel">Red, web y correo electrónico</span>.
fr: Pour plus d'information, ouvrez <span class="application">[[l'aide de GNOME|first_steps/desktop#help]]</span> et choisissez <span class="guilabel">Networking, web & email</span>.

source: Saving your network settings
es: Guardar tus configuraciones de red
fr: Enregistrer vos paramètres réseau

source: To remember the password for Wi-Fi networks and custom network configurations across different Tails sessions, turn on the [[Network Connections|first_steps/persistence#network_connections]] feature of the Persistent Storage.
fr: Pour mémoriser le mot de passe des réseaux Wi-Fi et des configurations réseau personnalisées entre différentes sessions Tails, activez la fonction [[Connexions réseau|first_steps/persistence#network_connections]] du stockage persistant.

source: Modifying your network settings
es: Modificar tus configuraciones de red
fr: Modifier vos paramètres réseau
