Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet/onionshare.*.po
Languages: ru

source: [[!meta title="Sharing files with OnionShare"]]
ru: [[!meta title="Обмен файлами с помощью OnionShare"]]

source: [OnionShare](https://onionshare.org/) is a tool to share files of any size securely and anonymously.
ru: [OnionShare](https://onionshare.org/) — безопасное и анонимное средство обмена файлами (расшаривания файлов).

source: <span class="application">OnionShare</span> creates an onion address that someone else can visit in <span class="application">Tor Browser</span> to access the files that you want to share.
ru: <span class="application">OnionShare</span>создает новый адрес в сети onion. Можно зайти туда с помощью <span class="application">Tor Browser</span> и получить доступ файлам, которые расшарил для вас друг.

source: To share files with <span class="application">OnionShare</span>:
ru: Далее описано, как расшарить файлы с помощью <span class="application">OnionShare</span>.

source: Open the <span class="application">Files</span> browser.
ru: Откройте файловый менеджер <span class="application">Файлы</span>.

source: Right-click (on Mac, click with two fingers) on the files or folders that you want to share and choose <span class="guilabel">Share via OnionShare</span>. <span class="application">OnionShare</span> starts.
ru: Правой кнопкой мыши (на компьютере Mac щёлкните двумя пальцами) выберите файлы или папки, которыми хотите поделиться. Выберите в меню <span class="guilabel">OnionShare это</span>. Запустится <span class="application">OnionShare</span>.

source: To share more files or folders, you can either:
ru: Чтобы поделиться другими файлами или папками, вы можете также:

source: Drag and drop them from the <span class="application">Files</span> browser onto <span class="application">OnionShare</span>.
ru: перетащить их из <span class="application">файлового менеджера Файлы</span> в <span class="application">OnionShare</span>;

source: Click the <span class="guilabel">Add</span> button in <span class="application">OnionShare</span>.
ru: нажать в <span class="application">OnionShare</span> кнопку <span class="guilabel">Добавить</span>.

source: Click <span class="guilabel">Start Sharing</span>.
ru: Нажмите <span class="guilabel">Начать отправку</span>.

source: <div class="bug"> <p>Starting to share the files can take up to several minutes.</p> </div>
ru: <div class="bug"> <p>Это может занять несколько минут.</p> </div>

source: When the files are available for sharing, an onion address appears at the bottom of <span class="application">OnionShare</span>.
ru: Когда всё будет готово, в нижней части <span class="application">OnionShare</span> появится onion-адрес.

source: Send this onion address to someone else, for example, by email.
ru: Отправьте этот onion-адрес (например, по email) тому, с кем хотите поделиться файлом.

source: The other person can download the files by visiting the onion address in <span class="application">Tor Browser</span>.
ru: Он сможет зайти на onion-адрес с помощью <span class="application">Tor Browser</span> и скачать файл(ы).

source: <span class="application">OnionShare</span> informs you when the files are being accessed.
ru: <span class="application">OnionShare</span> сообщает, когда кто-то получает доступ к файлам.

source: The files are not shared anymore as soon as you close <span class="application">OnionShare</span> or shut down Tails.
ru: Когда вы закроете <span class="application">OnionShare</span> или завершите работу Tails, расшаривание файлов прекратится.

source: <p>To learn more about how to use <i>OnionShare</i>, see the <a href="https://docs.onionshare.org/"><i>OnionShare</i> documentation.</p>
ru: <p>Подробнее см. <a href="https://docs.onionshare.org/"><i>документацию по OnionShare</i>.</p>
