Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet/pidgin.*.po
Languages: fr, it

source: [[!meta title="Chatting with Pidgin and OTR"]]
fr: [[!meta title="Discuter avec Pidgin et OTR"]]

source: For chatting and instant messaging, Tails includes the <span class="application">[Pidgin Instant Messenger](https://pidgin.im/)</span>.
fr: Pour dialoguer et envoyer des messages instantanés, Tails fournit la <span class="application">[Messagerie Instantanée Pidgin](https://pidgin.im/)</span>.
it: Per le chat e la messaggistica istantanea, Tails include <span class="application">[Pidgin Instant Messenger](https://pidgin.im/)</span>.

source: <p><a href="https://dino.im/"><i>Dino</i></a> is being considered as an option to replace <i>Pidgin</i> in Tails.</p>
fr: <p><a href="https://dino.im/"><i>Dino</i></a> est envisagé comme candidat au remplacement de <i>Pidgin</i> dans Tails.</p>

source: <p>You can already try using <i>Dino</i> in Tails. See our documentation on [[chatting with <i>Dino</i> and OMEMO|doc/advanced_topics/dino]].</p>
fr: <p>Vous pouvez déjà essayerd'utiliser <i>Dino</i> dans Tails. Voir notre documentation sur comment [[discuter avec <i>Dino</i> et OMEMO|doc/advanced_topics/dino]].</p>

source: You can use it to connect to [[!wikipedia Internet_Relay_Chat]] or [[!wikipedia XMPP]] (also known as Jabber) servers, and have several accounts connected at the same time.
fr: Vous pouvez l'utiliser pour vous connecter à des serveurs [[!wikipedia_fr Internet_Relay_Chat desc="IRC"]] ou [[!wikipedia_fr Extensible_Messaging_and_Presence_Protocol desc="XMPP"]] (aussi connus sous le nom de Jabber), et utiliser simultanément plusieurs comptes différents.
it: Potete usarla per collegarvi ad [[!wikipedia Internet_Relay_Chat]] o ai servers [[!wikipedia XMPP]] (conosciuto anche come Jabber) ed avere molti accounts connessi allo stesso tempo.

source: For more detailed documentation refer to the [official <span class="application">Pidgin</span> user guide](https://developer.pidgin.im/wiki/Using%20Pidgin).
fr: Pour de la documentation plus détaillée, référez-vous au [manuel officiel de <span class="application">Pidgin</span>](https://developer.pidgin.im/wiki/Using%20Pidgin) (en anglais).
it: Per una documentazione più dettagliata fai riferimento al [manuale d'uso ufficiale di <span class="application">Pidgin</span>](https://developer.pidgin.im/wiki/Using%20Pidgin) (in inglese).

source: <span class="application">Off-the-record</span> (<span class="application">OTR</span>) encryption
fr: Chiffrement <span class="application">Off-the-record</span> (<span class="application">OTR</span>)
it: <span class="application">Off-the-record</span> (crittografia <span class="application">OTR</span>

source: As explained on its [official page](https://otr.cypherpunks.ca/), <span class="application">Off-the-Record</span> messaging allows you to have private conversations over instant messaging by providing:
fr: Comme expliqué sur sa [page officielle](https://otr.cypherpunks.ca/), la messagerie <span class="application">Off-the-Record</span> vous permet d'avoir des conversations privées via messagerie instantanée en fournissant :
it: Come spiegato sulla relativa [pagina ufficiale](https://otr.cypherpunks.ca/), la messaggistica <span class="application">Off-the-Record</span> ti permette di avere conversazioni private via messaggistica istantanea fornendo:

source: - **Encryption**<br /> No one else can read your instant messages. - **Authentication**<br /> You are assured the correspondent is who you think it is. - **Deniability**<br /> The messages you send do not have digital signatures that are checkable by a third party. Anyone can forge messages after a conversation to make them look like they came from you. However, during a conversation, your correspondent is assured the messages are authentic and unmodified. - **Perfect forward secrecy**<br /> If you lose control of your private keys, no previous conversation is compromised.
fr: - **Chiffrement**<br /> Personne d'autre ne peut lire vos messages. - **Authentification**<br /> Vous avez la garantie que votre correspondant est la personne que vous croyez. - **Déni possible**<br /> Les messages que vous envoyez n'ont pas de signature numérique vérifiable par une tierce personne. N'importe qui peut falsifier des messages après la conversation pour faire comme s'ils venaient de vous. Cependant, pendant une conversation, votre correspondant est assuré que les messages sont authentiques et intacts. - **Confidentialité persistante**<br /> Si vous perdez le contrôle de vos clés privées, aucune conversation précédente ne sera compromise.
it: - **Cifratura**<br /> Nessun'altra persona può leggere i tuoi messaggi istantanei. - **Autenticazione**<br /> Hai la garanzia che la controparte sia la persona che tu pensi. - **Ripudiabilità**<br /> I messaggi che invii non hanno firme digitali verificabili da una terza parte. Chiunque può fabbricare messaggi dopo una conversazione facendo sembrare che siano stati inviati da te. Tuttavia, durante una conversazione, la tua controparte ha la garanzia che i messaggi siano autentici e intatti. - **Segretezza perfetta in avanti**<br /> Se perdi il controllo delle tue chiavi private, nessuna conversazione precedente è compromessa.

source: <p><strong>OTR is deactivated by default</strong>, and your conversations are not private.</p>
fr: <p><strong>OTR est désactivé par défaut</strong>, et vos conversations ne sont pas privées.</p>
it: <p><strong>OTR è disattivato per impostazione predefinita</strong>, e le tue conversazioni non sono private.</p>

source: <p><strong>File transfers are not encrypted by OTR.</strong> OTR only encrypts conversations.</p>
fr: <p><strong>Les fichiers transférés ne sont pas chiffrés par OTR.</strong> OTR chiffre seulement les conversations.</p>
it: <p><strong>I file trasferiti non vengono cifrati da OTR.</strong> OTR cifra solo le conversazioni.</p>

source: To store your OTR keys and preferences across separate working sessions, you can turn on the [[Pidgin|doc/first_steps/persistence#pidgin]] feature of the Persistent Storage.
fr: Pour conserver vos clés OTR et vos préférences à travers plusieurs sessions de travail, vous pouvez activer l'option [[Pidgin|doc/first_steps/persistence#pidgin]] du stockage persistant.
it: Per salvare le vostre chiavi OTR e le vostre preferenze in diverse sessioni di lavoro puoi attivare [[Pidgin|doc/first_steps/persistence#pidgin]] con l'opzione attivo nell'Archivio Persistente.

source: In a private OTR conversation over IRC, <strong>a message sent using the <code>/me</code> command is not encrypted</strong>. The person receiving the message is notified by a warning.
fr: Lors d'une conversation privée OTR via IRC, <strong>un message envoyé en utilisant la commande <code>/me</code> n'est pas chiffré</strong>. La personne le recevant en est informée par un avertissement.
it: In una conversazione privata OTR via IRC, <strong>un messaggio inviato usando il comando <code>/me</code> non viene cifrato</strong>. La persona che riceve il messaggio ne viene informata da un avviso.

source: IRC servers blocking Tor
fr: Serveurs IRC bloquant Tor
it: Server IRC che bloccano Tor

source: Some IRC servers block connections from Tor because Tor is sometimes used to send spam.
fr: Certains serveurs IRC bloquent les connexions en provenance de Tor car Tor est parfois utilisé pour envoyer du spam.
it: Certi server IRC bloccano le connessioni in arrivo da Tor perché Tor a volte viene usato per inviare spam.

source: Adding support for another protocol
fr: Ajouter la prise en charge d'un autre protocole
it: Aggiungere supporto per un altro protocollo

source: For security reasons, it is only possible to use IRC and XMPP with <span class="application">Pidgin</span> in Tails. Here are the prerequisites to enable another protocol that is supported by <span class="application">Pidgin</span> otherwise:
fr: Pour des raisons de sécurité, il est uniquement possible d'utiliser <span class="application">Pidgin</span> avec les protocoles IRC et XMPP dans Tails. Voici les prérequis pour activer d'autres protocoles pris en charge par <span class="application">Pidgin</span> par ailleurs :
it: Per motivi di sicurezza, in Tails è possibile usare <span class="application">Pidgin</span> solo con i protocolli IRC e XMPP. Ecco i prerequisiti per attivare un altro protocollo altrimenti supportato da <span class="application">Pidgin</span>:

source: The support in <span class="application">Pidgin</span> for this protocol has been successfully tested in Tails.
fr: La prise en charge dans <span class="application">Pidgin</span> de ce protocole doit avoir été testée avec succès dans Tails.
it: Il supporto in <span class="application">Pidgin</span> di questo protocollo deve essere stato collaudato con successo in Tails.

source: Someone volunteers to maintain the corresponding support in Tails on the long term.
fr: Une personne doit se porter volontaire pour maintenir sur le long terme sa prise en charge dans Tails.
it: Una persona deve offrirsi di mantenere nel lungo termine il corrispondente supporto in Tails.

source: Someone has verified that the security record of the desired plugin (including open bugs) is good enough.
fr: Une personne doit vérifier que l'historique de sécurité du plugin désiré (incluant les bugs en cours) est suffisamment bon.
it: Una persona deve aver verificato che la cronistoria della sicurezza del plugin desiderato (inclusi i bug in corso) sia sufficientemente buona.

source: If you want to work on this issue, see [[our contribute page|contribute/how/code]].
fr: Si vous voulez travaillez sur ce problème, voir [[notre page participer|contribute/how/code]].
it: Se vuoi lavorare su questo problema, vedi la [[nostra pagina per contribuire|contribute/how/code]] (in inglese).
