Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet/thunderbird.*.po
Languages: ru

source: [[!meta title="Emailing and reading news with Thunderbird"]]
ru: [[!meta title="Thunderbird: работа с email и новостями"]]

source: Tails includes <span class="application">Thunderbird</span> for:
ru: Tails включает программу <span class="application">Thunderbird</span>. У неё две задачи:

source: - Reading and writing emails - Reading [[!wikipedia RSS]] and [[!wikipedia Atom_(Web_standard) desc="Atom"]] feeds for news and blogs
ru: - Чтение и отправка email; - Чтение новостных лент [RSS](https://ru.wikipedia.org/wiki/RSS) и [Atom(https://ru.wikipedia.org/wiki/Atom).

source: <p>To store your emails, feeds, and settings across different working sessions, turn on the [[Thunderbird|doc/first_steps/persistence#thunderbird]] feature of the Persistent Storage.</p>
ru: <p>Для сохранения ваших писем, каналов и настроек между разными рабочими сессиями включите в Постоянном хранилище опцию [[Thunderbird|doc/first_steps/persistence#thunderbird]].</p>

source: For more detailed documentation, refer to the [official <span class="application">Thunderbird</span> help](https://support.mozilla.org/en-US/products/thunderbird).
ru: Подробнее см. [страницу официальной поддержки <span class="application">Thunderbird</span>](https://support.mozilla.org/ru/products/thunderbird).

source: <h1 id="account">Configuring an email account</h1>
ru: <h1 id="account">Настройка почтового аккаунта</h1>

source: When starting <span class="application">Thunderbird</span> for the first time, an assistant appears to guide you through the process of configuring <span class="application">Thunderbird</span> to access your email account.
ru: При первом запуске <span class="application">Thunderbird</span> появляется мастер настройки программы для использования вашей учётной записи email.

source: Enter your name, email address, and password into the corresponding fields.
ru: Введите ваши имя, адрес электронной почты и пароль в соответствующие поля.

source: Click <span class="guilabel">Continue</span>.
ru: Нажмите <span class="guilabel">Продолжить</span>.

source: The assistant tries to configure automatically the correct settings to connect to your email provider based on your email address.
ru: Thunderbird попытается автоматически настроить подключение к вашему почтовому провайдеру на основе вашего адреса email.

source: If the automatic configuration fails, consult your email provider about how to configure your email account manually.
ru: Если автоматическая настройка не получится, обратитесь к вашему почтовому провайдеру и узнайте, как настроить учётную запись email вручную.

source: <h2>Configuring a Gmail account</h2>
ru: <h2>Настройка учётной записи Gmail</h2>

source: <p>If you are using Gmail, you need to first configure your account to allow access from other email clients, such as <span class="application">Thunderbird</span>.</p>
ru: <p>Если вы используете Gmail, придётся сначала настроить учётную запись Gmail: разрешить доступ из почтовых клиентов вроде <span class="application">Thunderbird</span>.</p>

source: <p>To configure your Gmail account to allow access from <span class="application">Thunderbird</span>, you need to:</p>
ru: <p>Чтобы разрешить <span class="application">Thunderbird</span> доступ к учётной записи Gmail:</p>

source: <ol> <li>Enable IMAP or POP. See <a href="https://support.google.com/mail/answer/7126229">Gmail Help: Check Gmail through other email platforms</a>.</li> <li>Turn on 2-Step Verification. See <a href="https://support.google.com/accounts/answer/185839">Google Account Help: 2-Step Verification</a>.</li> <li>Create an App Password. See <a href="https://support.google.com/mail/answer/185833">Gmail Help: Sign in with App Passwords</a>.</li> <li>Use the App Password in <em>Thunderbird</em>.</li> </ol>
ru: <ol> <li>Включите IMAP или POP. См. <a href="https://support.google.com/mail/answer/7126229 ">Справка — Gmail: Как настроить доступ к Gmail в сторонних почтовых клиентах</a>.</li> <li>Включите двухэтапную аутентификацию. См. <a href="https://support.google.com/accounts/answer/185839 ">Справка — Аккаунт Google: Как защитить свой аккаунт с помощью двухэтапной аутентификации</a>.</li> <li>Создайте пароль приложения. См. <a href="https://support.google.com/mail/answer/185833 ">Справка — Gmail: Как войти в аккаунт с помощью паролей приложений</a>.</li> <li>Используйте пароль приложения в <em>Thunderbird</em>.</li> </ol>

source: If the automatic configuration succeeds, you might have to specify which protocol to use to connect to your email provider, either <span class="guilabel">IMAP</span> or <span class="guilabel">POP</span>.
ru: Если автоматическая настройка пройдет успешно, вам, возможно, придётся указать, какой протокол использовать для подключения к вашему почтовому провайдеру: <span class="guilabel">IMAP</span> или <span class="guilabel">POP</span>.

source: - With <span class="guilabel">IMAP</span>, <span class="application">Thunderbird</span> constantly synchronizes with the server and displays the emails and folders that are currently stored on the server. IMAP is better suited if you access your emails from different operating systems.
ru: - <span class="guilabel">IMAP:</span> <span class="application">Thunderbird</span> периодически синхронизируется с сервером и отображает письма и папки, которые в настоящее время хранятся на сервере. IMAP больше подходит, если вы пользуетесь email из разных операционных систем.

source: - With <span class="guilabel">POP</span>, <span class="application">Thunderbird</span> downloads the emails that are in the inbox on the server and possibly deletes them from the server. POP is better suited if you access your emails from Tails only and store them in the Persistent Storage.
ru: - С помощью <span class="guilabel">POP:</span> <span class="application">Thunderbird</span> скачивает письма из папки «Входящие» (с сервера на ваш компьютер), и, по вашему выбору, удаляет их с сервера. POP больше подходит, если вы пользуетесь email только из Tails и храните письма в Постоянном хранилище.

source: To know more, see also this [comparison between POP and IMAP](https://help.riseup.net/en/email/clients/#choose-imap-or-pop) by Riseup.
ru: Подробнее см. [сравнение POP и IMAP](https://help.riseup.net/en/email/clients/#choose-imap-or-pop ), подготовленное Riseup.

source: <h1 id="privacy">Enhanced privacy</h1>
ru: <h1 id="privacy">Больше приватности</h1>

source: <span class="application">Thunderbird</span> in Tails is configured for additional privacy and anonymity.
ru: <span class="application">Thunderbird</span> в Tails настроен для обеспечения лучшей приватности и анонимности.

source: For example, <span class="application">Thunderbird</span> in Tails:
ru: В частности, <span class="application">Thunderbird</span>:

source: Removes information about the language of your session or spellchecker from the headers of the emails that you send.
ru: удаляет информацию о языке вашей сессии или языке средства проверки орфографии из заголовков отправляемых вами писем;

source: Removes information that could identify you as a Tails user from the headers of your emails.
ru: удаляет из заголовков писем данные, которые могут идентифицировать вас как пользователя Tails;

source: Only allows secure protocols and disables insecure protocols, like SSLv3.
ru: разрешает только безопасные протоколы и отключает небезопасные протоколы, такие как SSLv3;

source: Disables tracking technologies, like cookies and JavaScript, when viewing emails or feeds in HTML.
ru: отключает технологии отслеживания, такие как файлы cookie и JavaScript, при просмотре писем или новостных лент в формате HTML.

source: <p>Emails and feeds in HTML format are displayed in plain text by default and can become harder to read.</p>
ru: <p> Электронные письма и новостные ленты в HTML-формате по умолчанию отображаются в виде обычного текста. Их может оказаться труднее читать.< / p>

source: <h1 id="language">Using Thunderbird in your language</h1>
ru: <h1 id="language">Thunderbird на вашем языке</h1>

source: To use <span class="application">Thunderbird</span> in your language, you can install the <span class="command">thunderbird-l10n-<span class="command-placeholder">lang</span></span> package using the [[Additional Software|doc/first_steps/additional_software]] feature. Replace <span class="command-placeholder">lang</span> with the code for your language. For example, <span class="command">es</span> for Spanish or <span class="command">de</span> for German.
ru: Чтобы использовать <span class="application">Thunderbird</span> на вашем языке, можно установить пакет <span class="command">thunderbird-l10n-<span class="command-placeholder">lang</span></span> пакет с помощью функции [[дополнительных программ|doc/first_steps/additional_software<span class="command-placeholder">]]. Замените <span class="command-placeholder">lang</span> кодом для вашего языка. Например, <span class="command">ru</span> для русского языка или <span class="command">ua</span> для украинского языка.

source: <h1 id="openpgp">OpenPGP encryption</h1>
ru: <h1 id="openpgp">Шифрование OpenPGP</h1>

source: <p>Since Tails 4.13 (November 2020), <em>Thunderbird</em> 78 replaces the <em>Enigmail</em> extension with built-in support for OpenPGP encryption. If you used <em>Enigmail</em> before Tails 4.13, follow our [[migration instructions|openpgp_migration]].</p>
ru: <p>Начиная с версии 4.13 (ноябрь 2020 года), вместо расширения <em>Enigmail</em> в <em>Thunderbird</em> используется встроенный функционал шифрования OpenPGP. Если до Tails 4.13 вы использовали <em>Enigmail</em>, следуйте нашему [[руководству по миграции|openpgp_migration]].</p>

source: See also the official [OpenPGP in Thunderbird - HOWTO and FAQ](https://support.mozilla.org/kb/openpgp-thunderbird-howto-and-faq).
ru: См. также официальное руководство по [OpenPGP в Thunderbird](https://support.mozilla.org/ru/kb/openpgp-v-thunderbird-instrukcii-po-ispolzovaniyu-).

source: <h2 id="master-password">Setting up a Master Password (recommended)</h2>
ru: <h2 id="master-password">Установка мастер-пароля (рекомендуется)</h2>

source: In *Thunderbird*, OpenPGP private keys are not protected by a passphrase. That's why we recommend that you set up a Master Password.
ru: В *Thunderbird* секретные (закрытые) ключи OpenPGP не защищены паролем. Вот почему мы рекомендуем установить мастер-пароль.

source: With a Master Password, your private key is encrypted in your *Thunderbird* profile and is only unlocked while *Thunderbird* is running. If your *Thunderbird* profile is stored in your Persistent Storage, then your private key is encrypted twice: once by *Thunderbird* in your profile and a second time by the encryption of the Persistent Storage.
ru: С помощью мастер-пароля ваш секретный ключ зашифрован в профиле *Thunderbird* и разблокируется только на время работы *Thunderbird*. Если профиль *Thunderbird* хранится в вашем Постоянном хранилище, секретный ключ шифруется дважды: один раз с помощью *Thunderbird* в профиле, второй раз с помощью шифрования Постоянного хранилища.

source: Choose **Privacy & Security**.
ru: Выберите **Приватность и защита**.

source: In the **Passwords** section, select the option **Use a master password**.
ru: В разделе **Пароли** выберите опцию **Использовать мастер-пароль**.

source: In the **Change Master Password** dialog, enter your Master Password and click **Ok**.
ru: В диалоговом окне **Смена мастер-пароля** введите свой мастер-пароль и нажмите **ОК**.

source: <h2 id="import-private">Importing an existing private key</h2>
ru: <h2 id="import-private">Импорт существующего секретного ключа</h2>

source: *Thunderbird* uses a different keyring than *GnuPG*.
ru: *Thunderbird* и *GnuPG* используют разные связки ключей.

source: If you already have an OpenPGP private key outside of *Thunderbird*, follow the instructions below to export it from *GnuPG* and import it into *Thunderbird*.
ru: Если у вас уже есть секретный (закрытый) ключ OpenPGP за пределами *Thunderbird*, следуйте приведенным ниже инструкциям, чтобы экспортировать его из *GnuPG* и импортировать в *Thunderbird*.

source: <h3>Export your private key using the <em>Passwords and Keys</em> utility</h3>
ru: <h3>Экспорт секретного ключа с помощью утилиты <em>Пароли и ключи</em></h3>

source: From the desktop:
ru: В Tails:

source: In the left pane, choose **GnuPG keys**.
ru: В левой панели выберите **Ключи GnuPG**.

source: In the right pane, double-click on the private key that you want to export and use in *Thunderbird*.
ru: В правой панели дважды щёлкните по секретному ключу, который хотите экспортировать и использовать в *Thunderbird*.

source: In the **Details** tab of the properties dialog, click **Export**.
ru: Во вкладке **Подробности** нажмите **Экспортировать**.

source: Save your private key in your *Home* directory.
ru: Сохраните секретный ключ в своей *Домашней папке*.

source: Close the *Passwords and Keys* utility.
ru: Закройте утилиту *Пароли и ключи*.

source: <h3>Import your private key in <em>Thunderbird</em></h3>
ru: <h3>Импорт вашего секретного ключа в <em>Thunderbird</em></h3>

source: In *Thunderbird*:
ru: В *Thunderbird*:

source: In the left pane, identify the account that corresponds to the private key that you want to import and choose **End-to-End Encryption**.
ru: В левой панели определите учётную запись, соответствующую секретному ключу, который хотите импортировать. Выберите **Сквозное шифрование**.

source: In the **Add a Personal OpenPGP Key** dialog, choose **Import an existing OpenPGP Key** and click **Continue**.
ru: В диалоговом окне **Добавить персональный ключ OpenPGP** выберите **Импортировать существующий ключ OpenPGP** и нажмите **Продолжить**.

source: In the next dialog, make sure that your private key is listed and that the option **Treat this key as a Personal Key** is selected.
ru: В следующем диалоговом окне убедитесь, что видите именно ваш секретный ключ, и что выбрана опция **Рассматривать этот ключ в качестве Личного ключа**.

source: Click **Continue**, enter the passphrase for your private key (if any), and click **Continue** again.
ru: Нажмите **Продолжить**, введите пароль для вашего секретного ключа (если пароль имеется), нажмите **ОК**, а затем **Продолжить**.

source: Your private key should now be listed in the **End-to-End Encryption** settings of your account.
ru: Теперь ваш секретный ключ должен быть указан в настройках **Сквозного шифрования** вашей учётной записи.

source: Select your private key to enable OpenPGP encryption for this account.
ru: Выберите свой ключ, чтобы включить шифрование OpenPGP для этой учётной записи.

source: <h2 id="generate-private">Generating a new OpenPGP private key</h2>
ru: <h2 id="generate-private">Создание нового секретного ключа OpenPGP</h2>

source: In the left pane, identify the account for which you want to create a new OpenPGP private key and choose **End-to-End Encryption**.
ru: В левой панели укажите учетную запись, для которой вы хотите создать новый секретный ключ OpenPGP, и выберите **Сквозное шифрование**.

source: In the **Add a Personal OpenPGP Key** dialog, choose **Create a new OpenPGP Key**.
ru: Нажмите кнопку **Добавить ключ...**. В диалоговом окне **Добавить персональный ключ OpenPGP** выберите **Создать новый ключ OpenPGP** и нажмите кнопку **Продолжить**.

source: Review the settings in the next dialog, click the **Generate key** button, and then click **Confirm**.
ru: Просмотрите настройки в следующем диалоговом окне. Нажмите кнопку **Создать ключ**, а затем нажмите **Подтвердить**.

source: <h2 id="encrypting">Encrypting an email</h2>
ru: <h2 id="encrypting">Шифрование email</h2>

source: To prevent you from sending unencrypted emails by mistake, *Thunderbird* in Tails is configured with the option **Require Encryption** turned on by default.
ru: Чтобы вы случайно не отправили незашифрованное письмо, *Thunderbird* в Tails настроен с опцией **Требовать шифрования** по умолчанию.

source: With the option **Require Encryption**, *Thunderbird* tries to encrypt every email before sending it.
ru: Благодаря опции **Требовать шифрования** *Thunderbird* старается зашифровать каждое электронное письмо перед отправкой.

source: To send an unencrypted email, in the composition window, choose **Security** and deselect the option **Require Encryption**.
ru: Чтобы отправить незашифрованное письмо, в меню «Настройки» выберите **Не шифровать**.

source: <p>We are unsatisfied with how the option <strong>Require Encryption</strong> works. Instead, <em>Thunderbird</em> should automatically encrypt when a public key is available and not try to encrypt otherwise.</p>
ru: На на взгляд, опция <strong>Требовать шифрования</strong> работает не лучшим образом. <em>Thunderbird</em> должен автоматически шифровать письмо, если доступен открытый ключ, и не пытаться шифровать иначе.</p>

source: <p>The developers of <em>Thunderbird</em> want to provide such an <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=135636">option to "encrypt when possible"</a> in future versions.</p>
ru: <p>Разработчики <em>Thunderbird</em> <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=135636 ">хотят это реализовать</a> в будущих версиях.< / p>

source: When sending an encrypted email:
ru: При отправке зашифрованного письма:

source: If you already have a public key for the recipient and have marked it as accepted, *Thunderbird* encrypts the email and sends it.
ru: Если у вас уже есть открытый ключ адресата и вы его подтвердили, *Thunderbird* зашифрует и отправит письмо.

source: If you already have a public key for the recipient but have not marked it as accepted yet, *Thunderbird* fails to send the email.
ru: Если у вас уже есть открытый ключ адресата, но вы его ещё не подтвердили, *Thunderbird* не сможет отправить email.

source: To mark the public key as accepted:
ru: Чтобы подтвердить открытый ключ:

source: In the error message, click **Close**.
ru: В сообщении об ошибке нажмите **Закрыть**.

source: In the **OpenPGP Message Security** dialog, select the recipient that is marked as **not accepted key** and click the **Manage keys for selected recipient&hellip;** button.
ru: В диалоговом окне **Безопасность сообщений OpenPGP** выберите адресата, помеченного как **нет принятого ключа**, и нажмите кнопку **Управление ключами для выбранного получателя&hellip;**.

source: If the recipient is marked as **no key available**, you don't yet have a public key for them.
ru: Если получатель помечен **ключ недоступен**, у вас нет его открытого ключа.

source: In the next dialog, select the public key of your recipient and click the **Open details and edit acceptance&hellip;** button.
ru: В следующем диалоговом окне выберите открытый ключ вашего адресата и нажмите кнопку **Открыть подробности и отредактировать принятие&hellip;**.

source: In the **Your Acceptance** tab of the **Key Properties** dialog, select the option that applies to how much you verified the public key.
ru: Во вкладке **Ваше согласие** диалогового окна **Свойства ключа** выберите вариант в зависимости от того, насколько тщательно вы проверили этот открытый ключ.

source: If you don't have a public key for the recipient, *Thunderbird* also fails to send the email.
ru: Если у вас нет открытого ключа адресата, *Thunderbird* также не сможет отправить email.

source: To look for a public key for this email address on the [keys.openpgp.org](https://keys.openpgp.org/) keyserver:
ru: Чтобы поискать открытый ключ для этого email на сервере ключей [keys.openpgp.org](https://keys.openpgp.org/):

source: Click the **Discover new or updated key** button.
ru: Нажмите кнопку **Поискать новый или обновлённый ключ**.

source: If no public key can be found, ask the recipient to send you their public key.
ru: Если открытый ключ не найден, попросите вашего адресата отправить вам свой открытый ключ.

source: If a public key for this email address is found, choose to import it.
ru: Если открытый ключ для этого email обнаружен, импортируйте его.

source: In the **OpenPGP Message Security** dialog, select the public key that was imported in the previous step and click the **Open details and edit acceptance&hellip;** button.
ru: В диалоговом окне **Безопасность сообщений OpenPGP** выберите открытый ключ, который был импортирован на предыдущем шаге, и нажмите кнопку **Открыть подробности и отредактировать принятие&hellip;**.
