Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet/Tor_Browser.*.po
Languages: ru

source: [[!meta title="Browsing the web with Tor Browser"]]
ru: [[!meta title="Просмотр веб-страниц с помощью Tor Browser"]]

source: <span class="application">[Tor Browser](https://www.torproject.org)</span> is a web browser based on [Mozilla Firefox](https://www.mozilla.org/firefox/) but configured to protect your privacy.
ru: <span class="application">[Tor Browser](https://www.torproject.org)</span> создан на основе [Mozilla Firefox](https://getfirefox.com), но обеспечивает лучшую защиту вашей приватности.

source: Sending your connections to websites through the Tor network is not enough to totally protect you while browsing the web:
ru: Вы можете просматривать веб-сайты через сеть Tor, но это не гарантирует стопроцентную защиту.

source: Cookies can be used to track and identify you across different websites.
ru: Злоумышленники могут использовать куки-файлы, чтобы следить за вами на разных сайтах и установить вашу личность.

source: Security vulnerabilities in JavaScript have been used to [deanonymize Tor Browser in the past](https://arstechnica.com/information-technology/2013/08/attackers-wield-firefox-exploit-to-uncloak-anonymous-tor-users/).
ru: Был случай, когда уязвимость JavaScript позволила злоумышленникам [отследить личные данные пользователей Tor Browser](https://arstechnica.com/information-technology/2013/08/attackers-wield-firefox-exploit-to-uncloak-anonymous-tor-users/).

source: This is why *Tor Browser* integrates all kinds of security protections inside the browser as well.
ru: Вот почему *Tor Browser* содержит столько видов защиты в самом браузере.

source: Some frequently asked questions about <span class="application">Tor Browser</span> can be found in [[the FAQ|support/faq#browser]].
ru: Некоторые часто задаваемые вопросы о <span class="запрос">Tor Browser</span> и ответы на них можно найти в [[FAQ|support/faq#browser]].

source: <h1 id="proxy">Proxy server refusing connections</h1>
ru: <h1 id="proxy">Прокси-сервер отказывает в подключении</h1>

source: The following error message in *Tor Browser* means that Tails is not yet connected to the Tor network:
ru: Такое сообщение об ошибке в *Tor Browser* означает, что Tails еще не подключился к сети Tor:

source: The proxy server is refusing connections
ru: Не удалось подключиться к прокси-серверу

source: Make sure that you are:
ru: Убедитесь, что вы:

source: [[Connected to a local network|anonymous_internet/networkmanager]]
ru: [[Подключены к локальной сети|anonymous_internet/networkmanager]]

source: [[Connected to the Tor network|anonymous_internet/tor]]
ru: [[Подключены к сети Tor|anonymous_internet/tor]]

source: <h1 id="confinement">AppArmor confinement, downloading, and uploading files</h1>
ru: <h1 id="confinement">Защита AppArmor, скачивание и загрузка файлов</h1>

source: <span class="application">Tor Browser</span> in Tails is confined with [[!debwiki AppArmor]] to protect the system and your data from some types of attacks against <span class="application">Tor Browser</span>. As a consequence, <span class="application">Tor Browser</span> in Tails can only read and write to a limited number of folders.
ru: Работа <span class="application">Tor Browser</span> в Tails происходит под контролем программного обеспечения [[!debwiki AppArmor]]. Это нужно для защиты системы и ваших данных от некоторых типов атак на <span class="application">Tor Browser</span>. Поэтому <span class="application">Tor Browser</span> в Tails может использовать ограниченное число папок.

source: <p>This is why, for example, you might face <em>Permission denied</em> errors if you try to download files to the <em>Home</em> folder.</p>
ru: <p>Вот почему, например, вы можете столкнуться с уведомлением <em>В доступе отказано</em> при попытке скачивания файлов в папку <em>Home</em>.</p>

source: - You can save files from <span class="application">Tor Browser</span> to the <span class="filename">Tor Browser</span> folder that is located in the <span class="filename">Home</span> folder. The content of this folder will disappear once you shut down Tails.
ru: - Вы можете сохранять файлы из <span class="application">Tor Browser</span> в папку <span class="filename">Tor Browser</span>, расположенную в <span class="filename">Home</span>. Содержимое этой папки исчезнет после того, как вы выйдете из Tails.

source: - If you want to upload files with <span class="application">Tor Browser</span>, copy them to that folder first.
ru: - Если вы хотите закачать файлы в интернет с помощью <span class="application">Tor Browser</span>, сначала скопируйте их в эту папку.

source: - If you turned on the [[Personal Data|doc/first_steps/persistence#personal_data]] feature of the Persistent Storage, you can also use the *Persistent/Tor Browser* folder to download and upload files from *Tor Browser*. The content of the *Persistent/Tor Browser* folder is saved across different working sessions.
ru: - Если вы подключили опцию [[Личные данные|doc/first_steps/persistence#personal_data]] в Постоянном хранилище, можете также использовать папку *Persistent/Tor Browser* для скачивания и загрузки файлов в *Tor Browser*. Содержимое папки *Persistent/Tor Browser* сохраняется после каждого сеанса работы.

source: <p>To prevent Tails from running out of memory and crashing, download very big files to the <em>Persistent/Tor Browser</em> folder. All the files that you download outside of the Persistent Storage are stored in memory (RAM), which is more limited.</p>
ru: <p>Чтобы предотвратить нехватку памяти и сбой Tails, лучше скачивать самые крупные файлы в папку <em>Persistent/TOR Browser</em>. Файлы, которые вы сохраняете за пределами Постоянного хранилища, остаются в (не очень большой) оперативной памяти.</p>

source: <h1 id="fingerprint">Hiding that you are using <i>Tor Browser</i></h1>
ru: <h1 id="fingerprint">Анонимное использование <i>Tor Browser</i></h1>

source: It is impossible to hide to the websites that you visit that you are using Tor, because the [list of exit nodes of the Tor network is public](https://metrics.torproject.org/exonerator.html).
ru: Посещать сайты через Tor и скрыть от них этот факт не получится. [Список выходных узлов сети Tor находится в публичном доступе](https://metrics.torproject.org/exonerator.html ).

source: That is why many more websites ask you to solve a CAPTCHA when using *Tor Browser*.
ru: Многие сайты просят вас ввести капчу при использовании *Tor Browser*.

source: The anonymity provided by *Tor Browser* works by making all users look the same to make it impossible to know who is who among the millions of users of *Tor Browser*.
ru: *Tor Browser* обеспечивает анонимность: все пользователи выглядят одинаково. Невозможно определить, кто есть кто среди миллионов пользователей *Tor Browser*.

source: Tails tries to make it as difficult as possible for websites to distinguish Tails users from other users of *Tor Browser*. If it was possible for a website to determine whether you are a user of *Tor Browser* inside or outside of Tails, this would provide a little bit more information about you and reduce your anonymity.
ru: Tails пытается сделать так, чтобы сайтам было как можно труднее отличать пользователей Tails от других пользователей *Tor Browser*. Если бы сайт мог определить, используете вы *Tor Browser* отдельно или в рамках Tails, о вас стало бы известно чуть больше в ущерб вашей анонимности.

source: The websites that you visit can retrieve a lot of information about your browser, whether it's *Tor Browser* or a regular browser. This information is called the *fingerprint* of the browser and includes the name and version of the browser, the size of the window, the time zone, the available fonts, etc.
ru: Посещаемые сайты могут получить много данных о вашем браузере, включая *Tor Browser*. Эти данные называют *отпечатком* браузера. Они включают название и версию браузера, размер окна, часовой пояс, доступные шрифты и т.д.

source: To make it difficult to distinguish Tails users from other users of *Tor Browser*, *Tor Browser* in Tails tries to provide the same information as *Tor Browser* on other operating systems.
ru: Чтобы пользователей Tails было сложнее отличить от других пользователей *Tor Browser*, встроенный *Tor Browser* старается предоставлять в Tails те же данные, что и в других операционных системах.

source: Refer to the [[fingerprint section of our list of known issues |support/known_issues#fingerprint]] to know if there are differences between the fingerprints of <span class="application">Tor Browser</span> inside and outside of Tails.
ru: Чтобы узнать больше об отпечатках <span class="application">Tor Browser</span> внутри и за пределами Tails, обратите внимание на [[соответствующий раздел|support/known_issues#fingerprint]].

source: A difference is that Tails includes the *uBlock Origin* extension, which removes advertisements. If an attacker can determine that you are not downloading the advertisements that are included in a webpage, that could reveal that you are a Tails user.
ru: В Tails есть расширение *uBlock Origin*, удаляющее рекламу. Если злоумышленник сможет определить, что вы не загружаете рекламные объявления на сайтах, он поймёт, что вы используете Tails.

source: <p>To hide to someone monitoring your Internet connection that you are connecting to Tor, see our documentation about [[connecting to the Tor network|tor]].</p>
ru: <p>Кто-то следит за вами в сети? Хотите скрыть от него факт использования Tor? [[Мы расскажем как|tor]].</p>

source: <h1 id="https-everywhere">HTTPS encryption with HTTPS Everywhere</h1>
ru: <h1 id="https-everywhere">Шифрование HTTPS с помощью HTTPS Everywhere</h1>

source: Using HTTPS instead of HTTP encrypts your communications with the website and prevents the [[Tor exit node from intercepting your communications|about/warnings/tor#exit]].
ru: Используйте HTTPS вместо HTTP. Ваше соединение будет зашифровано, а [[выходной узел Tor не сможет перехватить ваши данные|about/warnings/tor#exit]].

source: For example, here is how the browser looks when we try to log in to an email account at [riseup.net](https://riseup.net/), using their [webmail interface](https://mail.riseup.net/):
ru: Вот что мы видим в браузере, когда собираемся войти в аккаунт электронной почты [riseup.net](https://riseup.net /) через [веб-интерфейс](https://mail.riseup.net /):

source: Notice the padlock icon on the left of the address bar saying "mail.riseup.net". Notice also the address beginning with "https://" (instead of "http://"). These are the indicators that an encrypted connection using [[!wikipedia HTTPS]] is being used.
ru: Обратите внимание на значок замка в адресной строке слева от *mail.riseup.net*. Заметьте, что адрес начинается с *https://*, а не *http://*. Это говорит о том, что применяется зашифрованное соединение с использованием [HTTPS](https://ru.wikipedia.org/wiki/HTTPS).

source: When you are sending or retrieving sensitive information (like passwords), you should try to only use services providing HTTPS. Otherwise, it is very easy for an eavesdropper to steal whatever information you are sending, or to modify the content of a page on its way to your browser.
ru: Отправлять или получать важную информацию (например, вводить пароль на сайте) лучше только там, где используется HTTPS. Иначе злоумышленнику очень легко украсть любую передаваемую информацию или подменить содержимое страницы на пути к вашему браузеру.

source: [HTTPS Everywhere](https://www.eff.org/https-everywhere) is a Firefox extension included in <span class="application">Tor Browser</span>. It is produced as a collaboration between [The Tor Project](https://torproject.org/) and the [Electronic Frontier Foundation](https://eff.org/). It encrypts your communications with a number of major websites. Many sites on the web offer some limited support for encryption over HTTPS, but make it difficult to use. For example, they might default to unencrypted HTTP, or fill encrypted pages with links that go back to the unencrypted site. The HTTPS Everywhere extension fixes these problems by rewriting all requests to these sites to HTTPS.
ru: [HTTPS Everywhere](https://www.eff.org/https-everywhere) – расширение Firefox в составе <span class="application">Tor Browser</span>. Оно было разработано [The Tor Project](https://torproject.org/) совместно с [Electronic Frontier Foundation](https://eff.org/). Расширение обеспечивает включение зашифрованного соединения для множества сайтов. Иногда сайт в принципе поддерживает HTTPS-шифрование, но с проблемами. Например, сайт может по умолчанию использовать незашифрованные соединения HTTP или включать в зашифрованные страницы ссылки на незащищённый контент. Расширение HTTPS Everywhere решает эти проблемы. Оно следит, чтобы подключение шло по HTTPS.

source: To learn more about HTTPS Everywhere, you can see:
ru: Здесь вы можете узнать больше о HTTPS Everywhere:

source: the [HTTPS Everywhere homepage](https://www.eff.org/https-everywhere)
ru: [сайт HTTPS Everywhere](https://www.eff.org/https-everywhere);

source: the [HTTPS Everywhere FAQ](https://www.eff.org/https-everywhere/faq/)
ru: [FAQ HTTPS Everywhere](https://www.eff.org/https-everywhere/faq/).

source: <h1 id="javascript">Protection against dangerous JavaScript</h1>
ru: <h1 id="javascript">Защита от опасного JavaScript</h1>

source: Having all JavaScript disabled by default would disable a lot of harmless and possibly useful JavaScript, and might render many websites unusable.
ru: Отключение всего JavaScript по умолчанию приведёт к отключению большого объёма безобидного и, возможно, полезного JavaScript. Многими сайтами станет невозможно пользоваться.

source: That is why JavaScript is enabled by default but <span class="application">Tor Browser</span> disables all potentially dangerous JavaScript. We consider this as a necessary compromise between security and usability.
ru: Вот почему JavaScript по умолчанию включён. При этом <span class="application">Tor Browser</span> отключает весь потенциально опасный JavaScript. Это компромисс между безопасностью и удобством использования.

source: <p>To understand better the behavior of <span class="application">Tor Browser</span>, for example, regarding JavaScript and cookies, you can refer to the <a href="https://2019.www.torproject.org/projects/torbrowser/design/"> <span class="application">Tor Browser</span> design document</a>.</p>
ru: <p>Чтобы лучше понять работу <span class="application">Tor Browser</span>, например, с JavaScript и куки-файлами, см. <a href="https://2019.www.torproject.org/projects/torbrowser/design/"> <span class="application">описание Tor Browser</span> </a>.</p>

source: <h1 id="security-level">Security level</h1>
ru: <h1 id="security-level">Уровень безопасности</h1>

source: You can change the security level of <span class="application">Tor Browser</span> to disable browser features as a trade-off between security and usability. For example, you can set the security level to *Safest* to disable JavaScript completely.
ru: Вы можете изменить уровень безопасности <span class="application">Tor Browser</span>. Это позволит выбрать нужный баланс между безопасностью и удобством использования. Например, можно сменить уровень безопасности на *Безопасный* и полностью отключить JavaScript.

source: The security level is set to *Standard* by default which gives the most usable experience.
ru: По умолчанию установлен уровень безопасности *Стандартный*. Он подходит большинству пользователей.

source: To change the security level, click on the [[!img security-level.png class="symbolic" link="no"]] icon on the right of the address bar and choose <span class="guilabel">Advanced Security Settings&hellip;</span>.
ru: Чтобы изменить уровень безопасности, нажмите на значок [[!img security-level.png class="symbolic" link="no"]] справа от адресной строки и выберите <span class="guilabel">Расширенные настройки безопасности&hellip;</span>.

source: <p>You can safely disregard the message, "Your browser is being managed by your organization," which appears in the <span class="application">Tor Browser</span> preferences.</p>
ru: <p>Вы можете смело игнорировать сообщение «Вашим браузером управляет ваша организация», которое появляется в настройках <span class= "application">Tor Browser</span>.</p>

source: <p>All this message means is that the automatic updates feature of <span class="application">Tor Browser</span> has been disabled. This is done intentionally in Tails to make sure that no security feature or configuration gets broken by automatic updates of <span class="application">Tor Browser</span>.</p>
ru: <p>Это сообщение значит, что функция автоматического обновления <span class ="application">Tor Browser</span> отключена. В Tails это сделано намеренно, для уверенности, что ни одна функция безопасности или настройка не пострадает из-за автоматических обновлений <span class = "application">Tor Browser</span>.</p>

source: <h1 id="circuit-view">Tor circuit</h1>
ru: <h1 id="circuit-view">Цепочка Tor</h1>

source: Click on the padlock in the address bar to show the Tor circuit that is used to connect to the website in the current tab, its 3 relays, their countries, and IP addresses.
ru: Нажмите на значок замочка в адресной строке, чтобы увидеть цепочку Tor. Эта цепочка используется для подключения к сайту в текущей браузерной вкладке. Вы можете узнать, в каких странах находятся три узла, а также их IP-адреса.

source: The last relay in the circuit, the one immediately above the destination website, is the *exit relay*. Its country might influence how the website behaves.
ru: Последний узел в цепочке, прямо перед сайтом назначения – *выходной узел*. От его юрисдикции может зависеть доступ к сайту.

source: Click on the <span class="guilabel">[[New Circuit for this Site|Tor_Browser#circuit-view]]</span> button to use a different circuit.
ru: Чтобы изменить цепочку, нажмите на кнопку <span class="guilabel">[[Новая цепочка для этого сайта|Tor_Browser#circuit-view]]</span>.

source: You can use <span class="application">[[Onion Circuits|doc/anonymous_internet/tor/circuits]]</span> to get more detailed information about the circuits being used.
ru: Подробнее об используемых цепочках Tor можно узнать с помощью <span class="application">[[Onion Circuits|doc/anonymous_internet/tor/circuits]]</span>.

source: <h1 id="new-identity"><span class="guilabel">New Identity</span> feature</h1>
ru: <h1 id="new-identity"><span class="guilabel">Новая личность</span></h1>

source: The New Identity feature of <i>Tor Browser</i>:
ru: Опция смены личности в <i>Tor Browser</i>:

source: Closes all open tabs.
ru: закрывает все открытые вкладки;

source: Clears the session state including cache, history, and cookies.
ru: очищает данные после завершения сессии, включая кэш, историю и куки-файлы;

source: Closes all existing web connections and creates new Tor circuits.
ru: завершает все действующие веб-соединения и создает новые цепочки Tor;

source: Erases the content of the clipboard.
ru: очищает буфер обмена.

source: <p>This feature is not enough to strongly [[separate contextual identities|about/warnings/identity#contextual]] as the Tor circuits used ouside of <i>Tor Browser</i> are not changed.</p>
ru: <p>Этой опции мало, чтобы однозначно [[разделить личности|about/warnings/identity#contextual]], так как используемые за пределами <i>Tor Browser</i> цепочки не меняются.</p>

source: <p>Restart Tails instead.</p>
ru: <p>Лучше перезапустите Tails.</p>

source: For more details, see the [design and implementation of the Tor Browser](https://2019.www.torproject.org/projects/torbrowser/design/#new-identity).
ru: Подробнее см. [документацию по Tor Browser](https://2019.www.torproject.org/projects/torbrowser/design/#new-identity).

source: <h1 id="noscript">NoScript to have even more control over JavaScript</h1>
ru: <h1 id="noscript">Расширение NoScript для контроля над JavaScript</h1>

source: <span class="application">Tor Browser</span> includes the <span class="application">NoScript</span> extension to:
ru: <span class="application">Tor Browser</span> включает расширение <span class="application">NoScript</span> для:

source: Protect from more JavaScript attacks. For example, cross-site scripting (XSS) attacks.
ru: более эффективной защиты от атак с использованием JavaScript, например, от межсайтового скриптинга;

source: Allow you to disable JavaScript completely on some websites only.
ru: возможности полного отключения JavaScript на избранных сайтах.

source: For more information, you can refer to the NoScript [website](http://noscript.net/) and [features](http://noscript.net/features).
ru: Подробнее см. [сайт NoScript](https://noscript.net/) и его раздел [опций](https://noscript.net/features).

source: <h1 id="letterboxing">Letterboxing</h1>
ru: <h1 id="letterboxing">Леттербоксинг (Letterboxing)</h1>

source: The letterboxing feature of <span class="application">Tor Browser</span> helps to prevent websites from identifying your browser based on the size of its window. Without letterboxing, websites could use the size of the browser window to track visitors or weaken your anonymity.
ru: В <span class="application">Tor Browser</span> есть функция, которая не позволяет сайтам идентифицировать ваш браузер по размеру окна. Эта функция называется «леттербоксинг» (англ. letterboxing).

source: The letterboxing feature of <span class="application">Tor Browser</span> works by adding gray margins to the browser window when the window is resized. The webpage remains as close as possible to the desired size without revealing the actual size of the window.
ru: Опция леттербоксинга в <span class ="application">Tor Browser</span> добавляет серые поля в окно браузера при изменении его размера. Веб-страница максимально приближена к желаемым параметрам, но фактический размер окна при этом не раскрывается.
