Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet/unsafe_browser.*.po
Languages: fr, pt

source: [[!meta title="Signing in to a network using a captive portal"]]
fr: [[!meta title="Se connecter à un réseau utilisant un portail captif"]]
pt: [[!meta title="Autenticando-se em uma rede através de um portal captivo"]]

source: What captive portals are
fr: Ce que sont les portails captifs
pt: O que são portais cativos

source: [[!inline pages="doc/anonymous_internet/unsafe_browser/captive_portal.inline" raw="yes" sort="age"]]
fr: [[!inline pages="doc/anonymous_internet/unsafe_browser/captive_portal.inline.fr" raw="yes" sort="age"]]
pt: [[!inline pages="doc/anonymous_internet/unsafe_browser/captive_portal.inline.pt" raw="yes" sort="age"]]

source: <h1 id="security">Security implications of the <i>Unsafe Browser</i></h1>
fr: <h1 id="security">Les implications en matière de sécurité du <i>Navigateur non sécurisé</i></h1>
pt: <h1 id="security">Implicações de segurança do <i>Navegador Inseguro</i></h1>

source: For better security, the *Unsafe Browser* is disabled by default because:
fr: Pour une meilleure sécurité, le *Navigateur non sécurisé* est désactivé par défaut parce que :
pt: Para aumentar a segurança, o *Navegador não-confiável* é desativado por padrão, pois:

source: [[!inline pages="doc/anonymous_internet/unsafe_browser/security_implications.inline" raw="yes" sort="age"]]
fr: [[!inline pages="doc/anonymous_internet/unsafe_browser/security_implications.inline.fr" raw="yes" sort="age"]]
pt: [[!inline pages="doc/anonymous_internet/unsafe_browser/security_implications.inline.pt" raw="yes" sort="age"]]

source: <p>To learn how Tails implements the <i>Unsafe Browser</i>, see our [[design documentation about the <i>Unsafe Browser</i>|contribute/design/Unsafe_Browser]].</p>
fr: <p>Pour voir comment Tails implémente le <i>Navigateur non sécurisé</i>, consulter notre [[documentation sur la conception du <i>Navigateur non sécurisé</i>|contribute/design/Unsafe_Browser]].</p>
pt: <p>Para saber como Tails implementa o <i>Navegador Inseguro</i>, veja nossa [[documentação de projeto sobre o <i>Navegador Inseguro</i>|contribute/design/Unsafe_Browser]].</p>

source: <h1 id="use">Starting the <i>Unsafe Browser</i></h1>
pt: <h1 id="use">Iniciando o <i>Navegador Inseguro</i></h1>

source: To start the *Unsafe Browser*:
fr: Pour démarrer le *Navigateur non sécurisé* :
pt: Para iniciar o *Navegador não-confiável*:

source: When the [[Welcome Screen|first_steps/welcome_screen]] appears, click on the **[[!img lib/list-add.png alt="Add Additional Setting" class="symbolic" link="no"]]** button.
fr: Quand l'[[écran de bienvenue|first_steps/welcome_screen]] apparaît, cliquez sur le bouton **[[!img lib/list-add.png alt="Paramètres supplémentaires" class="symbolic" link="no"]]**.
pt: Quando a [[Tela de Boas-vindas|first_steps/welcome_screen]] aparecer, clique no botão **[[!img lib/list-add.png alt="Add Additional Setting" class="symbolic" link="no"]]**.

source: Choose **Unsafe Browser** in the **Additional Settings** dialog.
fr: Choisissez **Navigateur non sécurisé** dans la boîte de dialogue **Paramètres supplémentaires**.
pt: Escolha **Unsafe Browser** na caixa de diálogo **Configurações Adicionais**.

source: Select the **Enable the Unsafe Browser** option.
fr: Sélectionner l'option **Activer le Navigateur non sécurisé**.
pt: Escolha a opção **Enable the Unsafe Browser**.

source: Click **Start Tails**.
fr: Cliquer sur **Démarrer Tails**.
pt: Clique em **Iniciar Tails**.

source: In Tails, choose **Applications**&nbsp;▸ **Internet**&nbsp;▸ **Unsafe Browser**.
pt: No Tails, selecione **Aplicativos**&nbsp;▸ **Internet**&nbsp;▸ **Navegador Inseguro**.

source: Signing in to a network using a captive portal
pt: Entrando em uma rede usando um portal cativo

source: [[!inline pages="doc/anonymous_internet/unsafe_browser/logging_in.inline" raw="yes" sort="age"]]
fr: [[!inline pages="doc/anonymous_internet/unsafe_browser/logging_in.inline.fr" raw="yes" sort="age"]]
pt: [[!inline pages="doc/anonymous_internet/unsafe_browser/logging_in.inline.pt" raw="yes" sort="age"]]

source: <p>To always enable the <em>Unsafe Browser</em>, turn on the [[Welcome Screen|doc/first_steps/persistence#welcome_screen]] feature of the Persistent Storage.</p>
fr: <p>Pour activer de façon permanente le <em>Navigateur non sécurisé</em>, activez la fonction [[Écran de bienvenue|doc/first_steps/persistence#welcome_screen]] du stockage persistant.</p>
pt: <p>Para manter o <em>Navegador Inseguro</em> sempre habilitado, ative a funcionalidade de Armazenamento Persistente na [[Tela de Boas-vindas|doc/first_steps/persistence#welcome_screen]]</p>

source: [[!inline pages="doc/anonymous_internet/unsafe_browser/chroot.inline" raw="yes" sort="age"]]
fr: [[!inline pages="doc/anonymous_internet/unsafe_browser/chroot.inline.fr" raw="yes" sort="age"]]
pt: [[!inline pages="doc/anonymous_internet/unsafe_browser/chroot.inline.pt" raw="yes" sort="age"]]
