Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/first_steps/persistence/backup.*.po
Languages: fr

source: [[!meta title="Making a backup of your Persistent Storage"]]
fr: [[!meta title="Créer une sauvegarde de votre stockage persistant"]]

source: <p>If your Tails is broken and you are trying to rescue your Persistent Storage, see our [[instructions on rescuing your Persistent Storage from a broken Tails|doc/first_steps/persistence/rescue]].</p>
fr: <p>Si votre Tails est défectueux et que vous essayez de récupérer votre stockage persistant, consultez nos [[instructions sur comment récupérer votre stockage persistant d'un Tails défectueux|doc/first_steps/persistence/rescue]].</p>

source: <h1 id="create">Create a new Tails to store your backup</h1>
fr: <h1 id="create">Créer un nouveau Tails pour enregistrer votre sauvegarde</h1>

source: We recommend you to create another Tails to store your backup. This way, if your Tails is lost or damaged, you can replace it immediately with your backup Tails.
fr: Nous vous recommandons de créer un autre Tails pour enregistrer votre sauvegarde. De cette façon, si votre Tails est perdu ou endommagé, vous pouvez le remplacer immédiatement avec votre Tails de sauvegarde.

source: <p>Your backup Tails must be version 4.14 or newer.</p>
fr: <p>Votre Tails de sauvegarde doit être d'une version 4.14 ou plus récente </p>

source: Install Tails on a new USB stick on which you want to create your backup Tails. For detailed instructions, see how to [[install Tails from another Tails|install/clone#install-tails]]. Make sure that this new USB stick is at least as large as your current Tails USB stick.
fr: Installez Tails sur une nouvelle clé USB sur laquelle vous voulez créer votre Tails de sauvegarde. Pour des instructions détaillées, regardez comment [[installer Tails depuis un autre Tails|install/clone#install-tails]]. Assurez-vous que cette nouvelle clé USB est au moins de capacité égale à celle de votre clé USB Tails actuelle.

source: We recommend making your backup Tails USB stick look different than your current Tails USB stick to avoid using your backup Tails by mistake.
fr: Nous vous recommandons de faire votre Tails de sauvegarde sur une clé USB qui a une apparence différente de votre clé USB Tails actuelle pour éviter d'utiliser votre Tails de sauvegarde par erreur.

source: Shutdown and unplug your current Tails USB stick.
fr: Éteingnez et débranchez votre clé USB Tails actuelle.

source: Restart on your backup Tails and create a Persistent Storage on it. For detailed instructions, see how to [[create and configure the Persistent Storage|doc/first_steps/persistence]].
fr: Redémarrez sur votre Tails de sauvegarde et créez un stockage persistant sur celui-ci. Pour des instructions détaillées, regardez comment [[créer et configurer le stockage persistant|doc/first_steps/persistence]].

source: <div class="tip"> <p>We recommend using the same passphrase as your current Tails so that the passphrase is easier to remember.</p> </div>
fr: <div class="tip"> <p>Nous vous recommandons d'utiliser la même phrase de passe que votre Tails actuel ainsi la phrase de passe est facile à retenir.</p> </div>

source: When the Persistent Storage settings shows the list of possible features, click **Save** and exit.
fr: Lorsque le paramétrage du stockage persistant affiche la liste des options possibles, cliquez sur **Enregistrer** et quittez.

source: The backup process described below overrides the configuration of the Persistent Storage. So, it does not matter which features you turn on when creating the Persistent Storage.
fr: Le processus de sauvegarde décrit ci-dessous écrase la configuration du stockage persistant. Par conséquent, les options que vous activez ne sont pas importantes lorsque vous créez le stockage persistant.

source: Shutdown and unplug your backup Tails USB stick.
fr: Éteignez et débranchez votre clé USB Tails.

source: <h1 id="update">Create or update your backup</h1>
fr: <h1 id="update">Créer ou mettre à jour votre sauvegarde</h1>

source: Start on your current Tails and unlock the Persistent Storage.
fr: Démarrer sur votre Tails actuel et déverrouiller le stockage persistant.

source: Plug in your backup Tails USB stick.
fr: Branchez votre clé USB Tails de sauvegarde.

source: <p>Each time you update your backup, only the files that have changed are copied.</p>
fr: <p>À chaque fois que vous mettez à jour votre sauvegarde, seuls les fichiers qui ont changé sont copiés.</p>

source: If your backup Tails has an outdated version of Tails, we recommend you upgrade it by cloning your current Tails using <span class="application">Tails Installer</span>. For detailed instructions, see how to [[manually upgrade from another Tails|upgrade/clone#upgrade]].
fr: Si votre Tails de sauvegarde contient une version qui n'est pas à jour, nous vous recommandons de le mettre à jour en clonant votre Tails actuel en utilisant l'<span class="application">Installeur de Tails</span>. Pour des instructions détaillées, regardez comment [[mettre à jour manuellement depuis un autre Tails|upgrade/clone#upgrade]].

source: Updating your backup Tails from a terminal
fr: Mettre à jour votre clé USB Tails de sauvegarde depuis un terminal

source: If you prefer updating your backup Tails from a terminal, execute the following command from a *Root Terminal*:
fr: Si vous préférez mettre à jour votre sauvegarde Tails depuis un terminal, exécutez la commande suivante depuis un *Terminal d'administration* :

source: When the command finishes, it displays a summary of the data that was copied. For example:
fr: Lorsque la commande est terminée, elle affiche un résumé des données qui ont été copiées. Par exemple :
