Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/first_steps/persistence/rescue.*.po
Languages: fr, ru

source: [[!meta title="Rescuing your Persistent Storage from a broken Tails"]]
fr: [[!meta title="Récupérer le stockage persistant d'un Tails endommagé"]]
ru: [[!meta title="Спасение Постоянного хранилища от проблемного Tails"]]

source: If your Tails becomes broken, for example, it no longer starts, you can follow these instructions to try to rescue your Persistent Storage.
fr: Si votre Tails tombe en panne, par exemple si elle ne démarre plus, vous pouvez suivre ces instructions pour essayer de récupérer votre stockage persistant.
ru: Если у вас проблемы с Tails, например, он больше не запускается, можете следовать этим инструкциям, чтобы попытаться спасти свое Постоянное хранилище.

source: <p>It is advisable to keep a current backup of your Persistent Storage. To learn how to create a backup of your Persistent Storage, see our [[instructions on how to back up your Persistent Storage to another Tails USB stick|doc/first_steps/persistence/backup]].</p>
fr: <p>Il est conseillé de conserver une sauvegarde de votre stockage persistant. Pour apprendre comment créer une sauvegarde de votre stockage persistant, voir [[comment faire une sauvegarde de votre stockage persistant sur une autre clé USB Tails|doc/first_steps/persistence/backup]].</p>
ru: <p> Рекомендуется время от времени делать резервную копию Постоянного хранилища. О том, как создавать резервные копии, см.[[здесь|doc/first_steps/persistence/backup]].</p>

source: Install Tails on a new USB stick on which you want to rescue your Persistent Storage. Make sure that this new USB stick is at least as large as the USB stick that has your broken Tails on it.
fr: Installer Tails sur une nouvelle clé USB sur laquelle vous voulez récupérer votre stockage persistant. Assurez vous que cette nouvelle clé USB a une capacité de stockage au moins égale à celle de la clé de votre Tails en panne.
ru: Установите Tails на новую флешку, куда хотите переписать Постоянное хранилище. Убедитесь, что эта флешка по объёму не меньше флешки с проблемной копией Tails.

source: Start on your new Tails and create a Persistent Storage. For detailed instructions, see how to [[create and configure a Persistent Storage|doc/first_steps/persistence]].
fr: Démarrez sur votre nouveau Tails et créez un stockage persistant. Pour les instructions détaillées, voir comment [[créer et configurer un stockage persistant|doc/first_steps/persistence]].
ru: Запустите новую копию Tails и создайте Постоянное хранилище. Подробнее о создании и настройке Постоянного хранилища см. [[здесь|doc/first_steps/persistence]].

source: When the Persistent Storage settings shows the list of possible features, click **Save** and exit.
fr: Quand les paramètres du stockage persistant listent les fonctionnalités possibles, cliquez sur **Sauvegarder** et quitter.
ru: Когда в настройках Постоянного хранилища увидите список возможных опций, нажмите **Save** и выйдите.

source: The process described below overrides the configuration of the Persistent Storage. So, it does not matter which features you turn on when creating the Persistent Storage.
fr: Le processus décrit ci-dessous remplace la configuration du stockage persistant. Ainsi, les fonctionnalités que vous activez lors de la création du stockage persistant n'ont aucune importance.
ru: Далее описано, как настраивать Постоянное хранилище. (Неважно, какие опции вы включаете при создании Постоянного хранилища).

source: Restart on your new Tails, set up an [[administration password|doc/first_steps/welcome_screen/administration_password]], and unlock the Persistent Storage.
fr: Redémarrez sur votre nouveau Tails, configurez un [[mot de pass d'administration|doc/first_steps/welcome_screen/administration_password]], et déverrouillez le stockage persistant.
ru: Перезагрузите новую копию Tails, установите [[пароль администратора|doc/first_steps/welcome_screen/administrator_password]] и разблокируйте Постоянное хранилище.

source: Make sure that all applications are closed before continuing with these instructions. Otherwise, the Persistent Storage might not be properly rescued from your broken Tails.
fr: Assurez-vous que toutes les applications sont fermées avant de continuer avec ces instructions. Sinon, le stockage persistant risque de ne pas être correctement récupéré de votre Tails endommagé.
ru: Прежде чем продолжить, убедитесь, что все приложения закрыты. инструкции. В противном случае перенос Постоянного хранилища из проблемного Tails может не получиться.

source: Plug in the USB stick that has your broken Tails on it.
fr: Branchez la clé USB sur laquelle se trouve votre Tails endommagé.
ru: Подключите флешку с проблемным Tails.

source: A new encrypted volume appears in the sidebar of the <span class="application">Files</span> browser. Click on it and enter the passphrase of your broken Tails to unlock the volume.
fr: Un nouveau volume chiffré apparaît dans la barre latérale du navigateur de <span class="application">Fichiers</span>. Cliquez dessus et entrez la phrase de passe de votre Tails endommagé pour déverrouiller le volume.
ru: В боковой панели менеджера <span class = "application">Файлы</span> вы увидите новый зашифрованный том. Щёлкните по нему и введите пароль проблемного Tails, чтобы разблокировать том.

source: The Persistent Storage of your broken Tails shows up as <span class="guilabel">TailsData</span>.
fr: Le stockage persistant de votre Tails endommagé apparaît sous le nom de <span class="guilabel">TailsData</span>.
ru: Постоянное хранилище проблемного Tails отображается как <span class="guilabel">TailsData</span>.

source: <p>If an encrypted volume does not appear, then you might not be able to rescue the Persistent Storage of your broken Tails.</p>
fr: <p>Si aucun volume chiffré n'apparaît, il se peut que vous ne puissiez pas récupérer le stockage persistant de votre Tails endommagé.</p>
ru: <p>Если зашифрованный том не показан, вероятно, вы не сможете спасти Постоянное хранилище из проблемного Tails. </p>

source: Execute the following command to rescue the Persistent Storage of your broken Tails to your new Tails:
fr: Exécutez la commande suivante pour récupérer le stockage persistant de votre Tails endommagé vers votre nouveau Tails :
ru: Чтобы перенести Постоянное хранилище из проблемного Tails в новую копию Tails, выполните следующую команду:

source: When the command finishes, it displays a summary of the data that was copied. For example:
fr: Lorsque la commande est terminée, elle affiche un résumé des données qui ont été copiées. Par exemple :
ru: После завершения процесса появится сводка скопированных данных. Пример:

source: You can now eject the <span class="guilabel">TailsData</span> volume in the <span class="application">Files</span> browser and unplug the USB stick that has your broken Tails on it.
fr: Vous pouvez maintenant éjecter le volume <span class="guilabel">TailsData</span> dans le navigateur de <span class="application">Fichiers</span> et débrancher la clé USB sur laquelle se trouve votre Tails endommagé.
ru: Теперь вы можете извлечь том <span class = "guilabel">TailsData</span> в файловом менеджере <span class = "application">Файлы</span> и отключить флешку с проблемным Tails.
