Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/first_steps/persistence/warnings.*.po
Languages: es, fr, it, pt, ru

source: [[!meta title="Warnings about the Persistent Storage"]]
es: [[!meta title="Precauciones sobre el Almacenamiento Persistente"]]
fr: [[!meta title="Avertissements à propos du stockage persistant"]]
it: [[!meta title="Avvertimenti riguardo l'Archivio Persistente"]]
pt: [[!meta title="Avisos sobre o Armazenamento Persistente"]]
ru: [[!meta title="Предупреждения о Постоянном хранилище"]]

source: Storing sensitive documents
es: Guardar documentos delicados
fr: Stocker des documents sensibles
it: Archiviare documenti sensibili
pt: Armazenando documentos sensíveis
ru: Хранение важных документов

source: The Persistent Storage is not hidden. An attacker in possession of your USB stick can know that there is a Persistent Storage on it. Take into consideration that you can be forced or tricked to give out its passphrase.
es: El Almacenamiento Persistente no está oculto. Un atacante en posesión de tu memoria USB puede saber que existe un Almacenamiento Persistente en él. Considera que podrías ser forzado o engañado para entregar tu contraseña.
fr: Le stockage persistant n'est pas caché. Un attaquant en possession de votre clé USB peut ainsi savoir qu'elle contient un stockage persistant. Prenez en considération le fait que l'on peut vous forcer ou vous duper pour obtenir la phrase de passe.
it: L'archivio persistente non è nascosto. Un attaccante in possesso della tua chiavetta USB può sapere che, all'interno di essa, è presente un volume persistente. Tieni in considerazione che potresti essere forzato o ingannato a cedere la password di esso.
pt: O Armazenamento Persistente não fica oculto. Um atacante em posse do seu pendrive USB pode saber que existe um Armazenamento Persistente nele. Leve em consideração que podem tentar te forçar ou enganar para conseguir a senha.
ru: Постоянное хранилище не является скрытым. Если злоумышленник завладеет вашей флешкой, он сможет узнать, что на ней есть Постоянное хранилище. Имейте в виду, что при определённых обстоятельствах вас могут силой или обманом заставить выдать пароль к хранилищу.

source: Read also our instructions to [[securely delete the Persistent Storage|delete]].
es: Lee también nuestras instrucciones para [[borrar el Almacenamiento Persistente de manera segura|delete]].
fr: Lire également nos instructions pour [[supprimer de manière sécurisée le stockage persistant|delete]].
it: Leggi anche le nostre istruzioni per [[cancellare in maniera sicura il volume persistente|delete]].
pt: Leia também as instruções para [[apagar de forma segura o Armazenamento Persistente|delete]].
ru: См. также наши советы о том, как [[надёжно удалить Постоянное хранилище|delete]].

source: Overwriting configurations
es: Sobrescribir configuraciones
fr: Écrasement des configurations par défaut
it: Sovrascrivere le configurazioni
pt: Sobrescrevendo configurações
ru: Приоритетные настройки

source: You can weaken your security or break some programs if you use the Persistent Storage to overwrite their settings. The programs included in Tails are carefully configured with security in mind. Be especially careful when using the [[Dotfiles|persistence#dotfiles]] feature.
es: Puedes debilitar tu seguridad o romper algunos programas si usas el Almacenamiento Persistente para sobreescribir su configuración. Los programas incluidos en Tails se configuran cuidadosamente con la seguridad en mente. Ten cuidado sobre todo con la funcionalidad [[Dotfiles|persistence#dotfiles]].
fr: Vous pouvez affaiblir votre sécurité ou casser certains programmes si vous utilisez le stockage persistant pour écraser leurs paramètres. Les programmes inclus dans Tails sont soigneusement configurés dans un souci de sécurité. Soyez particulièrement prudent lorsque vous utilisez la fonction [[Dotfiles|persistence#dotfiles]].
pt: Você pode enfraquecer sua segurança ou quebrar alguns programas se você usar o Armazenamento Persistente para sobrescrever suas configurações. Os programas inclusos no Tails estão cuidadosamente configurados tendo segurança em mente. Tenha especial cuidado ao usar a funcionalidade [[Dotfiles|persistence#dotfiles]].

source: The anonymity of Tor and Tails relies on making it harder to distinguish one Tails user from another. In some cases, changing the default settings can break your anonymity.
es: El anonimato de Tor y Tails se basa en dificultar la distinción entre un usuario de Tails y cualquier otro. En algunos casos, cambiar las configuraciones por defecto puede romper tu anonimato.
fr: L'anonymat de Tor et Tails repose sur le principe de rendre plus difficile la distinction entre différentes personnes utilisant Tails. Dans certains cas, changer les paramètres par défaut peut rompre votre anonymat.
it: L'anonimato di Tor e Tails si basa sul rendere difficile distinguere un utente Tails da un altro. In certi casi, cambiare le configurazioni predefinite può violare il tuo anonimato.
pt: A anonimidade do Tor e do Tails depende de tornar mais difícil distinguir entre um usuário e outro. Em alguns casos, mudar as configurações padrões pode acabar com a sua anonimidade.
ru: Анонимность Tor и Tails зависит от того, насколько трудно (постороннему) отличить одного пользователя Tails от другого. В некоторых случаях изменение настроек по умолчанию может разрушить вашу анонимность.

source: Use to the minimum
es: Utilizar al mínimo
fr: Utilisez-le au minimum
it: Usalo il meno possibile
pt: Use o mínimo possível
ru: Используйте по-минимуму

source: Use the Persistent Storage only when necessary and to the minimum:
es: Usa el Almacenamiento Persistente sólo cuando sea necesario y lo mínimo posible:
fr: N'utilisez le stockage persistant que lorsque cela est nécessaire et au minimum :
it: Utilizza l'archivio persistente il meno possibile e solo quando è necessario:
pt: Use o Armazenamento Persistente apenas quando necessário e o mínimo possível:
ru: Используйте Постоянное хранилище только когда это действительно необходимо и минимальным образом.

source: Only unlock the Persistent Storage when you need it.
es: Desbloquéalo sólo cuando lo necesites.
fr: Ne déverrouillez le stockage persistant que lorsque vous en avez besoin.
it: Sblocca l'archivio persistente solo quando ne hai bisogno.
pt: Apenas desbloqueie o Armazenamento Persistente quando precisar dele.
ru: Разблокируйте Постоянное хранилище только когда оно действительно нужно.

source: Only turn on the features of the Persistent Storage that you need.
es: Añade sólo las funcionalidades del Almacenamiento Persistente que vayas a usar.
fr: N'activez que les fonctionnalités du stockage persistant dont vous avez besoin.
it: Attiva solo le funzionalità dell'archivio persistente che ti servono.
pt: Apenas habilite as funcionalidades do Armazenamento Persistente que você precisa.
ru: Включайте только те опции Постоянного хранилища, которые вам необходимы.

source: Only the files and folders that you specify are saved in the Persistent Storage.
es: Sólo los archivos y directorios que especifiques se guardarán en el Almacenamiento Persistente.
fr: Seuls les fichiers et dossiers que vous spécifiez sont enregistrés dans le stockage persistant.
it: Solo i file e le cartelle che tu scegli vengono salvati nell'archivio persistente.
pt: Apenas os arquivos e pastas que você especificar serão salvos no Armazenamento Persistente.
ru: Только отмеченные вами файлы и папки попадают в Постоянное хранилище.

source: Opening the persistent volume from other operating systems
es: Abrir el volumen persistente desde otros sistemas operativos
fr: Accéder au volume persistant depuis un autre système d'exploitation
it: Aprire l'archivio persistente da altri sistemi operativi
pt: Abrindo o volume persistente usando outros sistemas operacionais
ru: Открытие Постоянного хранилища из других операционных систем

source: You can compromise your security if you open the Persistent Storage from another operating system.
es: Puedes comprometer tu seguridad si abres el Almacenamiento Persistente desde otros sistemas operativos.
fr: Vous pouvez compromettre votre sécurité si vous ouvrez le stockage persistant à partir d'un autre système d'exploitation.
it: Puoi compromettere la tua sicurezza se apri l'archivio persistente da un altro sistema operativo.
pt: Você pode comprometer sua segurança se você abrir o Armazenamento Persistente usando outros sistemas operacionais.
ru: Если вы открываете Постоянное хранилище из другой операционной системы, это может навредить вашей безопасности.

source: For example, another operating system might create thumbnails of images or index the contents of files in the Persistent Storage.
es: Por ejemplo, otro sistema operativo podría crear thumbnails de imágenes o indexar los contenidos de los archivos del Almacenamiento Persistente.
fr: Par exemple, un autre système d'exploitation peut créer des vignettes d'images ou indexer le contenu des fichiers dans le stockage persistant.
it: Ad esempio, un altro sistema operativo potrebbe creare miniature di immagini oppure indicizzare i contenuti dei file nell'archivio persistente.
pt: Por exemplo, outro sistema operacional pode criar miniaturas de imagens ou indexar o conteúdo dos arquivos no Armazenamento Persistente.
ru: Например, другая операционная система может автоматически создавать миниатюры изображений или индексировать файлы в Постоянном хранилище.
