Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet.index.*.po
Languages: pt

source: Connecting to the Internet and Tor
pt: Conectando à Internet e à rede Tor

source: [[!traillink Connecting_to_a_local_network|anonymous_internet/networkmanager]]
pt: [[!traillink Conectando_a_uma_rede_local|anonymous_internet/networkmanager]]

source: [[!traillink Troubleshooting_Wi-Fi_not_working|anonymous_internet/no-wifi]]
pt: [[!traillink Resolvendo_problemas_quando_o_Wi-Fi_não_funciona|anonymous_internet/no-wifi]]

source: [[!traillink Signing_in_to_a_network_using_a_captive_portal|anonymous_internet/unsafe_browser]]
pt: [[!traillink Logando_em_uma_rede_através_de_um_portal_cativo|anonymous_internet/unsafe_browser]]

source: [[!traillink Connecting_to_the_Tor_network|anonymous_internet/tor]]
pt: [[!traillink Conectando_à_rede_Tor|anonymous_internet/tor]]

source: [[!traillink Troubleshooting_connecting_to_Tor|anonymous_internet/tor/troubleshoot]]
pt: [[!traillink Resolvendo_problemas_com_a_conexão_à_rede_Tor|anonymous_internet/tor/troubleshoot]]

source: [[!traillink Why_does_Tails_use_Tor?|anonymous_internet/tor/why]]
pt: [[!traillink Por_que_o_Tails_usa_Tor?|anonymous_internet/tor/why]]

source: [[!traillink Why_is_Tor_slow?|anonymous_internet/tor/slow]]
pt: [[!traillink Por_que_a_rede_Tor_é_lenta?|anonymous_internet/tor/slow]]

source: [[!traillink Viewing_the_circuits_of_Tor|anonymous_internet/tor/circuits]]
pt: [[!traillink Visualizando_os_circuitos_Tor|anonymous_internet/tor/circuits]]

source: Internet applications
pt: Aplicativos de Internet

source: [[!traillink Browsing_the_web_with_<i>Tor_Browser</i>|anonymous_internet/tor_browser]]
pt: [[!traillink Navegando_na_Internet_com_o_<i>Navegador_Tor</i>|anonymous_internet/tor_browser]]

source: [[!traillink Sharing_files_with_<i>OnionShare</i>|anonymous_internet/onionshare]]
pt: [[!traillink Compartilhando_arquivos_com_<i>OnionShare</i>|anonymous_internet/onionshare]]

source: [[!traillink Emailing_and_reading_news_with_<i>Thunderbird</i>|anonymous_internet/thunderbird]]
pt: [[!traillink Acessando_email_e_lendo_noticias_com_<i>Thunderbird</i>|anonymous_internet/thunderbird]]

source: [[!traillink Exchanging_bitcoins_using_<i>Electrum</i>|anonymous_internet/electrum]]
pt: [[!traillink Realizando_transações_com_bitcoin_usando_<i>Electrum</i>|anonymous_internet/electrum]]

source: [[!traillink Chatting_with_<i>Pidgin</i>_and_OTR|anonymous_internet/pidgin]]
pt: [[!traillink Batendo_papo_com_<i>Pidgin</i>_e_OTR|anonymous_internet/pidgin]]
