Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/first_steps.index.*.po
Languages: pt

source: Starting Tails
pt: Iniciando Tails

source: [[!traillink On_PC|first_steps/start/pc]]
pt: [[!traillink Em_um_PC|first_steps/start/pc]]

source: [[!traillink On_Mac|first_steps/start/mac]]
pt: [[!traillink Em_um_Mac|first_steps/start/mac]]

source: [[!traillink Accessibility|first_steps/accessibility]]
pt: [[!traillink Acessibilidade|first_steps/accessibility]]

source: [[!traillink Welcome_Screen|first_steps/welcome_screen]]
pt: [[!traillink Tela_de_Boas-vindas|first_steps/welcome_screen]]

source: [[!traillink Administration_password|first_steps/welcome_screen/administration_password]]
pt: [[!traillink Senha_de_administração|first_steps/welcome_screen/administration_password]]

source: [[!traillink MAC_address_anonymization|first_steps/welcome_screen/mac_spoofing]]
pt: [[!traillink Anonimização_de_endereço_MAC|first_steps/welcome_screen/mac_spoofing]]

source: [[!traillink Introduction_to_GNOME_and_the_Tails_desktop|first_steps/desktop]]
pt: [[!traillink Introdução_ao_GNOME_e_à_área_de_trabalho_do_Tails|first_steps/desktop]]

source: [[!traillink Why_is_the_time_wrong?|first_steps/desktop/time]]
pt: [[!traillink Por_que_a_hora_está_errada?|first_steps/desktop/time]]

source: [[!traillink Persistent_Storage|first_steps/persistence]]
pt: [[!traillink Armazenamento_Persistente|first_steps/persistence]]

source: [[!traillink Warnings_about_the_Persistent_Storage|first_steps/persistence/warnings]]
pt: [[!traillink Avisos_sobre_o_Armazenamento_Persistente|first_steps/persistence/warnings]]

source: [[!traillink Making_a_backup_of_your_Persistent_Storage|first_steps/persistence/backup]]
pt: [[!traillink Fazendo_um_backup_do_seu_Armazenamento_Persistente|first_steps/persistence/backup]]

source: [[!traillink Rescuing_your_Persistent_Storage_from_a_broken_Tails|first_steps/persistence/rescue]]
pt: [[!traillink Resgatando_seu_Armazenamento_Persistente_de_um_Tails_quebrado|first_steps/persistence/rescue]]

source: [[!traillink Deleting_the_Persistent_Storage|first_steps/persistence/delete]]
pt: [[!traillink Apagando_o_Armazenamento_Persistente|first_steps/persistence/delete]]

source: [[!traillink Installing_additional_software|first_steps/additional_software]]
pt: [[!traillink Instalando_programas_adicionais|first_steps/additional_software]]

source: [[!traillink Reporting_an_error|first_steps/bug_reporting]]
pt: [[!traillink Reportando_um_erro|first_steps/bug_reporting]]

source: [[!traillink Shutting_down_Tails|first_steps/shutdown]]
pt: [[!traillink Desligando_o_Tails|first_steps/shutdown]]
