Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/upgrade.*.po
Languages: fr

source: [[!meta title="Upgrading a Tails USB stick"]]
fr: [[!meta title="Mettre à jour une clé USB Tails"]]

source: Tails includes an automatic mechanism to upgrade a USB stick to the latest version of Tails. When an automatic upgrade is performed, only an *upgrade package* is downloaded. The upgrade package contains all the changes made to Tails since Tails was first installed or was last manually upgraded.
fr: Tails embarque un système de mise à jour automatique vers la dernière version de Tails pour les clés USB. Quand une mise à jour automatique est lancée, seul un *paquet de mise à jour* est téléchargé. Le paquet de mise à jour contient tous les changements de Tails depuis la première installation de Tails ou depuis la dernière fois qu'il a été mis à jour manuellement.

source: In some cases, it is impossible to do an **automatic upgrade** and you might have to do a **manual upgrade**. This page describes both techniques.
fr: Dans quelques cas, il est impossible de faire une **mise à jour automatique** et vous pouvez avoir besoin de faire une **mise à jour manuelle**. Cette page décrit les deux méthodes.

source: <p>Your Persistent Storage will be preserved by both automatic and manual upgrades.</p>
fr: <p>Votre stockage persistant sera préservé lors des mises à jour automatiques et manuelles.</p>

source: If you use Tails from a DVD, you need to [[burn a new DVD|install/dvd]].
fr: Si vous utilisez Tails depuis un DVD, vous devez [[graver un nouveau DVD|install/dvd]].

source: <h1 id="check-version">Checking which version of Tails you are currently running</h1>
fr: <h1 id="check-version">Connaître la version de Tails que vous être en train d'exécuter</h1>

source: <h1 id="automatic">Automatic upgrade using <i>Tails Upgrader</i></h1>
fr: <h1 id="automatic">Mise à jour automatique avec le <i>Tails Upgrader</i></h1>

source: After starting Tails and connecting to Tor, <span class="application">Tails Upgrader</span> automatically checks if upgrades are available and then proposes you to upgrade your USB stick. The upgrades are checked for and downloaded through Tor.
fr: Après le démarrage de Tails et la connexion à Tor, le <span class="application">Tails Upgrader</span> vérifie automatiquement si des mises à jour sont disponibles et vous propose le cas échéant de mettre à jour votre clé USB. Les mises à jour sont vérifiées et téléchargées via Tor.

source: The advantages of this technique are the following:
fr: Les avantages de cette technique sont les suivants :

source: You only need a single Tails USB stick. The upgrade is done on the fly from a running Tails. After upgrading, you can restart and use the new version.
fr: Vous n'avez besoin que d'une seule clé USB Tails. La mise à jour est faite à la volée depuis un Tails en cours d'utilisation. Après la mise à jour, vous pouvez redémarrer et utiliser directement la nouvelle version.

source: The upgrade is much smaller to download than a full USB image.
fr: La mise à jour est beaucoup plus petite à télécharger qu'une image USB complète.

source: The upgrade mechanism includes cryptographic verification of the upgrade. You don't have to verify the USB image yourself anymore.
fr: Le mécanisme de mise à jour inclut une vérification cryptographique de la mise à jour. Vous n'avez plus à vérifier l'image USB vous-même.

source: Requirements:
fr: Pré-requis :

source: A Tails USB stick.
fr: Une clé USB Tails.

source: An Internet connection.
fr: Une connexion Internet.

source: After connecting to Tor, if an upgrade is available, a dialog appears and proposes you to upgrade your USB stick.
fr: Après connexion à Tor, si une mise à jour est disponible, une boîte de dialogue apparaît et vous propose de mettre à jour votre clé USB.

source: If you decide to do the upgrade, click on <span class="guilabel">Upgrade now</span>, and follow the assistant through the upgrade process.
fr: Si vous voulez faire la mise à jour, cliquez sur <span class="guilabel">Mettre à jour maintenant</span>, et suivez l'assistant à travers le processus de mise à jour.

source: <p>If you cannot upgrade at startup (for example, if you have no network connection by then), you can start <span class="application">Tails Upgrader</span> later by opening a terminal and executing the following command:</p>
fr: <p>Si vous ne pouvez pas mettre à jour au démarrage (par exemple si vous n'avez pas de connexion à un réseau au démarrage), vous pouvez lancer <span class="application">Tails Upgrader</span> plus tard en ouvrant un terminal et en exécutant la commande suivante :</p>

source: <h2 id="troubleshooting">Troubleshooting</h2>
fr: <h2 id="troubleshooting">Résolution de problèmes</h2>

source: If an error occurs during the upgrade, the assistant proposes you to read one of the following pages:
fr: Si une erreur se produit durant la mise à jour, l'assistant vous propose de lire l'une des pages suivantes :

source: If an error occurs while checking for available upgrades:<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/check.en.html|upgrade/error/check]]
fr: Si une erreur se produit lors de la vérification des mises à jour disponibles :<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/check.fr.html|upgrade/error/check]]

source: If an error occurs while download the upgrade:<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/download.en.html|upgrade/error/download]]
fr: Si une erreur se produit lors du téléchargement de la mise à jour :<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/download.fr.html|upgrade/error/download]]

source: If an error occurs while installing the upgrade:<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/install.en.html|upgrade/error/install]]
fr: Si une erreur se produit lors de l'installation de la mise à jour :<br/> [[file:///usr/share/doc/tails/website/doc/upgrade/error/install.fr.html|upgrade/error/install]]

source: If your Tails USB stick fails to start after an automatic upgrade, see below how to do a manual upgrade.
fr: Si votre clé USB Tails n'arrive pas à démarrer après une mise à jour automatique, voir ci-dessous comment faire une mise à jour manuelle.

source: <h2 id="reduce">Reducing the size of the download</h2>
fr: <h2 id="reduce">Réduire la taille du téléchargement</h2>

source: When doing automatic upgrades, the size of the download increases over time.
fr: Lors des mises à jour automatiques, la taille du téléchargement augmente avec le temps.

source: You can reduce the size of the download of future automatic upgrades by doing a [[manual upgrade|upgrade#manual]] to the latest version.
fr: Vous pouvez réduire la taille du téléchargement des futures mises à niveau automatiques en effectuant une [[mise à jour manuelle|upgrade#manual]] vers la dernière version.

source: Your Tails USB stick stores:
fr: Votre clé USB Tails stocke :

source: 1 **base** version that you first installed or to which you last did a manual upgrade
fr: 1 version **de base** que vous avez installée la toute première fois ou vers laquelle vous avez effectué la dernière mise à jour manuelle

source: 1 **upgrade** package containing all the changes made to Tails since the base version
fr: 1 paquet **mise à jour** contenant toutes les modifications apportées à Tails depuis la version de base

source: For example, if you install a Tails USB stick with 4.6, the base version is 4.6, and:
fr: Par exemple, si vous installez une clé USB Tails avec la version 4.6, la version de base est la 4.6, et :

source: - The upgrade to 4.7 is 181 MB. - The upgrade to 4.8 is 347 MB. - The upgrade to 4.9 is 418 MB.
fr: - La mise à jour vers la version 4.7 représente 181 Mo. - La mise à jour vers la version 4.8 représente 347 Mo. - La mise à jour vers la version 4.9 représente 418 Mo.

source: But if you do a manual upgrade of the same USB stick from 4.7 to 4.8, the base version becomes 4.8, and then:
fr: Mais si vous effectuez une mise à jour manuelle de la même clé USB de la 4.7 vers la 4.8, la version de base devient la 4.8, alors :

source: The upgrade to 4.9 is only 205 MB, instead of 418 MB when 4.6 was the base version.
fr: La mise à jour vers la 4.9 ne représente que 205 Mo, au lieu de 418 Mo lorsque la 4.6 était la version de base.

source: <h1 id="manual">Manual upgrade using <i>Tails Installer</i></h1>
fr: <h1 id="manual">Mise à jour manuelle avec l'<i>Installeur de Tails</i></h1>

source: It might not always be possible to do an automatic upgrade as described [[above|upgrade#automatic]]. For example, when:
fr: Il n'est parfois pas possible de faire une mise à jour automatique comme décrit [[ci-dessus|upgrade#automatic]]. Par exemple lorsque :

source: No automatic upgrade is available from our website for this version.
fr: Aucune mise à jour automatique n'est disponible depuis notre site web pour cette version.

source: The automatic upgrade is impossible for technical reasons (not enough memory, not enough free space on the USB stick, etc.). For example, if you get the following error message:
fr: La mise à jour automatique est impossible pour des raisons techniques (pas assez de mémoire, pas assez d'espace libre sur la clé USB, etc.). Par exemple, si vous obtenez le message d'erreur suivant :

source: there is not enough free space on the Tails system partition
fr: il n'y a pas assez d'espace libre sur la partition système de Tails

source: The automatic upgrade failed and you need to repair a Tails USB stick.
fr: La mise à jour automatique échoue et que vous devez réparer la clé USB Tails.

source: You want to upgrade by cloning from another Tails USB stick which is already up-to-date, for example, when working offline or with a slow Internet connection.
fr: Vous souhaitez effectuer une mise à niveau en clonant une autre clé USB Tails déjà à jour, par exemple lorsque vous travaillez hors ligne ou avec une connexion Internet lente.

source: After connecting to Tor, a dialog informs you if you have to upgrade your USB stick using <span class="application">Tails Installer</span> to a newer version of Tails.
fr: Après connexion à Tor, une boîte de dialogue vous prévient si vous devez mettre à jour votre clé USB vers une version plus récente de Tails en utilisant l'<span class="application">Installeur de Tails</span>.

source: <p>You can also do a manual upgrade to reduce the size of future automatic upgrades, as described [[above|upgrade#reduce]].</p>
fr: <p>Vous pouvez également effectuer une mise à jour manuelle afin de réduire la taille des futures mises à jour automatiques futures, comme décrit [[ci-dessus|upgrade#reduce]].</p>

source: To do a manual upgrade, you can either:
fr: Pour effectuer une mise à jour manuelle, vous pouvez soit :

source: - [[Download and upgrade|doc/upgrade/#download]] (below) - [[Upgrade by cloning from another Tails|doc/upgrade/#clone]] (below) - [[Burn a new Tails DVD|install/dvd]] - [[Upgrade your virtual machine|install/vm]]
fr: - [[Télécharger et mettre à jour|doc/upgrade/#download]] (ci-dessous) - [[Mettre à jour en clonant depuis un autre Tails |doc/upgrade/#clone]] (ci-dessous) - [[Graver un nouveau DVD Tails|install/dvd]] - [[Mettre à jour votre machine virtuelle|install/vm]]

source: <h2 id="download">Download and upgrade</h2>
fr: <h2 id="download">Télécharger et mettre à jour</h2>

source: You need:
fr: Vous avez besoin de :

source: Your Tails USB stick
fr: Votre clé USB Tails

source: Another empty USB stick <small>(at least 8 GB)</small>&nbsp;[[!toggle id="why_extra" text="Why?"]]
fr: Une autre clé USB vide <small>(au moins 8 Go)</small>&nbsp;[[!toggle id="why_extra" text="Pourquoi ?"]]

source: 1 hour to download Tails (<small class="remove-extra-space">[[!inline pages="inc/stable_amd64_iso_size" raw="yes" sort="age"]]</small>)
fr: 1 heure pour télécharger Tails (<small class="remove-extra-space">[[!inline pages="inc/stable_amd64_iso_size" raw="yes" sort="age"]]</small>)

source: [[!inline pages="install/inc/router/why_extra.inline" raw="yes" sort="age"]]
fr: [[!inline pages="install/inc/router/why_extra.inline.fr" raw="yes" sort="age"]]

source: See our instructions on how to do a manual upgrade by:
fr: Voir nos instructions sur comment effectuer une mise à niveau manuelle en :

source: - [[Downloading and upgrading from your Tails|upgrade/tails]] (more secure) - [[Downloading and upgrading from Windows|upgrade/windows]] (more convenient) - [[Downloading and upgrading from macOS|upgrade/mac]] (more convenient) - [[Downloading and upgrading from Linux|upgrade/linux]] (more convenient)
fr: - [[Télécharger et mettre à jour depuis votre Tails|upgrade/tails]] (plus sûr) - [[Télécharger et mettre à jour depuis Windows|upgrade/windows]] (plus facile) - [[Télécharger et mettre à jour depuis macOS|upgrade/mac]] (plus facile) - [[Télécharger et mettre à jour depuis Linux|upgrade/linux]] (plus facile)

source: <p>Downloading and upgrading from Windows might be less secure if your Windows has viruses. But, it might be more convenient and faster.</p>
fr: <p>Télécharger et mettre à jour depuis Windows peut être moins sûr si votre Windows a des virus. Mais ça peut être plus pratique et plus rapide.</p>

source: <h2 id="clone">Upgrade by cloning from another Tails</h2>
fr: <h2 id="clone">Mettre à jour en clonant un autre Tails</h2>

source: If you know someone you trust who already did the upgrade, you can upgrade your Tails by cloning from their Tails.
fr: Si vous connaissez une personne de confiance qui a déjà effectué la mise à niveau, vous pouvez mettre à niveau votre Tails en clonant à partir de son Tails.

source: - [[Cloning from another Tails|upgrade/clone]]
fr: - [[Cloner depuis un autre Tails|upgrade/clone]]
