Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/advanced_topics/internal_hard_disk.*.po
Languages: ru

source: [[!meta title="Accessing the internal hard disk"]]
ru: [[!meta title="Доступ к внутреннему жёсткому диску"]]

source: <p>Accessing internal disks of the computer has security implications:
ru: <p>Доступ к внутренним дискам компьютера влияет на безопасность:

source: <ul> <li>You can leave traces of your activities in Tails on the hard disks.</li> <li>If Tails is compromised, a malware could install itself on your usual operating system.</li> <li>If an application in Tails is compromised, it could access private data on your disks and use it to de-anonymize you.</li> </ul>
ru: <ul> <li>после ваших действий в Tails могут оставаться следы на жёстких дисках;</li> <li>если в Tails окажется уязвимость, вредоносная программа может установить сама себя в вашей обычной операционной системе;</li> <li>если уязвимость обнаружится в приложении Tails, вредоносная программа может получить доступ к личным данным на ваших дисках и использовать их для вашей деанонимизации.</li> </ul>

source: To access internal hard disks:
ru: Для доступа к внутренним жёстким дискам:

source: When starting Tails, [[set up an administration password|doc/first_steps/welcome_screen/administration_password/]].
ru: При запуске Tails [[задайте пароль администратора|doc/first_steps/welcome_screen/administration_password/]].

source: Open the [[*Files* browser|doc/first_steps/desktop#files]].
ru: Откройте файловый менеджер [[*Файлы*|doc/first_steps/desktop#files]].

source: Click on the hard disk of your choice in the left pane.
ru: В левой панели выберите нужный жёсткий диск.

source: <p>If your usual operating system is in hibernation, accessing it might corrupt your file system. Only access your disk if your system was shut down properly.</p>
ru: <p>Если ваша обычная операционная система находится в спящем режиме, доступ к ней может привести к повреждению вашей файловой системы. Запрашивать доступ к диску лучше только в том случае, если система была выключена должным образом.</p>

source: <p>If you have a GNU/Linux system on your disks, you can only access files owned by the first user (<code>uid=1000</code>) on that system.</p>
ru: <p>Если у вас GNU/Linux, можно получить доступ только к файлам, принадлежащим первому пользователю (<code>uid=1000</code>) в этой системе.</p>

source: <p>In all cases, you might encounter permissions problems. To bypass permission limitations, you can run the <span class="application">Files</span> browser with administration rights.</p>
ru: <p>Во любом случае может возникнуть проблема с разрешениями. Чтобы обойти ограничения по разрешениям, можно запустить файловый менеджер <span class="application">Файлы</span> с правами администратора.</p>
