Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/advanced_topics/lan.*.po
Languages: es, ru

source: [[!meta title="Accessing resources on the local network"]]
es: [[!meta title="Acceder a recursos en la red local"]]
ru: [[!meta title="Доступ к ресурсам в локальной сети"]]

source: The term "local network" here refers to the set of computers and devices that can be reached directly from your computer without going through the Internet. For example, your home router, your network printer, or the intranet of your company are most likely on your local network, also called LAN for Local Area Network. In technical terms, this refers to the set of IP addresses defined in [RFC1918](https://tools.ietf.org/html/rfc1918).
es: El término "red local" se refiere en este documento al conjunto de ordenadores y dispositivos que pueden alcanzarse directamente desde tu ordenador sin salir a Internet. Por ejemplo: el router de tu casa, tu impresora en red, o la intranet de tu compañía seguramente están en tu red local, también llamada LAN por Local Area Network. En términos técnicos, esto se refiere al conjunto de direcciones IP definidas en [RFC1918](https://tools.ietf.org/html/rfc1918).
ru: Термин «локальная сеть» в данном случае подразумевает набор компьютеров и устройств, к которым можно получить доступ непосредственно с вашего компьютера (без выхода в Интернет). Примеры: ваш домашний роутер, сетевой принтер или интранет вашей компании. Все они, скорее всего, находятся в вашей локальной сети, иначе говоря LAN (Local Area Network). Технически локальная сеть — набор IP-адресов, определенных в [RFC1918] (https://tools.ietf.org/html/rfc1918).

source: Security considerations
es: Consideraciones de seguridad
ru: Требования безопасности

source: Accessing resources on the local network can be useful in the context of Tails, for example to exchange documents with someone on the same local network without going through the Internet.
es: Acceder a recursos de red locales puede ser útil en el contexto de Tails, por ejemplo para intercambiar documentos con alguien en la misma red local sin pasar a través de Internet.
ru: Доступ к ресурсам в локальной сети может быть полезен и в Tails. Пример такой задачи — обмен документами с кем-то в той же локальной сети без использования Интернета.

source: But an application that can connect to both resources on the Internet (going through Tor) and resources on the local network (without going through Tor) can break your anonymity. For example, if a website that you visit anonymously using <span class="application">Tor Browser</span> could also connect to other web pages that are specific to your local network, then this information could reveal where you are. This is why <span class="application">Tor Browser</span> is prevented from accessing the local network in Tails.
es: Pero una aplicación que se puede conectar al mismo tiempo a recursos en Internet (a través de Tor) y recursos en la red local (que no van a través de Tor) puede romper tu anonimato. Por ejemplo, si un sitio web que visitas anónimamente usando el <span class="application">Tor Browser</span> pudiera conectarse a otras páginas de tu red local, esta información podría revelar quién eres. Es por esto que el <span class="application">Tor Browser</span> no tiene permitido acceder a la red local en Tails.
ru: Но приложение, которое может подключаться как к ресурсам в Интернете (через Tor), так и к ресурсам в локальной сети (без Tor), может навредить вашей анонимности. Например, если сайт, который вы посещаете анонимно с помощью <span class="application">Tor Browser</span>, также может подключаться к другим веб-страницам в вашей локальной сети, то злоумышленники могут определить ваше местоположение. Вот почему <span class="application">Tor Browser</span> защищён от доступа к локальной сети в Tails.

source: This page describes some of the security measures built in Tails to protect from such attacks and explains how to access some types of resources on the local network.
es: Esta página describe algunas de las medidas de seguridad incorporadas en Tails para proteger de estos ataques y explica cómo acceder a recursos en la red local.
ru: На этой странице описаны некоторые настройки безопасности Tails для защиты от подобных атак. Вы также найдёте здесь рассказ о том, как получить доступ к некоторым типам ресурсов в локальной сети.

source: <p>Connections made to the local network are not anonymous and do not go through Tor.</p>
es: <p>Las conexiones hechas en la red local no son anónimas ni pasan a través de Tor.</p>
ru: <p>Подключения к локальной сети не анонимны и не выполняются через Tor.</p>

source: Browsing web pages on the local network
es: Navegar páginas web en la red local
ru: Просмотр веб-страниц в локальной сети

source: It is impossible to access web pages on the local network using <span class="application">Tor Browser</span>. This prevents websites on the Internet from deducing your location from the content of other web pages that might be specific to your local network.
es: Es imposible acceder a páginas web en la red local usando <span class="application">Tor Browser</span>. Esto impide que los otros sitios en Internet deduzcan tu ubicación del contenido de otras webs que sean específicas de tu red local.
ru: Получить доступ к веб-страницам в локальной сети с помощью <span class="application">Tor Browser</span> нельзя. Поэтому сайты в Интернете не могут определять ваше местоположение по содержимому других страниц (которое может быть характерным для вашей сети).

source: To access web pages on the local network, use the [[<span class="application">Unsafe Browser</span>|anonymous_internet/unsafe_browser]] instead.
es: Para acceder páginas en la red local, usa el [[<span class="application">Unsafe Browser</span>|anonymous_internet/unsafe_browser]] en su lugar.
ru: Для доступа к страницам в локальной сети используйте [[<span class="application">Небезопасный браузер</span>|anonymous_internet/unsafe_browser]].

source: Downloading files from web pages on the local network
es: Descargar archivos de páginas web en la red local
ru: Скачивание файлов с веб-страниц в локальной сети

source: [[!inline pages="doc/anonymous_internet/unsafe_browser/chroot.inline" raw="yes" sort="age"]]
es: [[!inline pages="doc/anonymous_internet/unsafe_browser/chroot.inline.es" raw="yes" sort="age"]]
ru: [[!inline pages="doc/anonymous_internet/unsafe_browser/chroot.inline.ru" raw="yes" sort="age"]]

source: To download files from web pages on the local network, you can use the `curl` command instead. For example, to download a document available on the local network at <span class="filename">http://192.168.1.40/document.pdf</span> execute the following command:
es: En su lugar, para descargar archivos desde la red local puedes usar la orden `curl`. Por ejemplo, para descargar un documento disponible en la red local en <span class="filename">http://192.168.1.40/document.pdf</span>, ejecuta esta orden:
ru: Для скачивания файлов с веб-страниц в локальной сети вы можете использовать команду `curl`. Например, чтобы скачать документ по адресу <span class="filename">http://192.168.1.40/document.pdf</span>, выполните следующую команду:
