Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/advanced_topics/virtualization.*.po
Languages: es, fr, ru

source: [[!meta title="Running Tails in a virtual machine"]]
es: [[!meta title="Arrancar Tails en una máquina virtual"]]
fr: [[!meta title="Utiliser Tails dans une machine virtuelle"]]
ru: [[!meta title="Запуск Tails на виртуальной машине"]]

source: It is sometimes convenient to be able to run Tails without having to restart your computer every time. This is possible using [[!wikipedia Virtual_machine desc="virtual machines"]].
es: A veces es conveniente poder usar Tails sin tener que reiniciar tu ordenador cada vez. Esto se puede hacer usando [[!wikipedia_es Máquina_virtual desc="máquinas virtuales"]].
fr: Il peut être pratique de pouvoir lancer Tails sans avoir à redémarrer son ordinateur à chaque fois. C'est possible grâce aux [[!wikipedia_fr Machine_virtuelle desc="machines virtuelles"]].
ru: Иногда бывает удобнее запустить Tails без необходимости перезагружать компьютер. Это возможно с помощью [виртуальных машин](https://ru.wikipedia.org/wiki/%D0%92%D0%B8%D1%80%D1%82%D1%83%D0%B0%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F_%D0%BC%D0%B0%D1%88%D0%B8%D0%BD%D0%B0).

source: With virtual machines, it is possible to run Tails inside a *host* operating system (Linux, Windows, or macOS). A virtual machine emulates a real computer and its operating system, called a *guest*, which appears in a window on the *host* operating system.
es: Con las máquinas virtuales se puede ejecutar Tails dentro de un sistema operativo *anfitrión* (Linux, Windows o macOS). Una máquina virtual emula un ordenador real y su sistema operativo, llamado *guest* (huésped) que aparece en una ventana del sistema operativo *host* (anfitrión).
fr: Grâce aux machines virtuelles, il est possible de faire tourner Tails à l'intérieur d'un système d'exploitation *hôte* (Linux, Windows, ou macOS). Une machine virtuelle émule un vrai ordinateur et son système d’exploitation, appelé un *invité*, qui apparaît dans une fenêtre du système d'exploitation *hôte*.
ru: Таким образом нетрудно запустить Tails из другой, уже работающей операционной системы — *хоста* (Linux, Windows или macOS). Виртуальная машина имитирует реальный компьютер и его операционную систему, называемую *гостевой*. Она отображается в окне операционной системы *хоста*.

source: When running Tails in a virtual machine, you can use most features of Tails from your usual operating system, and you can use both Tails and your usual operating system in parallel, without the need to restart the computer.
es: Cuando se usa Tails en una máquina virtual, puedes usar la mayoría de las funcionalidades de Tails desde tu sistema operativo y, usar Tails y tu sistema operativo habitual en paralelo sin necesidad de reiniciar el ordenador.
fr: Lorsque vous utilisez Tails dans une machine virtuelle, vous pouvez utiliser la plupart des fonctionnalités de Tails depuis votre système d'exploitation habituel, et vous pouvez utiliser à la fois Tails et votre système d'exploitation habituel en parallèle, sans avoir besoin de redémarrer l'ordinateur.
ru: При запуске Tails на виртуальной машине вы можете использовать большинство функций Tails из своей обычной операционной системы. Фактически, вы можете использовать Tails и свою обычную операционную систему параллельно. Перезагружать компьютер не требуется.

source: This is how Tails looks when run in a virtual machine on Debian using *GNOME Boxes*:
es: Así es como aparece Tails cuando lo ejecutas en una máquina virtual en Debian usando *GNOME Boxes*:
fr: Voilà ce à quoi ressemble Tails dans une machine virtuelle sous Debian en utilisant *GNOME Boxes* :
ru: Вот как выглядит Tails при запуске на виртуальной машине в Debian с использованием приложения *Боксы GNOME*:

source: <p>We do not currently provide a solution for running a virtual machine inside a Tails host.</p>
es: <p>Por el momento no proveemos una solución para ejecutar una máquina virtual dentro de un anfitrión Tails.</p>
fr: <p>Nous ne fournissons pas à l'heure actuelle de solution pour faire tourner une machine virtuelle dans un hôte Tails.</p>
ru: <p> В настоящее время у нас нет решения для запуска виртуальной машины в Tails (как хост-системе).</p>

source: Security considerations
es: Consideraciones de seguridad
fr: Remarques à propos de la sécurité
ru: Требования безопасности

source: Running Tails inside a virtual machine has various security implications. Depending on the host operating system and your security needs, running Tails in a virtual machine might be dangerous.
es: Usar Tails dentro de una máquina virtual tiene varias implicaciones de seguridad. Dependiendo del sistema operativo anfitrión y tus necesidades de seguridad, usar Tails en una máquina virtual puede ser peligroso.
fr: Faire tourner Tails dans une machine virtuelle a de nombreuses conséquences en terme de sécurité. En fonction du système d’exploitation hôte et de vos besoins en terme de sécurité, faire tourner Tails dans une machine virtuelle peut être dangereux.
ru: Запуск Tails на виртуальной машине может повлиять на безопасность (в зависимости от операционной системы хоста и ваших ожиданий безопасности).

source: Both the host operating system and the [[virtualization software|virtualization#software]] are able to monitor what you are doing in Tails.
es: Tanto el sistema operativo anfitrión como el [[software de virtualización|virtualization#software]] son capaces de monitorizar lo que estás haciendo en Tails.
fr: Le système d'exploitation hôte ainsi que le [[logiciel de virtualisation|virtualization#software]] sont capables d'observer et d'analyser ce que vous faites dans Tails.
ru: Как операционная система хоста, так и [[программное обеспечение для виртуализации|virtualization#software]] могут отслеживать, что вы делаете в Tails.

source: If the host operating system is compromised with a software keylogger or other malware, then it can break the security features of Tails.
es: Si el sistema operativo anfitrión está infectado con un keylogger u otro malware podría romper funcionalidades de seguridad de Tails.
fr: Si le système d'exploitation hôte est compromis par un enregistreur de frappe logiciel ou autre logiciel malveillant, cela peut outrepasser les fonctionnalités de sécurité de Tails.
ru: Если хост-система подверглась атаке со стороны кейлогера или другого вредоносного кода, это может навредить системе защиты Tails.

source: Only run Tails in a virtual machine if both the host operating system and the virtualization software are trustworthy.
es: Usa Tails en una máquina virtual sólo si confías en el sistema operativo anfitrión y en el software de virtualización.
fr: N'utilisez Tails dans une machine virtuelle que si le système d’exploitation hôte et le logiciel de virtualisation sont de confiance.
ru: Запускайте Tails на виртуальной машине только в том случае, если и операционная система хоста, и программное обеспечение для виртуализации заслуживают доверия.

source: Traces of your Tails session are likely to be left on the local hard disk. For example, host operating systems usually use swapping (or *paging*) which copies part of the RAM to the hard disk.
es: Es posible que queden huellas de tu sesión de Tails en el disco duro local. Por ejemplo, el sistema operativo anfitrión normalmente usa espacio de intercambio (o *paginado*) que copia parte de la RAM al disco duro.
fr: Des traces de votre session Tails sont susceptibles d'être laissées sur votre disque dur local. Par exemple, le système d'exploitation hôte utilise habituellement la mémoire virtuelle (swap ou *paging*) dans laquelle une partie de la RAM est copiée sur le disque dur.
ru: Следы вашей сессии Tails, скорее всего, останутся на локальном жёстком диске. Например, хост-система может использовать *файл подкачки*. Это значит, что часть оперативной памяти копируется на жёсткий диск.

source: Only run Tails in a virtual machine if leaving traces on the hard disk is not a concern for you.
es: Usa Tails en una máquina virtual sólo si dejar huellas en tu disco duro no es un problema para ti.
fr: N'utilisez Tails dans une machine virtuelle que si laisser des traces sur le disque dur n'est pas un problème pour vous.
ru: Запускайте Tails на виртуальной машине только в том случае, если вас не беспокоят следы, остающиеся на жёстком диске.

source: This is why Tails warns you when it is running inside a virtual machine.
es: Por eso es que Tails te advierte que estás corriendo en una máquina virtual.
fr: C'est pourquoi Tails vous avertit quand il est lancé dans une machine virtuelle.
ru: Вот почему Tails предупреждает вас, когда он работает внутри виртуальной машины.

source: The Tails virtual machine does not modify the behaviour of the host operating system and the network traffic of the host is not anonymized. The MAC address of the computer is not modified by the [[MAC address anonymization|first_steps/welcome_screen/mac_spoofing]] feature of Tails when run in a virtual machine.
es: La máquina virtual de Tails no modifica el comportamiento del sistema operativo anfitrión y el tráfico de red no es anonimizado. La dirección MAC del ordenador no se modifica con la funcionalidad de [[anonimización de dirección MAC|first_steps/welcome_screen/mac_spoofing]] de Tails cuando lo usas desde una máquina virtual.
fr: La machine virtuelle Tails ne modifie pas le comportement du système d'exploitation hôte et le trafic réseau de l'hôte n'est pas anonymisé. L'adresse MAC de l'ordinateur n'est pas modifiée par la fonctionnalité d'[[anonymisation d'adresse MAC|first_steps/welcome_screen/mac_spoofing]] de Tails si celui-ci est lancé dans une machine virtuelle.
ru: Виртуальная машина Tails не вносит изменений в операционную систему хоста. Сетевой трафик хоста не становится анонимным. MAC-адрес компьютера не изменяется из-за [[соответствующей функции Tails|first_steps/welcome_screen/mac_spoofing]].

source: Virtualization solutions
es: Soluciones de virtualización
fr: Solutions de virtualisation
ru: Решения для виртуализации

source: To run Tails inside a virtual machine, you need to have virtualization software installed on the host operating system. Different virtualization software exists for Linux, Windows, and macOS.
es: Para ejecutar Tails dentro de una máquina virtual, necesitas tener instalado el software de virtualización en el sistema operativo host. Existen diferentes software de virtualización para Linux, Windows y macOS.
fr: Pour faire tourner Tails dans une machine virtuelle, vous avez besoin d'un logiciel de virtualisation installé sur le système d'exploitation hôte. Différents logiciels de virtualisation existent pour Linux, Windows, et macOS.
ru: Чтобы запустить Tails внутри виртуальной машины, вам необходимо установить программу виртуализации в операционной системе хоста. Есть разные программы виртуализации для Linux, Windows, macOS.

source: <p>The following list includes only free software as we believe that this is a necessary condition for the software to be trustworthy. See the [[previous warning|virtualization#trustworthy]] and our statement about [[free software and public scrutiny|about/trust#free_software]].</p>
es: <p>La lista siguiente incluye sólo software libre porque creemos que esta condición es necesaria para que el software sea confiable. Mira la [[advertencia previa|virtualization#trustworthy]] o nuestra declaración sobre el [[software libre y el escrutinio público|about/trust#free_software]].</p>
fr: <p>La liste suivante ne comprend que des logiciels libres car nous pensons que c'est une condition nécessaire pour qu'un logiciel soit digne de confiance. Voir l'[[avertissement précédent|virtualization#trustworthy]] et notre déclaration sur les [[logiciels libres et l'examen publique|about/trust#free_software]].</p>
ru: <p>В списке ниже — только свободное программное обеспечение. Мы считаем, что это необходимое условие надёжности программ. См. также [[информацию о надёжности виртуализации|virtualization#trustworthy]] и наше заявление о [[свободном программном обеспечении и общественном контроле|bout/trust#free_software]].</p>

source: <p>Proprietary virtualization software solutions exist such as <span class="application">VMWare</span> but are not listed here on purpose.</p>
es: <p>Existen soluciones de virtualización privativas como <span class="application">VMWare</span> pero las hemos omitido a propósito.</p>
fr: <p>Des logiciels propriétaires de virtualisation existent, tels que <span class="application">VMWare</span>, mais ils ne sont pas listés ici à dessein.</p>
ru: <p>Существуют и проприетарные программные решения для виртуализации, например, <span class="application">VMware</span>. Мы сознательно не включили их в наш список.</p>

source: **<em>VirtualBox</em>** is available on Linux, Windows, and Mac. Its free software version does not include support for USB devices and does not allow use of a Persistent Storage.
es: **<em>VirtualBox</em>** está disponible en Linux, Windows y Mac. Su versión libre no incluye soporte para dispositivos USB y no permite tener un Almacenamiento Persistente.
fr: **<em>VirtualBox</em>** est disponible pour Linux, Windows et Mac. Sa version libre n'inclut pas la gestion des périphériques USB et ne permet pas l’utilisation du stockage persistant.
ru: **<em>VirtualBox</em>.** Существует для Linux, Windows и Mac. Бесплатная версия не поддерживает флешки и Постоянное хранилище.

source: [[See the corresponding documentation.|virtualbox]]
es: [[Ver la documentación correspondiente.|virtualbox]]
fr: [[Voir la documentation correspondante.|virtualbox]]
ru: [[См. документацию.|virtualbox]]

source: **<em>GNOME Boxes</em>** is available on Linux. It has a simple user interface but does not allow use of a Persistent Storage.
es: **<em>GNOME Boxes</em>** está disponible en Linux. Tiene una interfaz de usuario simple pero no permite el uso del Almacenamiento Persistente.
fr: **<em>GNOME Boxes</em>** est disponible pour Linux. Son interface d'utilisation est simple mais elle ne permet pas l'utilisation du stockage persistant.
ru: **<em>Боксы GNOME</em>.** Работают в Linux. У этой программы простой интерфейс, но Постоянное хранилище также недоступно.

source: [[See the corresponding documentation.|boxes]]
es: [[Ver la documentación correspondiente.|boxes]]
fr: [[Voir la documentation correspondante.|boxes]]
ru: [[См. документацию.|boxes]]

source: **<em>virt-manager</em>** is available on Linux. It has a more complex user interface and allows use of a Persistent Storage, either by:
es: **<em>virt-manager</em>** está disponible en Linux. Tiene una interfaz de usuario más compleja y permite el uso del Almacenamiento Persistente, ya sea:
fr: **<em>virt-manager</em>** est disponible pour Linux. Il a une interface d'utilisation plus complexe et permet l'utilisation du stockage persistant, soit en :
ru: **<em>Virt-manager</em>.** Доступен в Linux. Интерфейс посложнее. Virt-manager позволяет использовать Постоянное хранилище двумя способами:

source: Starting Tails from a USB stick.
fr: Démarrant Tails depuis une clé USB.
ru: при запуске Tails с флешки;

source: Creating a virtual USB storage volume saved as a single file on the host operating system.
fr: Créant un volume de stockage USB virtuel sauvegardé dans un unique fichier sur le système d'exploitation hôte.
ru: при создании виртуальной флешки в формате единственного файла в операционной системе хоста.

source: [[See the corresponding documentation.|virt-manager]]
fr: [[Voir la documentation correspondante.|virt-manager]]
ru: [[См. документацию.|virt-manager]]
