Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/advanced_topics/wireless_devices.*.po
Languages: ru

source: [[!meta title="Enabling a wireless device"]]
ru: [[!meta title="Включение беспроводного устройства"]]

source: When Tails starts, Wi-Fi, WWAN, and WiMAX devices are enabled.
ru: При запуске Tails включаются устройства Wi-Fi, WWAN и WiMAX.

source: But all other kinds of wireless devices such as Bluetooth, GPS and FM devices are disabled by default. If you want to use such a device, you need to enable it first.
ru: Прочие беспроводные устройства, в частности, Bluetooth, GPS и FM-устройства, по умолчанию отключены. Если вы хотите использовать такое устройство, сначала нужно его включить.

source: <p>If Wi-Fi is not working, see our documentation on [[troubleshooting Wi-Fi that is not working|doc/anonymous_internet/no-wifi]].</p>
ru: <p>Если wifi не работает, см. [[соответствующие рекомендации|doc/anonymous_internet/no-wifi]].</p>

source: Enable a wireless device
ru: Включение беспроводного устройства

source: This technique uses the command line.
ru: Будем использовать командную строку.

source: When starting Tails, [[set up an administration password|doc/first_steps/welcome_screen/administration_password]].
ru: При запуске Tails [[установите пароль администратора|doc/first_steps/welcome_screen/administration_password]].

source: To find out the index of the wireless device that you want to enable, open a [[root terminal|doc/first_steps/welcome_screen/administration_password#open_root_terminal]], and execute the following command:
ru: Чтобы узнать номер беспроводного устройства, которое вы хотите включить, откройте [[корневой терминал|doc/first_steps/welcome_screen/administration_password#open_root_terminal]] и выполните следующую команду:

source: For example, the command could return the following:
ru: Пример:

source: The device index is the number that appears at the beginning of the three lines describing each device. In this example, the index of the Bluetooth device is 1, while the index of the GPS device is 2. Yours are probably different.
ru: Номер устройства виден в начале строки, описывающей соответствующее устройство. Здесь номер Bluetooth-устройства — 1, GPS-устройства — 2. На вашем компьютере, вероятно, будет иначе.

source: To enable the wireless device, execute the following command in the root terminal, replacing `[index]` with the index found at step 2:
ru: Чтобы включить беспроводное устройство, выполните следующую команду в корневом терминале, заменив `[index]` нужным номером:

source: Here is an example of the command to execute. Yours is probably different:
ru: Вот что получится (у вас, вероятно, будет выглядеть иначе):

source: To verify that the wireless device is enabled, execute the following command in the root terminal again:
ru: Нужно убедиться, что беспроводное устройство включено. Снова выполните команду в корневом терминале:

source: This output should be very similar to the one of step 2, but the device enabled at step 3 should not be soft blocked anymore.
ru: Результат будет весьма похож на результат шага 2, но устройство не должно быть заблокировано.

source: Enable Bluetooth
ru: Включение Bluetooth

source: Bluetooth is not enabled by default in Tails because it is insecure when trying to protect from a local adversary.
ru: Функция Bluetooth в Tails по умолчанию отключена. Bluetooth не считается безопасным от локальной атаки.

source: XXX: one also needs to remove `sudo rm /etc/modprobe.d/no-bluetooth.conf && sudo udevadm trigger && sudo rfkill unblock bluetooth`.
ru: XXX: также нужно удалить "sudo rm /etc/modprobe.d/no-bluetooth.conf && sudo udevadm trigger && sudo rfkill unblock bluetooth`.

source: To use Bluetooth in Tails nonetheless, you have to [[set up an administration password at boot time|doc/first_steps/welcome_screen/administration_password]] and install the `gnome-bluetooth` package.
ru: Если вы всё-таки хотите использовать Bluetooth в Tails, нужно [[установить пароль администратора во время загрузки|doc/first_steps/welcome_screen/administration_password]] и установить пакет`gnome-bluetooth`.
