Repository: KaushalIngle/CuOS
Catalog: wiki/src/install/inc/steps/create_persistence.inline.*.po
Languages: fr, pt, ru

source: <h1 id="new" class="pc-clone mac-clone">Welcome to your new Tails!</h1>
pt: <h1 id="new" class="pc-clone mac-clone">Boas-vindas ao seu novo Tails!</h1>

source: <h2 id="wi-fi">Test your Wi-Fi</h2>
fr: <h2 id="wi-fi">Testez votre Wi-Fi</h2>
pt: <h2 id="wi-fi">Teste sua conexão Wi-Fi</h2>
ru: <h2 id="wi-fi">Проверьте подключение wi-fi</h2>

source: Problems with Wi-Fi are unfortunately quite common in Tails and Linux in general. To test if your Wi-Fi interface works in Tails:
fr: Les problèmes avec le Wi-Fi sont malheureusement assez courants dans Tails et avec Linux en général. Pour tester si votre interface Wi-Fi marche dans Tails :
pt: É bastante comum haver problemas com a conexão Wi-Fi em Tails e em Linux, no geral. Para testar se sua interface Wi-Fi funciona em Tails:
ru: К сожалению, проблемы с wi-fi типичны для Tails и в целом для Linux. Ниже показано, как проверить работоспособность интерфейса wi-fi в Tails.

source: Open the system menu in the top-right corner:
fr: Ouvrez le menu système dans le coin en haut à droite :
pt: Abra o menu de sistema no canto superior à direita:
ru: Откройте системное меню в правом верхнем углу.

source: Choose <span class="guilabel">Wi-Fi Not Connected</span> and then <span class="guilabel">Select Network</span>.
fr: Choisissez <span class="guilabel">Wi-Fi non connecté</span> puis <span class="guilabel">Sélectionner un réseau</span>.
pt: Escolha <span class="guilabel">Wi-Fi não conectado</span> e, em seguida, <span class="guilabel">Selecione a Rede</span>.
ru: Выберите <span class="guilabel">Wi-Fi сеть не подключена</span>, а затем <span class="guilabel">Выбрать сеть</span>.

source: After establishing a connection to a local network, the *Tor Connection* assistant appears to help you connect to the Tor network.
pt: Após estabelecer uma conexão a uma rede local, o assistente de *Conexão à rede Tor* aparecerá para te ajudar a conectar à rede Tor.

source: [[!inline pages="doc/anonymous_internet/no-wifi.inline" raw="yes" sort="age"]]
fr: [[!inline pages="doc/anonymous_internet/no-wifi.inline.fr" raw="yes" sort="age"]]
pt: [[!inline pages="doc/anonymous_internet/no-wifi.inline.pt" raw="yes" sort="age"]]
ru: [[!inline pages="doc/anonymous_internet/no-wifi.inline.ru" raw="yes" sort="age"]]

source: <p>Yay, you managed to start <span class="pc-clone mac-clone">your new</span> Tails on your computer!</p>
pt: <p>Oba, você conseguiu iniciar o <span class="pc-clone mac-clone">seu novo</span> Tails no seu computador!</p>

source: <p>If you want to save some of your documents and configuration in an encrypted storage on your <span class="clone">new</span> Tails USB stick, follow our instructions until the end. Otherwise, have a look at our <span class="windows">[[final recommendations|windows#recommendations]].</span> <span class="mac">[[final recommendations|mac#recommendations]].</span> <span class="linux">[[final recommendations|linux#recommendations]].</span> <span class="expert">[[final recommendations|expert#recommendations]].</span> <span class="pc-clone">[[final recommendations|clone#recommendations]].</span> <span class="mac-clone">[[final recommendations|clone/mac#recommendations]].</span> </p>
pt: <p>Se você quiser salvar alguns dos seus documentos e configurações em um armazenamento criptografado no seu <span class="clone">novo</span> pendrive USB com Tails, siga nossas instruções até o fim. Caso contrário, dê uma olhada nas nossas <span class="windows">[[recomendações finais|windows#recommendations]].</span> <span class="mac">[[recomendações finais|mac#recommendations]].</span> <span class="linux">[[recomendações finais|linux#recommendations]].</span> <span class="expert">[[recomendações finais|expert#recommendations]].</span> <span class="pc-clone">[[recomendações finais|clone#recommendations]].</span> <span class="mac-clone">[[recomendações finais|clone/mac#recommendations]].</span> </p>

source: <h1 id="create-persistence" class="step">Create a Persistent Storage (optional)</h1>
fr: <h1 id="create-persistence" class="step">Créer un espace de stockage persistant (optionnel)</h1>
pt: <h1 id="create-persistence" class="step">Crie um Armazenamento Persistente (opcional)</h1>
ru: <h1 id="create-persistence" class="step">Создание Постоянного хранилища (по желанию)</h1>

source: You can optionally create an encrypted Persistent Storage in the remaining free space on your <span class="clone">new</span> Tails USB stick to store any of the following:
fr: Vous pouvez éventuellement créer un stockage persistant chiffré dans l'espace libre restant de votre <span class="clone">nouvelle</span> clé USB Tails pour enregistrer l'un ou plusieurs des éléments suivants :
pt: Você pode opcionalmente criar um Armazenamento Persistente criptografado no espaço livre remanescente no seu <span class="clone">novo</span> pendrive USB Tails para armazenar quaisquer um dos seguintes:
ru: Вы можете дополнительно создать зашифрованное Постоянное хранилище в свободном месте на вашей <span class="clone">новой</span> флешке Tails и хранить там:

source: Personal files
fr: Des fichiers personnels
pt: Arquivos pessoais
ru: личные файлы;

source: Some settings
fr: Certains réglages
pt: Algumas configurações
ru: некоторые настройки;

source: Additional software
fr: Des Logiciels supplémentaires
pt: programas adicionais
ru: дополнительно установленные программы;

source: Encryption keys
fr: Des clés de chiffrement
pt: Chaves de criptografia
ru: ключи шифрования.

source: The data in the Persistent Storage:
fr: Les données dans le stockage persistant :
pt: Os dados no Armazenamento Persistente:
ru: Данные в Постоянном хранилище:

source: Remains available across separate working sessions.
fr: Restent accessibles d'une session de travail à l'autre.
pt: Permanecem disponíveis através de diferentes sessões de trabalho.
ru: остаются доступны в разных рабочих сессиях;

source: Is encrypted using a passphrase of your choice.
fr: Sont chiffrées à l'aide d'une phrase de passe de votre choix.
pt: Estão criptografados usando uma senha de sua escolha.
ru: зашифрованы паролем по вашему выбору.

source: <p>The Persistent Storage is not hidden. An attacker in possession of your USB stick can know that there is a Persistent Storage on it. Take into consideration that you can be forced or tricked to give out its passphrase.</p>
fr: <p>L'espace de stockage persistant n'est pas caché. Un adversaire qui obtiendrait votre clé USB peut savoir qu'elle contient un espace de stockage persistant. Prenez en compte que l'on pourrait vous forcer ou vous manipuler afin que vous divulguiez votre phrase de passe.</p>
pt: <p>O Armazenamento Persistente não fica escondido. Um atacante em posse do seu pendrive USB consegue saber se existe um Armazenamento Persistente nele. Tenha em mente que alguém pode te forçar ou te enganar para conseguir a senha.</p>
ru: <p>Постоянное хранилище не является скрытым. Если злоумышленник получит доступ к вашей флешке, он может узнать, что на ней есть Постоянное хранилище. Злоумышленник может получить пароль мошенническим или насильственным способом.</p>

source: <p>It is possible to unlock the Persistent Storage from other operating systems. But, doing so might compromise the security provided by Tails.</p>
fr: <p>Il est possible de déverrouiller le stockage persistant depuis d'autres systèmes d'exploitation, mais cela peut nuire à la sécurité fournie par Tails.</p>
pt: <p>É possível abrir o Armazenamento Persistente a partir de outros sistemas operacionais. Porém, fazê-lo pode acabar comprometendo a segurança oferecida pelo Tails.</p>
ru: <p>Постоянное хранилище можно разблокировать из других операционных систем, но это снизит уровень безопасности, который обеспечивает Tails.</p>

source: <p>For example, image thumbnails might be created and saved by the other operating system. Or, the contents of files might be indexed by the other operating system.</p>
fr: <p>Par exemple, des miniatures d'images pourraient être crées et sauvegardées par l'autre système d'exploitation. Ou le contenu de fichiers pourrait être indexé par l'autre système.</p>
pt: <p>Por exemplo, miniaturas de imagens podem ser criadas e salvas por outro sistema operacional. Ou, os conteúdos de arquivos podem ser indexados por outro sistema operacional.</p>
ru: <p>Например, другая операционная система может создать картинки-миниатюры или проиндексировать файлы.</p>

source: <p>Other operating systems should probably not be trusted to handle sensitive information or leave no trace.</p>
fr: <p>Les autres systèmes d'exploitation ne doivent certainement pas être considérés de confiance pour manipuler des données sensibles ou ne pas laisser de traces.</p>
pt: <p>Você provavelmente não deve confiar em outros sistemas operacionais para manipular informações sensíveis ou para não deixar rastros.</p>
ru: <p>Возможно, стоит позаботиться о том, чтобы важные данные не попадали в другую операционную систему. Или предпринять меры для удаления следов работы.</p>

source: Create the Persistent Storage
fr: Créer un espace de stockage persistant
pt: Crie o Armazenamento Persistente
ru: Создание Постоянного хранилища

source: 1. Choose <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Tails</span>&nbsp;▸ <span class="guimenuitem">Configure persistent volume</span></span>.
pt: 1. Selecione <span class="menuchoice"> <span class="guimenu">Aplicativos</span>&nbsp;▸ <span class="guisubmenu">Tails</span>&nbsp;▸ <span class="guimenuitem">Configuração do volume persistente</span></span>.

source: 1. Specify a passphrase of your choice in both the <span class="guilabel">Passphrase</span> and <span class="guilabel">Verify Passphrase</span> text boxes.
fr: 1. Entrer la phrase de passe que vous aurez choisi dans les cases <span class="guilabel">Phrase de passe</span> et <span class="guilabel">Vérification de la phrase de passe</span>.
pt: 1. Especifique uma senha de sua escolha tanto no campo <span class="guilabel">Senha</span> quanto no campo <span class="guilabel">Verificar Senha</span>.
ru: 1. Придумайте пароль и укажите его в полях <span class="guilabel">Passphrase</span> и <span class="guilabel">Verify Passphrase</span>.

source: <div class="tip"> <p>We recommend choosing a long passphrase made of five to seven random words. <a href="https://theintercept.com/2015/03/26/passphrases-can-memorize-attackers-cant-guess/">See this article about memorizable and secure passphrases.</a></p> </div>
pt: <div class="tip"> <p>Nós recomendamos que você escolha uma senha longa de cinco a sete palavras aleatórias. <a href="https://theintercept.com/2015/03/26/passphrases-can-memorize-attackers-cant-guess/">Veja este artigo sobre senhas memorizáveis e seguras (em inglês).</a></p> </div>

source: Click on the <span class="guilabel">Create</span> button.
fr: Cliquez sur le bouton <span class="guilabel">Création</span>.
pt: Clique no botão <span class="guilabel">Criar</span>.
ru: Нажмите кнопку <span class="guilabel">Create</span> (создать).

source: Wait for the creation to finish.
fr: Attendez que la création se termine.
pt: Aguarde a criação terminar.
ru: Подождите окончания процесса.

source: The list of features of the Persistent Storage appears. Each feature corresponds to a set of files or settings that can be saved in the Persistent Storage.
fr: La liste des options du stockage persistant apparaît. Chaque option correspond à un ensemble de fichiers ou de réglages qui peuvent être enregistrés dans le stockage persistant.
pt: A lista de funcionalidades do Armazenamento Persistente aparecerá. Cada recurso corresponde a um conjunto de arquivos ou configurações que podem ser salvos no Armazenamento Persistente.
ru: Появится окно с опциями Постоянного хранилища. Каждая опция соответствует набору файлов или настроек, которые могут храниться в Постоянном хранилище.

source: We recommend you to only turn on the Personal Data feature for the time being. You can turn on more features later on according to your needs.
fr: Nous vous recommandons d'activer uniquement la fonction Données personnelles pour l'instant. Vous pouvez en activer d'autres plus tard en fonction de vos besoins.
pt: Recomendamos que você ative apenas o recurso de Dados Pessoais por enquanto. Você pode ativar mais recursos depois de acordo com suas necessidades.
ru: Советуем для начала включать только опцию Personal Data (персональные данные). По мере надобности вы сможете включить другие опции.

source: Click <span class="bold">Save</span>.
fr: Cliquez sur <span class="bold">Sauvegarder</span>.
pt: Clique em <span class="bold">Salvar</span>.
ru: Для сохранения нажмите <span class="bold">Save</span>.

source: Restart and unlock the Persistent Storage
fr: Redémarrer et déverrouiller l'espace de stockage persistant
pt: Reinicie e desbloqueie o Armazenamento Persistente
ru: Перезагрузка и разблокирование Постоянного хранилища

source: Shut down the computer and restart on your <span class="clone">new</span> Tails USB stick.
fr: Éteignez l'ordinateur et redémarrez sur la <span class="clone">nouvelle</span> clé USB Tails.
pt: Desligue o computador e reinicie-o na sua <span class="clone">nova</span> memória USB com Tails.
ru: Выключите компьютер и загрузите его со своей <span class="clone">новой</span> флешки Tails.

source: In the Welcome Screen:
fr: Dans l'écran de bienvenue :
pt: Na Tela de Boas-Vindas:
ru: На экране приветствия выполните несколько шагов.

source: [[!img install/inc/screenshots/welcome_screen_with_persistence.png link="no" alt="Welcome to Tails!"]]
fr: [[!img install/inc/screenshots/welcome_screen_with_persistence.png link="no" alt="Bienvenue dans Tails !"]]
pt: [[!img install/inc/screenshots/welcome_screen_with_persistence.png link="no" alt="Boas-vindas ao Tails!"]]
ru: [[!img install/inc/screenshots/welcome_screen_with_persistence.png link="no" alt="Добро пожаловать в Tails!"]]

source: Select your language and keyboard layout in the <span class="guilabel">Language & Region</span> section.
fr: Sélectionnez votre langue et votre disposition de clavier dans la section <span class="guilabel">Langue et région</span>.
pt: Escolha sua língua e configuração de teclado na seção <span class="guilabel">Língua & Região</span>.
ru: Выберите язык и раскладку клавиатуры в разделе <span class="guilabel">Language & Region</span>.

source: In the **Encrypted Persistent Storage** section, enter your passphrase and click **Unlock** to unlock the Persistent Storage for the current working session.
fr: Dans la section **Stockage persistant chiffré**, entrez votre phrase de passe et cliquez sur **Déverrouiller** pour activer le stockage persistant pour la session de travail en cours.
pt: Na seção **Armazenamento Persistente criptografado**, introduza sua senha e clique **Desbloquear** para desbloquear o Armazenamento Persistente para a sessão atual.
ru: В разделе **Encrypted Persistent Storage** (зашифрованное Постоянное хранилище) введите пароль и нажмите **Unlock**, чтобы разблокировать Постоянное хранилище для текущей рабочей сессии.

source: Click <span class="bold">Start Tails</span>.
fr: Cliquez sur <span class="bold">Démarrer Tails</span>.
pt: Clique em <span class="bold">Iniciar Tails</span>.
ru: Нажмите <span class="bold">Start Tails</span>.

source: After 15&ndash;30 seconds, the Tails desktop appears.
fr: Après 15&ndash;30 secondes, le bureau de Tails apparaît.
pt: Após 15&ndash;30 segundos, a área de trabalho do Tails aparece.
ru: Через 15&ndash;30 секунд появится рабочий стол Tails.

source: 1. You can now save your personal files and working documents in the <span class="guilabel">Persistent</span> folder. To open the <span class="guilabel">Persistent</span> folder choose <span class="menuchoice"> <span class="guimenu">Places</span>&nbsp;▸ <span class="guimenuitem">Persistent</span></span>.
pt: 1. Você pode agora salvar seus arquivos pessoais e documentos de trabalho no diretório <span class="guilabel">Persistent</span>. Para abrir o diretório <span class="guilabel">Persistent</span> selecione <span class="menuchoice"> <span class="guimenu">Locais</span>&nbsp;▸ <span class="guimenuitem">Persistent</span></span>.

source: <div class="state-image">[[!img install/inc/infography/tails-usb-with-persistence.png link="no" alt="Tails USB stick with Persistent Storage"]]</div>
fr: <div class="state-image">[[!img install/inc/infography/tails-usb-with-persistence.fr.png link="no" alt="Clé USB Tails avec stockage persistant"]]</div>
pt: <div class="state-image">[[!img install/inc/infography/tails-usb-with-persistence.png link="no" alt="Pendrive USB Tails com Armazenamento Persistente"]]</div>
ru: <div class="state-image">[[!img install/inc/infography/tails-usb-with-persistence.png link="no" alt="Флешка Tails с Постоянным хранилищем"]]</div>

source: <p>You now have a complete Tails, congrats!</p>
fr: <p>Félicitations ! Vous avez maintenant un Tails complet.</p>
pt: <p>Agora você tem um Tails completinho, parabéns!</p>
ru: <p>Теперь у вас Tails в полном объёме, поздравляем!</p>

source: <h3>Final recommendations</h3>
fr: <h3>Dernières recommandations</h3>
pt: <h3>Recomendações finais</h3>
ru: <h3>Заключительные рекомендации</h3>

source: <p>You should regularly [[make a backup of your Persistent Storage|doc/first_steps/persistence/backup]] in case your Tails USB stick becomes lost or damaged.</p>
fr: <p>Nous vous conseillons de faire régulièrement [[une copie de sauvegarde de votre stockage persistant|doc/first_steps/persistence/backup]] au cas où vous perdiez ou endommagiez votre clé USB Tails .</p>
pt: <p>Você deve periodicamente [[fazer um backup do seu Armazenamento Persistente|doc/first_steps/persistence/backup]] para os casos de perda ou dano do seu pendrive USB com Tails.</p>

source: <p>We hope you enjoy using Tails :)</p>
fr: <p>Nous espérons que vous apprécierez Tails :)</p>
pt: <p>Esperamos que você goste de usar o Tails :)</p>
ru: <p>Надеемся, вам понравится Tails :)</p>
