Repository: KaushalIngle/CuOS
Catalog: wiki/src/install/inc/steps/install_with_gnome_disks.inline.*.po
Languages: fr, pt, ru

source: Start <span class="application">GNOME Disks</span> (also called <span class="application">Disks</span>).
fr: Démarrer <span class="application">GNOME Disks</span> (également appelé <span class="application">Disques</span>).
pt: Inicie o <span class="application">GNOME Disks</span> (também chamado de <span class="application">Discos</span>).
ru: Запустите программу <span class="application">Диски</span> (также <span class="application">GNOME Disks</span>).

source: <div class="linux"> For example, you can press the <span class="keycap">Super</span> key, then type <span class="command">disk</span>, then choose <span class="application">Disks</span>. </div> <div class="upgrade"> Choose <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Utilities</span>&nbsp;▸ <span class="guimenuitem">Disks</span></span>. </div>
pt: <div class="linux"> Por exemplo, você pode pressionar a tecla <span class="keycap">Super</span>, escrever <span class="command">disco</span>, e então escolher <span class="application">Discos</span>. </div> <div class="upgrade"> Escolha <span class="menuchoice"> <span class="guimenu">Aplicativos</span>&nbsp;▸ <span class="guisubmenu">Utilitários</span>&nbsp;▸ <span class="guimenuitem">Discos</span></span>. </div>

source: Plug in the <span class="upgrade">intermediary</span> USB stick <span class="linux">on which you want to install Tails</span>.
fr: Brancher la clé USB <span class="upgrade">intermédiaire</span> <span class="linux">sur laquelle vous voulez installer Tails</span>.
pt: Conecte o pendrive USB <span class="upgrade">intermediário</span> <span class="linux">no qual você deseja instalar o Tails</span>.
ru: Подключите <span class="upgrade">«промежуточную»</span> флешку, <span class="linux">на которую хотите установить Tails</span>.

source: <div class="caution"><p>All the data on this USB stick will be lost.</p></div>
fr: <div class="caution"><p>Toutes les données sur cette clé USB seront perdues.</p></div>
pt: <div class="caution"><p>Todos os dados nesse pendrive USB serão perdidos.</p></div>
ru: <div class="caution"><p>Все данные на этой флешке будут потеряны.</p></div>

source: <div class="note upgrade"><p>The Persistent Storage of your Tails USB stick will not be copied to the temporary Tails.</p></div>
fr: <div class="note upgrade"><p>Le stockage persistant de votre clé USB Tails ne sera pas copié dans le Tails temporaire.</p></div>
pt: <div class="note upgrade"><p>O Armazenamento Persistente do seu pendrive USB com Tails não será copiado para o Tails temporário.</p></div>
ru: <div class="note upgrade"><p>Постоянное хранилище на вашей флешке Tails не будет перенесено во временную копию Tails.</p></div>

source: A new drive appears in the left pane. Click on it.
fr: Un nouveau périphérique apparaît dans le panneau gauche. Cliquer dessus.
pt: Um novo dispositivo aparecerá no painel esquerdo. Clique nele.
ru: На левой панели появится новый диск. Нажмите на него.

source: Click on the [[!img lib/view-more.png alt="Menu" class="symbolic" link="no"]] button in the titlebar and choose <span class="guimenuitem">Restore Disk Image&hellip;</span>.
pt: Clique no botão [[!img lib/view-more.png alt="Menu" class="symbolic" link="no"]] na barra de título e escolha <span class="guimenuitem">Restaurar Imagem de Disco&hellip;</span>.

source: In the <span class="guilabel">Restore Disk Image</span> dialog, click on the file selector button.
fr: Dans la fenêtre <span class="guilabel">Restaurer l'image disque</span>, cliquer sur le bouton de sélection de fichier.
pt: Na tela <span class="guilabel">Restaurar Imagem de disco</span>, clique no botão para selecionar um arquivo.
ru: В диалоге <span class="guilabel">Восстановить образ диска</span> нажмите на выбор файла.

source: Choose the USB image that you downloaded earlier.
fr: Choisir l'image USB que vous avez téléchargé précédemment.
pt: Escolha a imagem USB que você baixou anteriormente.
ru: Выберите скачанный ранее USB-образ.

source: <div class="note"> <p>Make sure that the USB image has an <span class="filename">.img</span> file extension.</p>
fr: <div class="note"> <p>Assurez-vous que l'image USB a une extension de fichier <span class="filename">.img</span>.</p>
pt: <div class="note"> <p>Tenha certeza de que a imagem USB possui a extensão <span class="filename">.img</span>.</p>
ru: <div class="note"> <p>Убедитесь, что USB-образ имеет файловое расширение <span class="filename">.img</span>.</p>

source: <p>If the image has an <i>.iso</i> file extension, it is not the correct image. Please go back to the <span class="linux">[[download step|linux#download]].</span> <span class="upgrade-tails">[[download step|upgrade/tails#download]].</span> <span class="upgrade-linux">[[download step|upgrade/linux#download]].</span></p> </div>
pt: <p>Caso a imagem tenha extensão <i>.iso</i>, não é a imagem correta. Por favor, volte para o <span class="linux">[[passo de download|linux#download]].</span> <span class="upgrade-tails">[[passo de download|upgrade/tails#download]].</span> <span class="upgrade-linux">[[passo de download|upgrade/linux#download]].</span></p> </div>

source: Click on the <span class="bold">Start Restoring&hellip;</span> button.
fr: Cliquer sur le bouton <span class="bold">Démarrer la restauration&hellip;</span>.
pt: Clique no botão <span class="bold">Iniciar Restauração&hellip;</span>.
ru: Нажмите кнопку <span class="bold">Начать восстановление&hellip;</span> (Start Restoring).

source: In the confirmation dialog click <span class="bold">Restore</span>.
fr: Dans la fenêtre de confirmation cliquer sur <span class="bold">Restaurer</span>.
pt: Na tela de confirmação clique em <span class="bold">Restaurar</span>.
ru: В диалоговом окне для подтверждения нажмите <span class="bold">Восстановить</span> (Restore).

source: Depending on your Linux distribution, you might be asked for your administration password.
fr: Suivant votre distribution Linux, il peut vous être demandé votre mot de passe d'administration.
pt: Dependendo da sua distribuição Linux, talvez você tenha que inserir sua senha de administrador.
ru: В зависимости от вашей сборки Linux вас могут попросить ввести пароль администратора.

source: The installation takes a few minutes.
fr: L'installation prend quelques minutes.
pt: A instalação demora alguns minutos.
ru: Установка занимает несколько минут.

source: After the installation is finished, click on the [[!img lib/media-eject.png alt="Eject" class="symbolic" link="no"]] button.
fr: Une fois l'installation terminée, cliquer sur le bouton [[!img lib/media-eject.png alt="Éjecter" class="symbolic" link="no"]].
pt: Após o término da instalação, clique no botão [[!img lib/media-eject.png alt="Ejetar" class="symbolic" link="no"]].
ru: После окончания установки нажмите кнопку [[!img lib/media-eject.png alt="Извлечь" class="symbolic" link="no"]].
