Repository: KaushalIngle/CuOS
Catalog: wiki/src/install/inc/steps/install_etcher_*_mac.inline.*.po
Languages: fr

source: <a href="https://tails.boum.org/etcher/Etcher.dmg" class="button">Download balenaEtcher for macOS</a>
fr: <a href="https://tails.boum.org/etcher/Etcher.dmg" class="button">Télécharger balenaEtcher pour macOS</a>

source: Open the <span class="application">balenaEtcher</span> download (DMG disk image).
fr: Ouvrez le fichier <span class="application">balenaEtcher</span> téléchargé (image disque DMG).

source: To install <span class="application">balenaEtcher</span>, drag the <span class="application">balenaEtcher</span> icon onto the <span class="guilabel">Applications</span> icon.
fr: Pour installer <span class="application">balenaEtcher</span>, faites glisser l'icône <span class="application">balenaEtcher</span> sur l’icône <span class="guilabel">Applications</span>.

source: Close the installation window of <span class="application">balenaEtcher</span>.
fr: Fermez la fenêtre d'installation de <span class="application">balenaEtcher</span>.

source: Optionally, eject the <span class="application">balenaEtcher</span> disk image from the desktop.
fr: Optionnellement, éjectez l'image disque <span class="application">balenaEtcher</span> depuis le bureau.

source: Instead of installing <span class="application">balenaEtcher</span>, you can also [[!toggle id="dd" text="install Tails using `dd` on the command line"]].
fr: Plutôt que d'installer <span class="application">balenaEtcher</span>, vous pouvez aussi [[!toggle id="dd" text="installer Tails avec `dd` en ligne de commande"]].

source: Make sure that your USB stick is unplugged.
fr: Assurez-vous que votre clé USB soit débranchée.

source: Execute the following command:
fr: Exécuter la commande suivante :

source: It returns a list of the storage devices on the system. For example:
fr: Cela affiche la liste des périphériques de stockage. Par exemple :

source: Plug your USB stick in the computer.
fr: Branchez votre clé USB sur l'ordinateur.

source: Execute again the same command:
fr: Exécutez à nouveau la même commande :

source: Your USB stick appears as a new device in the list. Check that its size corresponds to the size of your USB stick.
fr: Votre clé USB apparaît comme un nouveau périphérique dans la liste. Vérifiez si sa taille correspond à la taille de votre clé USB.

source: <p class="pre command-output">/dev/disk0 #: TYPE NAME SIZE IDENTIFIER 0: GUID_partition_scheme &lowast;500.1 GB disk0 1: EFI 209.7 MB disk0s1 2: Apple_HFS MacDrive 250.0 GB disk0s2 3: EFI 134.1 GB disk0s3 4: Microsoft Basic Data BOOTCAMP 115.5 GB disk0s4 /dev/disk1 #: TYPE NAME SIZE IDENTIFIER 0: FDisk_partition_scheme *8.0 GB disk1 1: Apple_HFS Untitled 1 8.0 GB disk1s1</p>
fr: <p class="pre command-output">/dev/disk0 #: TYPE NAME SIZE IDENTIFIER 0: GUID_partition_scheme &lowast;500.1 Go disk0 1: EFI 209.7 Mo disk0s1 2: Apple_HFS MacDrive 250.0 Go disk0s2 3: EFI 134.1 Go disk0s3 4: Microsoft Basic Data BOOTCAMP 115.5 Go disk0s4 /dev/disk1 #: TYPE NAME SIZE IDENTIFIER 0: FDisk_partition_scheme *8.0 Go disk1 1: Apple_HFS Untitled 1 8.0 Go disk1s1</p>

source: Take note of the *device name* of your USB stick. In this example, the USB stick is 8.0 GB and its device name is <span class="code">/dev/disk1</span>. Yours might be different.
fr: Notez le *nom de périphérique* de votre clé USB. Dans cet exemple, la clé USB a 8.0 GB et son nom de périphérique est <span class="code">/dev/disk1</span>. Le nom de la votre peut être différent.

source: <div class="caution"> <p>If you are unsure about the device name, you should stop proceeding or <strong>you risk overwriting any hard disk on the system</strong>.</p> </div>
fr: <div class="caution"> <p>Si vous n'avez pas la certitude d'avoir le bon nom de périphérique, vous devriez ne pas poursuivre ou <strong>vous risquez d'écraser les données d'un disque dur de votre système</strong>.</p> </div>

source: Execute the following commands to copy the USB image that you downloaded earlier to the USB stick.
fr: Exécutez les commandes suivantes pour copier sur la clé USB l'image USB que vous avez téléchargée précédemment.

source: Replace:
fr: Remplacer :

source: <span class="command-placeholder">tails.img</span> with the path to the USB image
fr: <span class="command-placeholder">tails.img</span> par le chemin vers l'image USB

source: <div class="tip"> <p>If you are unsure about the path to the USB image, you can insert the correct path by dragging and dropping the icon of the USB image from <span class="application">Finder</span> onto <span class="application"> Terminal</span>.</p> </div>
fr: <div class="tip"> <p>Si vous n'êtes pas sûr du chemin de l’image USB, vous pouvez insérer le bon chemin en faisant glisser-déposer l’icône de l'image USB depuis <span class="application">Finder</span> vers <span class="application"> Terminal</span>.</p> </div>

source: <span class="command-placeholder">device</span> with the device name found in step 6
fr: <span class="command-placeholder">périphérique</span> par le nom de périphérique trouvé à l'étape 6

source: <div class="tip"> <p>You can try adding <span class="code">r</span> before <span class="code">disk</span> to make the installation faster.</p> </div>
fr: <div class="tip"> <p>Vous pouvez essayer d'ajouter <span class="code">r</span> avant <span class="code">disk</span> pour rendre l'installation plus rapide.</p> </div>

source: <p class="pre command">diskutil unmountDisk <span class="command-placeholder">device</span></p>
fr: <p class="pre command">diskutil unmountDisk <span class="command-placeholder">périphérique</span></p>

source: <p class="pre command">dd if=<span class="command-placeholder">tails.img</span> of=<span class="command-placeholder">device</span> bs=16m && sync</p>
fr: <p class="pre command">dd if=<span class="command-placeholder">tails.img</span> of=<span class="command-placeholder">périphérique</span> bs=16m && sync</p>

source: You should get something like this:
fr: Vous devriez obtenir quelque chose comme :

source: If no error message is returned, Tails is being copied on the USB stick. The copy takes some time, generally a few minutes.
fr: Si aucun message d'erreur n'est renvoyé, Tails est en train d'être copié sur la clé USB. La copie prend du temps, généralement quelques minutes.

source: <div class="note"> <p>If you get a <span class="guilabel">Permission denied</span> error, try adding <code>sudo</code> at the beginning of the command:</p>
fr: <div class="note"> <p>Si vous obtenez une erreur <span class="guilabel">Permission denied</span>, essayer d'ajouter <code>sudo</code> au début de la ligne de commande :</p>

source: <p class="pre command">sudo dd if=<span class="command-placeholder">tails.img</span> of=<span class="command-placeholder">device</span> bs=16m && sync</p>
fr: <p class="pre command">sudo dd if=<span class="command-placeholder">tails.img</span> of=<span class="command-placeholder">périphérique</span> bs=16m && sync</p>

source: <p class="pre command">dd if=<span class="command-placeholder">tails.img</span> of=<span class="command-placeholder">device</span> bs=16M && sync</p>
fr: <p class="pre command">dd if=<span class="command-placeholder">tails.img</span> of=<span class="command-placeholder">périphérique</span> bs=16M && sync</p>

source: The installation is complete once the command prompt reappeared.
fr: L'installation est terminée quand l'invite de commande réapparaît.
