Repository: KaushalIngle/CuOS
Catalog: wiki/src/install/inc/steps/install_with_etcher.inline.*.po
Languages: pt

source: <p class="mac upgrade-mac"> Open <span class="application">Finder</span> and choose <span class="application">balenaEtcher</span> in <span class="guilabel">Applications</span>. </p>
pt: <p class="mac upgrade-mac">Abra o <span class="application">Finder</span> e escolha <span class="application">balenaEtcher</span> nos <span class="guilabel">Aplicativos</span>.</p>

source: <p class="windows upgrade-windows"> Open the <span class="application">balenaEtcher</span> download. </p>
pt: <p class="windows upgrade-windows"> Abra o download do <span class="application">balenaEtcher</span>. </p>

source: At the security warning, confirm that you want to open <span class="application">balenaEtcher</span>.
pt: No aviso de segurança, confirme que você quer abrir o <span class="application">balenaEtcher</span>.

source: <span class="application">balenaEtcher</span> starts.
pt: <span class="application">balenaEtcher</span> iniciará.

source: <h1 id="install" class="step">Install <span class="upgrade">an intermediary</span> Tails using <em>balenaEtcher</em></h1>
pt: <h1 id="install" class="step">Instale um Tails <span class="upgrade">intermediário</span> usando <em>balenaEtcher</em></h1>

source: Plug in the USB stick on which you want to install <span class="usb">Tails.</span> <span class="upgrade">the intermediary Tails.</span>
pt: Insira o pendrive USB no qual você deseja instalar <span class="usb">Tails.</span> <span class="upgrade">o Tails intermediário.</span>

source: <div class="note upgrade"><p>The Persistent Storage of your Tails USB stick will not be copied to the temporary Tails.</p></div>
pt: <div class="note upgrade"><p>O Armazenamento Persistente do seu pendrive USB com Tails não será copiado para o Tails temporário.</p></div>

source: Click the **Flash from file** button.
pt: Clique no botão **Flash from file** (gravar à partir de arquivo, em inglês).

source: Choose the USB image that you downloaded earlier.
pt: Escolha a imagem USB que você baixou anteriormente.

source: <div class="note"> <p>Make sure that the USB image has an <span class="filename">.img</span> file extension.</p>
pt: <div class="note"> <p>Tenha certeza de que a imagem USB possui a extensão <span class="filename">.img</span>.</p>

source: <p>If the image has an <i>.iso</i> file extension, it is not the correct image. Please go back to the <span class="windows">[[download step|windows#download]].</span> <span class="mac">[[download step|mac#download]].</span> <span class="upgrade-windows">[[download step|upgrade/windows#download]].</span> <span class="upgrade-mac">[[download step|upgrade/mac#download]].</span></p> </div>
pt: <p>Se a imagem tiver uma extensão <i>.iso</i>, ela não é a imagem correta. Por favor volte para a <span class="windows">[[etapa de download|windows#download]].</span> <span class="mac">[[etapa de download|mac#download]].</span> <span class="upgrade-windows">[[etapa de download|upgrade/windows#download]].</span> <span class="upgrade-mac">[[etapa de download|upgrade/mac#download]].</span></p> </div>

source: Click the **Select target** button to select your USB stick.
pt: Clique no botão **Select target** (escolher alvo, em inglês) para escolher o seu pendrive USB.

source: <div class="caution"><p>All the data on this USB stick will be lost.</p></div>
pt: <div class="caution"><p>Todos os dados nesse pendrive USB serão perdidos.</p></div>

source: Click <span class="bold">Flash</span>.
pt: Clique em <span class="bold">Flash</span>.

source: Enter your password if you are asked for it.
pt: Insira sua senha caso seja solicitado.

source: The installation takes a few minutes.
pt: A instalação demora alguns minutos.

source: After installing Tails, <span class="application">balenaEtcher</span> verifies the installation.
pt: Após instalar Tails, o <span class="application">balenaEtcher</span> verificará a instalação.

source: <div class="bug"> <p>If the verification of <span class="application">balenaEtcher</span> fails, try to install again or try using a different USB stick.</p> </div>
pt: <div class="bug"> <p>Se a verificação do <span class="application">balenaEtcher</span> falhar, tente instalar novamente, ou tente usar outro pendrive USB.</p> </div>

source: Close <span class="application">balenaEtcher</span>.
pt: Feche o <span class="application">balenaEtcher</span>.

source: <p class="mac upgrade-mac"> If a notification about the USB stick not being readable appears, click <span class="bold">Eject</span> to eject the USB stick. </p>
pt: <p class="mac upgrade-mac"> Caso apareça uma notificação sobre o pendrive USB não ser legível, clique em <span class="bold">Ejetar</span> para ejetar o pendrive USB. </p>
