Repository: KaushalIngle/CuOS
Catalog: wiki/src/install/inc/steps/mac_startup_disks.inline.*.po
Languages: ru

source: Shut down the computer while leaving the USB stick plugged in.
ru: Выключите компьютер, но оставьте флешку подключённой.

source: Plug in the other Tails USB stick that you want to install from.
ru: Подключите другую флешку Tails, с которой вы хотите выполнить установку.

source: [[!img install/inc/screenshots/mac_option_key.png link="no" alt="'Option' or 'alt' key in the bottom left of Mac keyboard"]]
ru: [[!img install/inc/screenshots/mac_option_key.png link="no" alt="Клавиша 'Option' или 'alt' в левом нижнем углу клавиатуры Mac"]]

source: Choose the USB stick and press <span class="keycap">Enter</span>. The USB stick appears as an external hard disk and might be labeled <span class="guilabel">EFI Boot</span> or <span class="guilabel">Windows</span> like in the following screenshot:
ru: Выберите флешку и нажмите <span class="keycap">Enter</span>. Флешка выглядит в списке как внешний жёсткий диск и может называться <span class="guilabel">EFI Boot</span> или <span class="guilabel">Windows</span>, как на этом скриншоте:

source: [[!img install/inc/screenshots/mac_startup_usb.png link="no" alt="Screen with the logo of an internal hard disk labeled 'Macintosh HD' and an external hard disk labelled 'Windows' (selected)"]]
ru: [[!img install/inc/screenshots/mac_startup_usb.png link="no" alt="Экран с изображением внутреннего диска 'Macintosh HD' и внешнего жёсткого диска 'Windows' (выбран)"]]

source: If the USB stick does not appear in the list of startup disks:
ru: Если флешки нет в списке загрузочных дисков:

source: [[!inline pages="install/inc/steps/basic_troubleshooting.inline" raw="yes" sort="age"]]
ru: [[!inline pages="install/inc/steps/basic_troubleshooting.inline.ru" raw="yes" sort="age"]]

source: If your computer still does not display the Boot Loader, it might currently be impossible to start Tails on your computer.
ru: Если на компьютере по-прежнему не виден список вариантов загрузки, возможно, на этом компьютере в принципе нельзя запустить Tails.

source: If your Mac displays the following error:
ru: Ваш компьютер может показать следующую ошибку:

source: Then you have to change the settings of the <em>Startup Security Utility</em> of your Mac to authorize starting from Tails.
ru: Вам следует изменить настройки безопасности с помощью <em>Startup Security Utility</em>, чтобы можно было загрузить Tails.

source: To open <em>Startup Security Utility</em>:
ru: Запускаем <em>Startup Security Utility</em>.

source: When you are asked to authenticate, click <strong>Enter macOS Password</strong>, then choose an administrator account and enter its password.
ru: Если видите требование об аутентификации, нажмите <strong>Ввести пароль для macOS</strong>, выберите учётную запись администратора и введите пароль к ней.

source: [[!img install/inc/screenshots/startup-security-utility.png link="no" alt="Startup Security Utility"]]
ru: [[!img install/inc/screenshots/startup-security-utility.png link="no" alt="Утилита безопасной загрузки"]]

source: In the <em>Startup Security Utility</em>:
ru: В <em>Утилите безопасной загрузки</em>:

source: Choose <strong>No Security</strong> in the <strong>Secure Boot</strong> section.
ru: в разделе <strong>Безопасная загрузка</strong> выберите <strong>Функции безопасности отключены</strong>;

source: Choose <strong>Allow booting from external media</strong> in the <strong>External Boot</strong>.
ru: в разделе <strong>Загрузка с внешнего носителя</strong> выберите <strong>Разрешить загрузку с внешних носителей</strong>.

source: To still protect your Mac from starting on untrusted external media, you can set a firmware password, available on macOS Mountain Lion or later. A firmware password prevents users who do not have the password from starting up from any media other than the designated startup disk.
ru: Чтобы по-прежнему защитить ваш Mac от загрузки с сомнительных внешних носителей, можно установить пароль прошивки. Эта функция доступна в macOS версии Mountain Lion или более свежей. Тот, у кого нет пароля прошивки, сможет запустить систему только с жёсткого диска по умолчанию.

source: <strong>If you forget your firmware password you will require an in-person service appointment with an Apple Store or Apple Authorized Service Provider.</strong>
ru: <strong>Если забудете пароль прошивки, вам придётся лично обращаться за помощью в магазин Apple Store или к авторизованному провайдеру услуг Apple.</strong>

source: Read more on Apple Support about:
ru: Техподдержка Apple предлагает дополнительную информацию.

source: <a href="https://support.apple.com/en-us/HT208198">Startup Security Utility</a>
ru: <a href="https://support.apple.com/ru-ru/HT208198">Утилита безопасной загрузки</a>

source: <a href="https://support.apple.com/en-us/HT204455">How to set a firmware password on your Mac</a>
ru: <a href="https://support.apple.com/ru-ru/HT204455">Установка пароля прошивки на компьютере Mac</a>

source: If the computer starts on Tails, the Boot Loader appears and Tails starts automatically after 4 seconds.
ru: Если компьютер загружается с Tails, появится загрузчик, и Tails запустится автоматически через 4 секунды.

source: [[!img install/inc/screenshots/grub.png link="no" alt="Black screen ('GNU GRUB') with Tails logo and 2 options: 'Tails' and 'Tails (Troubleshooting Mode)'."]]
ru: [[!img install/inc/screenshots/grub.png link="no" alt="Чёрный экран ('GNU GRUB') с логотипом Tails и двумя опциями: 'Tails' и 'Tails (Troubleshooting Mode)'."]]
