Repository: KaushalIngle/CuOS
Catalog: wiki/src/install/inc/steps/verify.inline.*.po
Languages: fr

source: Verify your download
fr: Vérifier votre téléchargement

source: Verify your download to make sure that it is safe and was not corrupted during download.
fr: Vérifier le téléchargement permet de s'assurer qu'il est sûr et qu'il n'a pas été corrompu au cours du téléchargement.

source: Your BitTorrent client will automatically verify your download when it completes.
fr: Votre client BitTorrent va automatiquement vérifier votre téléchargement lorsqu'il sera terminé.

source: The verification below is optional for a BitTorrent download.
fr: La vérification ci-dessous est optionnelle pour un téléchargement par BitTorrent.

source: You seem to have JavaScript disabled. To verify your download, you can either:
fr: Il semble que vous ayez désactivé JavaScript. Pour vérifier votre téléchargement, vous pouvez soit :

source: Enable JavaScript and reload this page.
fr: Activer JavaScript et recharger la page.

source: Compare manually the checksum of your download with [[the checksum of our images|install/v2/Tails/amd64/stable/latest.json]].
fr: Comparer manuellement la somme de contrôle de votre téléchargement avec [[celles de nos images|install/v2/Tails/amd64/stable/latest.json]].

source: See our documentation on [[calculating checksums using GtkHash|doc/encryption_and_privacy/checksums]].
fr: Voir notre documentation sur [[le calcul des sommes de contrôle avec GtkHash|doc/encryption_and_privacy/checksums]].

source: Verify your download using our [[OpenPGP signing key|tails-signing.key]] and <span class="usb upgrade download-only-img"><a href="[[!inline pages="inc/stable_amd64_img_sig_url" raw="yes" sort="age"]]">OpenPGP signature</a>.</span> <span class="dvd vm download-only-iso"><a href="[[!inline pages="inc/stable_amd64_iso_sig_url" raw="yes" sort="age"]]">OpenPGP signature</a>.</span>
fr: Vérifier votre téléchagement à l'aide de notre [[clé de signature OpenPGP|tails-signing.key]] et <span class="usb upgrade download-only-img"><a href="[[!inline pages="inc/stable_amd64_img_sig_url" raw="yes" sort="age"]]">signature OpenPGP</a></span> <span class="dvd vm download-only-iso"><a href="[[!inline pages="inc/stable_amd64_iso_sig_url" raw="yes" sort="age"]]">signature OpenPGP</a>.</span>

source: We don't provide instructions to verify downloads with OpenPGP anymore.
fr: Nous ne fournissons plus d'instructions pour vérifiez les téléchargements avec OpenPGP.

source: [[See our security analysis of the different verification techniques.|contribute/design/download_verification]]
fr: [[Voir notre analyse de sécurité des différentes méthodes de vérification.|contribute/design/download_verification]]

source: You seem to be using <em>Internet Explorer</em>. To verify your download, please use a different browser.
fr: Il semble que vous utilisiez <em>Internet Explorer</em>. Pour vérifier votre téléchargement, merci d'utiliser un navigateur différent.

source: <label class="button"> Select your download&hellip; <input id="verify-file" type="file"/> </label>
fr: <label class="button"> Sélectionner votre téléchargement&hellip; <input id="verify-file" type="file"/> </label>

source: or verify using the [[!toggle id="openpgp-verification" text="OpenPGP signature"]]
fr: ou vérifier en utilisant la [[!toggle id="openpgp-verification" text="signature OpenPGP"]]

source: <a class="usb upgrade download-only-img" href="[[!inline pages="inc/stable_amd64_img_sig_url" raw="yes" sort="age"]]">OpenPGP signature </a> <a class="dvd vm download-only-iso" href="[[!inline pages="inc/stable_amd64_iso_sig_url" raw="yes" sort="age"]]">OpenPGP signature</a>
fr: <a class="usb upgrade download-only-img" href="[[!inline pages="inc/stable_amd64_img_sig_url" raw="yes" sort="age"]]">signature OpenPGP</a> <a class="dvd vm download-only-iso" href="[[!inline pages="inc/stable_amd64_iso_sig_url" raw="yes" sort="age"]]">signature OpenPGP.</a>

source: If you don't know how to use the OpenPGP signature, click instead on the button <b>Select your download&hellip;</b> to verify your download with JavaScript.
fr: Si vous ne savez pas comment utiliser une signature OpenPGP, cliquer sur le bouton <b>Sélectionner votre téléchargement&hellip;</b> pour vérifier votre téléchargement à l'aide de JavaScript.

source: [[OpenPGP signing key|tails-signing.key]]
fr: [[Clé de signature OpenPGP|tails-signing.key]]

source: [[Security analysis of the different verification techniques|contribute/design/download_verification]]
fr: [[Analyse de sécurité des différentes méthodes de vérification|contribute/design/download_verification]]

source: Verifying <em><span class="verify-filename">$FILENAME</span></em>&hellip;
fr: Vérification <em><span class="verify-filename">$FILENAME</span></em>&hellip;

source: [[!img lib/check.png class="icon" link="no" alt=""]]<b>Verification successful!</b> (<em><span class="verify-filename">$FILENAME</span></em>)
fr: [[!img lib/check.png class="icon" link="no" alt=""]]<b>Vérification réussie !</b> (<em><span class="verify-filename">$FILENAME</span></em>)

source: [[!img lib/cross.png class="icon" link="no" alt=""]]<b>Verification failed!</b> (<em><span class="verify-filename">$FILENAME</span></em>)
fr: [[!img lib/cross.png class="icon" link="no" alt=""]]<b>Échec de la vérification !</b> (<em><span class="verify-filename">$FILENAME</span></em>)

source: [[!toggle id="why-failed" text="Why?"]]
fr: [[!toggle id="why-failed" text="Pourquoi ?"]]

source: Most likely, the verification failed because of an error or interruption during the download.
fr: La plupart du temps, la vérification échoue parce qu'il y a eu une erreur ou une interruption pendant le téléchargement.

source: The verification also fails if you try to verify a different download than the latest version, Tails [[!inline pages="inc/stable_amd64_version" raw="yes" sort="age"]].
fr: La vérification échoue également si vous essayez de vérifier un autre téléchargement que la dernière version :Tails [[!inline pages="inc/stable_amd64_version" raw="yes" sort="age"]].

source: Less likely, the verification might have failed because of a malicious download from our download mirrors or due to a network attack in your country or local network.
fr: Plus rarement, la vérification peut échouer à cause d'un téléchargement malveillant depuis nos miroirs de téléchargement ou à cause d'une attaque réseau dans votre pays ou votre réseau local.

source: Downloading again is usually enough to fix this problem. Otherwise, please try downloading from a different place or a different computer.
fr: Télécharger à nouveau est habituellement suffisant pour résoudre ce problème. Sinon, merci d'essayer de télécharger à nouveau depuis un autre endroit ou un autre ordinateur.

source: [[How does the verification work?|contribute/design/download_verification]]
fr: [[Comment fonctionne la vérification ?|contribute/design/download_verification]]

source: <a href="[[!inline pages="inc/stable_amd64_img_url" raw="yes" sort="age"]]" id="download-img-again" class="use-mirror-pool-on-retry">Please try to download again&hellip;</a>
fr: <a href="[[!inline pages="inc/stable_amd64_img_url" raw="yes" sort="age"]]" id="download-img-again" class="use-mirror-pool-on-retry">Veuillez essayer de télécharger à nouveau&hellip;</a>

source: <a href="[[!inline pages="inc/stable_amd64_iso_url" raw="yes" sort="age"]]" id="download-iso-again" class="use-mirror-pool-on-retry">Please try to download again&hellip;</a>
fr: <a href="[[!inline pages="inc/stable_amd64_iso_url" raw="yes" sort="age"]]" id="download-iso-again" class="use-mirror-pool-on-retry">Merci d'essayer de télécharger à nouveau&hellip;</a>

source: [[!img lib/cross.png class="icon" link="no" alt=""]]<b>Error selecting image.</b>
fr: [[!img lib/cross.png class="icon" link="no" alt=""]]<b>Erreur dans la sélection de l'image.</b>

source: Make sure that you select a USB image that is readable by your browser.
fr: Assurez vous que vous avez bien sélectionné une image USB lisible par votre navigateur.

source: Make sure that you select an ISO image that is readable by your browser.
fr: Assurez vous que vous avez bien sélectionné une image ISO lisible par votre navigateur.

source: <a id="retry-json">Retry&hellip;</a>
fr: <a id="retry-json">Réessayer&hellip;</a>

source: [[!img lib/cross.png class="icon" link="no" alt=""]]<b>Error downloading <a id="checksum-file" href="">checksum file</a> from our website.</b>
fr: [[!img lib/cross.png class="icon" link="no" alt=""]]<b>Erreur lors du téléchargement du <a id="checksum-file" href="">fichier de sommes de contrôle</a> depuis notre site Web.</b>

source: Make sure that your browser is connected to the Internet.
fr: Assurez-vous que votre navigateur est connecté à Internet.

source: [[!img lib/cross.png class="icon" link="no" alt=""]]<b>Error reading image <em><span class="verify-filename">$FILENAME</span></em>.</b>
fr: [[!img lib/cross.png class="icon" link="no" alt=""]]<b>Erreur lors de la lecture de l'image <em><span class="verify-filename">$FILENAME</span></em>.</b>

source: Make sure that <em><span class="verify-filename">$FILENAME</span></em> is readable by your browser.
fr: Assurez-vous que le fichier <em><span class="verify-filename">$FILENAME</span></em> est lisible par votre navigateur.

source: <a id="retry-image">Retry&hellip;</a>
fr: <a id="retry-image">Réessayer&hellip;</a>
