Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet/unsafe_browser/security_implications.inline.*.po
Languages: fr, pt, ru

source: - **The *Unsafe Browser* is not anonymous.**
fr: - **Le *Navigateur non sécurisé* n'est pas anonyme.**
pt: - **O *Navegador não-confiável* não é anônimo.**
ru: - ***Небезопасный браузер* нельзя считать анонимным.**

source: The *Unsafe Browser* does not use Tor. The websites that you visit can see your real IP address.
fr: Le *Navigateur non sécurisé* n'utilise pas Tor. Les sites que vous visitez peuvent voir votre véritable adresse IP.
pt: O *Navegador não-confiável* não usa a rede Tor. Ao usá-lo, os sites que você visita podem ver o seu endereço IP verdadeiro.
ru: *Небезопасный браузер* не использует Tor. Посещаемые вами сайты могут видеть ваш настоящий IP-адрес.

source: This is why we recommend that you:
fr: C'est pourquoi nous vous recommandons de :
pt: É por isso que te recomendamos:
ru: Вот почему мы рекомендуем:

source: Only use the *Unsafe Browser* to sign in to a network using a captive portal or [[browse trusted web pages on the local network|advanced_topics/lan#browser]].
fr: N'utiliser le *Navigateur non sécurisé* que pour se connecter à un réseau utilisant un portail captif ou [[visiter des pages de confiance sur le réseau local|advanced_topics/lan#browser]].
pt: Use o *Navegador Inseguro* somente para logar em uma rede que use portal cativo ou então para [[navegar em páginas web confiáveis na rede local|advanced_topics/lan#browser]].
ru: Используйте *небезопасный браузер* только для входа в сеть через сайт авторизации или [[веб-сёрфинга по доверенным страницам внутри вашей локальной сети|advanced_topics/lan#browser]].

source: Close the *Unsafe Browser* after signing in to the network to avoid using it by mistake.
pt: Feche o *Navegador Inseguro* após logar na rede para evitar usá-lo novamente sem querer.

source: - **The *Unsafe Browser* can be used to deanonymize you.**
fr: - **Le *Navigateur non sécurisé* peut être utilisé pour rompre votre anonymat.**
pt: -**O *Navegador não-confiável* pode ser usado para acabar com seu anonimato.**
ru: - ** *Unsafe Browser* может быть использован, чтобы деанонимизировать вас.**

source: An attacker could exploit a security vulnerability in another application in Tails to start an invisible *Unsafe Browser* and reveal your IP address, even if you are not using the *Unsafe Browser*.
fr: Un attaquant pourrait utiliser une faille de sécurité d'un autre programme de Tails pour lancer une instance cachée du *Navigateur non sécurisé* et révéler votre adresse IP, même si vous n'utilisez pas le *Navigateur non sécurisé*.
pt: Um atacante poderia explorar uma falha de segurança em outra aplicação no Tails para iniciar um *Navegador não-confiável* invisível e revelar seu endereço IP verdadeiro, mesmo que você não esteja usando o *Navegador não-confiável*.
ru: Злоумышленник может воспользоваться уязвимостью в каком-нибудь другом приложении Tails, чтобы незаметно запустить *небезопасный браузер* и определить ваш IP-адрес, даже если вы сами не используете *небезопасный браузер*.

source: For example, an attacker could exploit a security vulnerability in *Thunderbird* by sending you a [phishing email](https://ssd.eff.org/en/module/how-avoid-phishing-attacks) that starts an invisible *Unsafe Browser* and reveals your IP address to the attacker.
pt: Um atacante poderia, por exemplo, explorar uma falha de segurança no *Thunderbird* ao enviar para você um [email de phishing](https://ssd.eff.org/en/module/how-avoid-phishing-attacks) que poderia então iniciar um *Navegador Inseguro* invisivel e assim revelar, para o atacante, o seu endereço IP verdadeiro.

source: Such an attack is very unlikely but could be performed by a strong attacker, such as a government or a hacking firm.
fr: Une telle attaque est très improbable mais peut être réalisée par un attaquant puissant, comme un gouvernement ou une société de piratage.
pt: Um ataque desse tipo é bem improvável, mas pode ser realizado por um atacante forte, tais como um governo ou uma empresa de hacking.
ru: Такая атака маловероятна, но может быть проведена сильным злоумышленником, например правительством или хакерской группой.

source: Only enable the *Unsafe Browser* if you need to sign to a network using a captive portal.
fr: N'activer le *Navigateur non sécurisé* que pour vous connecter à un réseau utilisant un portail captif.
pt: Somete habilite o *Navegador Inseguro* caso você precise logar em uma rede usando um portal cativo.
ru: Включайте *небезопасный браузер* только для входа в сеть через сайт авторизации.

source: Always upgrade to the latest version of Tails to fix known vulnerabilities as soon as possible.
fr: Toujours mettre à jour vers la dernière version de Tails pour corriger les failles connues dès que possible.
pt: Sempre atualize para a última versão do Tails para consertar vulnerabilidades conhecidas o quanto antes.
ru: Регулярно обновляйте Tails до последней версии. Это поможет быстрее избавляться от обнаруженных уязвимостей.

source: We have plans to fix the root cause of this problem but it requires [[!tails_ticket 12213 desc="important engineering work"]].
fr: Nous avons prévu de corriger la cause profonde de ce problème mais cela nécessite [[!tails_ticket 12213 desc="un important travail d'ingénierie"]].
pt: Temos planos para consertar a raiz desse problema, mas isso requer um [[!tails_ticket 12213 desc="trabalho importante de engenharia"]].
ru: У нас есть планы по устранению основной причины этой проблемы, но для этого требуется [[!tails_ticket 12213 desc="серьёзная инженерная работа"]].
