Repository: KaushalIngle/CuOS
Catalog: wiki/src/about/contact.*.po
Languages: fr

source: There are many ways to contact us, depending on what you want to talk about.
fr: Il y a plusieurs manières de nous contacter, selon ce dont vous voulez parler.

source: All mailing lists are in English unless specified otherwise.
fr: Toutes les listes de discussions par courrier électronique sont en anglais sauf indication contraire.

source: <h1 id="public-mailing-lists">Public mailing lists</h1>
fr: <h1 id="public-mailing-lists">Listes publiques de discussions par messagerie électronique</h1>

source: <p>These mailing lists are public: subscription is open to anyone. Don't send compromising information. Please respect the [[code of conduct|contribute/working_together/code_of_conduct/]].</p>
fr: <p>Ces listes de discussion par courrier électronique sont publiques : les inscriptions sont ouvertes à tous. N'envoyez pas d'informations compromettantes. Merci de respecter le [[code de conduite|contribute/working_together/code_of_conduct/]].</p>

source: amnesia-news@boum.org is the mailing list where we send our [[news]] by email. It has a low traffic and it is the right place to stay up-to-date with the releases and security announcements.
fr: amnesia-news@boum.org est la liste où nous envoyons les [[actualités|news]] de Tails par courrier électronique. Son trafic est faible et il s'agit de la bonne liste pour rester à jour des nouvelles versions et des annonces de sécurité.

source: <p> <form method="POST" action="https://www.autistici.org/mailman/subscribe/amnesia-news"> <input name="email" value=""/> <input type="submit" value="Subscribe"/> </form> </p>
fr: <p> <form method="POST" action="https://www.autistici.org/mailman/subscribe/amnesia-news"> <input name="email" value=""/> <input type="submit" value="S'abonner"/> </form> </p>

source: Public archive of amnesia-news: <https://lists.autistici.org/list/amnesia-news.html>.
fr: Archives publiques de la liste amnesia-news : <https://lists.autistici.org/list/amnesia-news.fr.html>.

source: <p> <form action="https://lists.autistici.org/cgi-lurker/keyword.cgi" accept-charset="UTF-8"> <input type="hidden" name="doc-url" value="https://lists.autistici.org"> <input type="hidden" name="format" value="en.html"> <input type="text" name="query" value="" placeholder="ml:amnesia-news search terms" onclick="value='ml:amnesia-news '"> <input type="submit" name="submit" value="Search archive"> </form> </p>
fr: <p> <form action="https://lists.autistici.org/cgi-lurker/keyword.cgi" accept-charset="UTF-8"> <input type="hidden" name="doc-url" value="https://lists.autistici.org"> <input type="hidden" name="format" value="en.html"> <input type="text" name="query" value="" placeholder="ml:amnesia-news search terms" onclick="value='ml:amnesia-news '"> <input type="submit" name="submit" value="Chercher dans les archives"> </form> </p>

source: tails-dev@boum.org is the mailing list where the project is coordinated: technical design questions, upcoming events, monthly reports, and user experience.
fr: tails-dev@boum.org est la liste sur laquelle la coordination du projet se fait : conception technique, évènements à venir, rapports mensuels et expérience d'utilisation.

source: <p> <form method="POST" action="https://www.autistici.org/mailman/subscribe/tails-dev"> <input name="email" value=""/> <input type="submit" value="Subscribe"/> </form> </p>
fr: <p> <form method="POST" action="https://www.autistici.org/mailman/subscribe/tails-dev"> <input name="email" value=""/> <input type="submit" value="S'abonner"/> </form> </p>

source: Public archive of tails-dev: <https://lists.autistici.org/list/tails-dev.html>.
fr: Archives publiques de la liste tails-dev : <https://lists.autistici.org/list/tails-dev.fr.html>.

source: <p> <form action="https://lists.autistici.org/cgi-lurker/keyword.cgi" accept-charset="UTF-8"> <input type="hidden" name="doc-url" value="https://lists.autistici.org"> <input type="hidden" name="format" value="en.html"> <input type="text" name="query" value="" placeholder="ml:tails-dev search terms" onclick="value='ml:tails-dev '"> <input type="submit" name="submit" value="Search archive"> </form> </p>
fr: <p> <form action="https://lists.autistici.org/cgi-lurker/keyword.cgi" accept-charset="UTF-8"> <input type="hidden" name="doc-url" value="https://lists.autistici.org"> <input type="hidden" name="format" value="en.html"> <input type="text" name="query" value="" placeholder="ml:tails-dev search terms" onclick="value='ml:tails-dev '"> <input type="submit" name="submit" value="Chercher dans les archives"> </form> </p>

source: tails-testers@boum.org is the mailing list for people who want to help [[test|contribute/how/testing]] new releases or features.
fr: tails-tester@boum.org est la liste pour les personnes voulant aider à [[tester|contribute/how/testing]] les nouvelles versions et fonctionnalités.

source: <p> <form method="POST" action="https://www.autistici.org/mailman/subscribe/tails-testers"> <input name="email" value=""/> <input type="submit" value="Subscribe"/> </form> </p>
fr: <p> <form method="POST" action="https://www.autistici.org/mailman/subscribe/tails-testers"> <input name="email" value=""/> <input type="submit" value="S'abonner"/> </form> </p>

source: Public archive of tails-testers: <https://lists.autistici.org/list/tails-testers.html>.
fr: Archives publiques de la liste tails-testers : <https://lists.autistici.org/list/tails-testers.fr.html>.

source: <p> <form action="https://lists.autistici.org/cgi-lurker/keyword.cgi" accept-charset="UTF-8"> <input type="hidden" name="doc-url" value="https://lists.autistici.org"> <input type="hidden" name="format" value="en.html"> <input type="text" name="query" value="" placeholder="ml:tails-testers search terms" onclick="value='ml:tails-testers '"> <input type="submit" name="submit" value="Search archive"> </form> </p>
fr: <p> <form action="https://lists.autistici.org/cgi-lurker/keyword.cgi" accept-charset="UTF-8"> <input type="hidden" name="doc-url" value="https://lists.autistici.org"> <input type="hidden" name="format" value="en.html"> <input type="text" name="query" value="" placeholder="ml:tails-testers search terms" onclick="value='ml:tails-testers '"> <input type="submit" name="submit" value="Chercher dans les archives"> </form> </p>

source: <h1 id="private-email-addresses">Private email addresses</h1>
fr: <h1 id="private-email-addresses">Adresses de messagerie électronique privées</h1>

source: You can write encrypted emails to <tails-support-private@boum.org> if you need help in private.
fr: Vous pouvez envoyer des messages chiffrés à <tails-support-private@boum.org> si vous avez besoin d'aide en privé.

source: [[OpenPGP key|tails-bugs.key]] ([[details|doc/about/openpgp_keys#support]]).
fr: [[Clé OpenPGP|tails-bugs.key]] ([[détails|doc/about/openpgp_keys#support]]).

source: [[!inline pages="support/talk/languages.inline" raw="yes" sort="age"]]
fr: [[!inline pages="support/talk/languages.inline.fr" raw="yes" sort="age"]]

source: If you are a journalist and want to write about Tails, or if you want to send us links to [[press articles|press]] about Tails, write to <tails-press@boum.org>.
fr: Si vous êtes un journaliste et voulez écrire à propos de Tails, ou si voulez nous envoyer des liens d'[[articles de presse|press]] à propos de Tails, écrivez à <tails-press@boum.org>.

source: [[OpenPGP key|tails-press.key]] ([[details|doc/about/openpgp_keys#press]]).
fr: [[Clé OpenPGP|tails-press.key]] ([[détails|doc/about/openpgp_keys#press]]).

source: If you want to contact our accounting team, write to <tails-accounting@boum.org>.
fr: Si vous voulez contacter notre équipe de comptabilité, écrivez à <tails-accounting@boum.org>.

source: [[OpenPGP key|tails-accounting.key]] ([[details|doc/about/openpgp_keys#accounting]]).
fr: [[Clé OpenPGP|tails-accounting.key]] ([[détails|doc/about/openpgp_keys#accounting]]).

source: If you want to contact our fundraising team, write to <tails-fundraising@boum.org>.
fr: Si vous voulez contacter notre équipe de collecte de dons, écrivez à <tails-fundraising@boum.org>.

source: [[OpenPGP key|tails-fundraising.key]] ([[details|doc/about/openpgp_keys#fundraising]]).
fr: [[Clé OpenPGP|tails-fundraising.key]] ([[détails|doc/about/openpgp_keys#fundraising]]).

source: To get in touch with the Tails [[Foundations Team|contribute/working_together/roles/foundations_team]], write to <tails-foundations@boum.org>.
fr: Pour prendre contact avec [[l'équipe fondations |contribute/working_together/roles/foundations_team]] de Tails, écrivez à <tails-foundations@boum.org>.

source: [[OpenPGP key|tails-foundations.key]] ([[details|doc/about/openpgp_keys#foundations]]).
fr: [[Clé OpenPGP|tails-foundations.key]] ([[détails|doc/about/openpgp_keys#foundations]]).

source: If you want to operate a Tails mirror, see [[contribute/how/mirror]].
fr: Si vous voulez administrer un miroir de Tails, voir [[contribute/how/mirror]].

source: To get in touch with the team that manages our pool of mirror, write to <tails-mirrors@boum.org>.
fr: Pour contacter l'équipe qui gère notre parc de miroirs, écrivez à <tails-mirrors@boum.org>.

source: [[OpenPGP key|tails-mirrors.key]] ([[details|doc/about/openpgp_keys#mirrors]]).
fr: [[Clé OpenPGP|tails-mirrors.key]] ([[détails|doc/about/openpgp_keys#mirrors]]).

source: To talk about our infrastructure (servers, test suite, repositories, mirrors, etc.), write to <tails-sysadmins@boum.org>.
fr: Pour parler de notre infrastructure (serveurs, tests, dépôts, miroirs, etc.), écrivez à <tails-sysadmins@boum.org>.

source: [[OpenPGP key|tails-sysadmins.key]] ([[details|doc/about/openpgp_keys#sysadmins]]).
fr: [[Clé OpenPGP|tails-sysadmins.key]] ([[détails|doc/about/openpgp_keys#sysadmins]]).

source: To talk about the [[Tails translation platform|contribute/how/translate/with_translation_platform]], write to <tails-weblate@boum.org>.
fr: Pour discuter de la [[plateforme de traduction de Tails|contribute/how/translate/with_translation_platform]], écrivez à <tails-weblate@boum.org>.

source: [[OpenPGP key|tails-weblate.key]] ([[details|doc/about/openpgp_keys#weblate]]).
fr: [[Clé OpenPGP|tails-weblate.key]] ([[détails|doc/about/openpgp_keys#weblate]]).

source: You can write to the Board at <tails-board@boum.org> about sponsorship requests and governance issues.
fr: Vous pouvez écrire au conseil d'administration à <tails-board@boum.org> pour les demandes de parrainages et les questions relatives à la gouvernance.

source: [[OpenPGP key|tails-board.key]] ([[details|doc/about/openpgp_keys#board]]).
fr: [[Clé OpenPGP|tails-board.key]] ([[détails|doc/about/openpgp_keys#board]]).

source: For matters that are listed in none of the above and for vulnerabilities disclosures, you can write encrypted emails to <tails@boum.org>.
fr: Pour les problématiques non listées au dessus et pour les rapports de vulnérabilités, vous pouvez envoyer des messages chiffrés à <tails@boum.org>.

source: [[OpenPGP key|tails-email.key]] ([[details|doc/about/openpgp_keys#private]]).
fr: [[Clé OpenPGP|tails-email.key]] ([[détails|doc/about/openpgp_keys#private]]).

source: <h1 id="chat">Chat rooms</h1>
fr: <h1 id="chat">Salons de discussion</h1>

source: You can join our [[users chat room|support/chat]] and [[developers chat room|contribute/chat]]. Only a few Tails developers hang out there, so email is preferred for anything that might be of interest for the larger community.
fr: Vous pouvez rejoindre notre [[salon de discussion pour utilisateurs|support/chat]] et celui [[pour développeurs|contribute/chat]]. Seuls quelques développeurs s'y connectent, le courrier électronique est donc préférable pour tout ce qui pourrait intéresser la communauté plus largement.
