Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/about/social_contract.*.po
Languages: it, pt

source: [[!meta title="Social Contract"]]
it: [[!meta title="Contratto sociale"]]
pt: [[!meta title="Contrato social"]]

source: Introduction
it: Introduzione
pt: Introdução

source: The Tails Social Contract is a set of commitments that we as contributors to the Tails project stand by. This work is derived from the Debian Social Contract and the Tor Social Contract. If you have any questions or comments, feel free to email: <tails-dev@boum.org>.
it: Il contratto sociale di Tails è costituito da una serie di impegni che noi come contributori del progetto Tails ci siamo assunti. Questo lavoro deriva dal Contratto sociale Debian e dal Contratto sociale Tor. Se avete qualunque domanda o commento, contattateci all'email: <tails-dev@boum.org>.
pt: O contrato social do Tails é uma serie de compromissos que nós, como contribuidores do projeto Tails, defendemos. Esse trabalho é derivado do Contrato Social do Debian e do Contrato Social do Tor. Se você possuir qualquer duvida ou comentario, sinta-se à vontade para mandar um email para: <tails-dev@boum.org>.

source: This is a promise from our contributors community to the rest of the world, affirming a commitment to our beliefs.
it: Questa è una promessa della nostra comunità di contributori al resto del mondo affermando un impegno riguardo alle nostre convinzioni.
pt: Essa é uma promessa da nossa comunidade de contribuidores para o mundo todo, afirmando um compromisso com o que acreditamos.

source: 1. By creating Tails we try to provide usable tools for anonymity and privacy
it: 1. Con lo sviluppo di Tails cerchiamo di fornire strumenti utilizzabili per l'anonimato e la privacy
pt: 1. Ao criarmos o Tails, tentamos providenciar ferramentas utilizáveis para anonimidade e privacidade.

source: We believe that privacy, the free exchange of ideas, and equal access to information are essential to free and open societies. Through our community standards and the tools we create, we provide means that empower all people to protect and advance these ideals.
it: Crediamo che la privacy, il libero scambio di idee e l'accesso paritario alle informazioni siano essenziali per società libere e aperte. Attraverso le nostre norme comunitarie e gli strumenti che creiamo, forniamo i mezzi che permettono a tutte le persone di proteggere e promuovere questi ideali.
pt: Acreditamos que a privacidade, troca livre de opiniões e o acesso igualitário à informação são essenciais para sociedades livres e abertas. Através dos padrões da nossa comunidade e das ferramentas criadas por nos, oferecemos meios para que todas as pessoas se capacitem para proteger e promover esses ideais.

source: Equal access to information includes the free availability of our code and documentation as well as the transparency of our decision making processes.
it: L'accesso equo alle informazioni include la disponibilità gratuita del nostro codice e della documentazione, oltre alla trasparenza dei nostri processi decisionali.
pt: Acesso igualitário à informação inclui a disponibilidade gratuita do nosso código e documentação, assim como transparência em relação a quais decisões serão tomadas ao longo do processo.

source: All the components of Tails that we create ourselves are, and will be, licensed in a manner consistent with the [Debian Free Software Guidelines](https://www.debian.org/social_contract).
it: Tutti i componenti di Tails che creiamo noi stessi sono, e saranno, concessi in licenza in modo coerente con le [Linee guida Debian Free Software](https://www.debian.org/social_contract).
pt: Todos os componentes do Tails que nos criamos são, e continuarão sendo, licenciados de um modo consistente ao [Debian Free Software Guidelines] (https://www.debian.org/social_contract).

source: Tails will always be free to use, remix, adapt and distribute. As the only exceptions to this rule, Tails includes:
it: Tails, sarà sempre gratuito da usare, remixare, adattare e distribuire. Come uniche eccezioni a questa regola, Tails include:
pt: Tails sempre será grátis para usar, modificar, adaptar e distribuir. As únicas exceções à essa regra, são:

source: a minor part of non-free firmware in order to work on as much hardware as possible;
it: una piccola parte di firmware non libero, per poter funzionare su più hardware possibile;
pt: uma quantidade pequena de firmware não-livre, visando funcionar na maior variedade de hardware possivel;

source: a few pieces of software whose source code is public but not compatible with the Debian Free Software Guidelines; they are needed to support important use cases.
it: alcuni pezzi di software, il cui codice sorgente è pubblico ma non è compatibile con le linee guida Debian per il software libero; questi sono necessari per supportare casi di utilizzo importanti.
pt: Algumas partes de software que o código é público, mas não é compatível com a Debian Free Software Guidelines; são necessárias para suportar alguns casos.

source: 3. We will give back to the Free Software community
it: 3. Restituiremo alla comunità di software libero
pt: 3. Retribuiremos para a comunidade Código-Livre.

source: Tails is a privacy-oriented [Debian Derivative](https://wiki.debian.org/Derivatives).
it: Tails è una [derivata Debian](https://wiki.debian.org/Derivatives) orientata alla privacy.

source: We want usable security and privacy-oriented tools to become a standard for the Free Software community as a whole.
it: Vogliamo che gli strumenti di sicurezza e per la privacy diventino uno standard per la comunità del Software Libero nel suo complesso.
pt: Queremos que ferramentas seguras e que foquem a privacidade tornem-se um padrão para a comunidade Free software como um todo.

source: Bug fixes, code improvements, Debian packaging, as well as work on usability issues will be sent upstream whenever possible. This way, our modifications will benefit others and can be improved upon further by a wider audience of people.
it: Correzioni di bug, miglioramenti al codice, pacchettizzazione Debian e il lavoro su problemi di usabilità verranno inviati a monte quando possibile. In questo modo, le nostre modifiche andranno in beneficio degli altri e potranno essere migliorate ulteriormente da un pubblico più ampio di persone.
pt: Correção de bugs, melhoramento no codigo, packaging Debian, e trabalho em problemas de usabilidade serão enviados quando possivel. Dessa maneira, nossas modificações vão beneficiar outros e podem ser melhoradas futuramente por uma maior audiencia de pessoas.

source: 4. We encourage participation and transparency
it: 4. Incoraggiamo la partecipazione e la trasparenza
pt: 4. Encorajamos participação e transparencia

source: We want to produce Tails in a way that encourages participation, which requires publicly documenting what can be improved. As Tails is created in such a transparent manner, anyone is encouraged to participate, review it and point out problems.
it: Vogliamo sviluppare Tails in un modo che promuova la partecipazione, il che richiede di documentare pubblicamente ciò che può essere migliorato. Poiché Tails è stato creato in modo così trasparente, chiunque è incoraggiato a partecipare, esaminarlo e segnalare i problemi.
pt: Queremos produzir tails de uma maneira que encoraje a participação, o que requer documentação pública que pode ser melhorada. Como tails foi criado de uma maneira tão transparente, qualquer um é encorajado à participar, revisar e apontar problemas.

source: To make our community a welcoming place for everybody we agreed on a [[Code of Conduct|contribute/working_together/code_of_conduct]].
it: Per rendere la nostra comunità un luogo accogliente per tutti, abbiamo concordato un [[Codice di condotta|contribute/working_together/code_of_conduct]].
pt: Para fazer nossa comunidade um lugar acolhedor para todos, concordamos com um [[Código de conduta|contribute/working_together/code_of_conduct]].

source: 5. We will never harm our users intentionally
it: 5. Non danneggeremo mai i nostri utenti intenzionalmente
pt: 5. Nós nunca machucaremos os nossos usuarios intencionalmente.

source: We will always do our best to create secure and usable tools. We will never willingly include backdoors or malicious software nor will we cooperate with any entity wanting us to harm our users.
it: Facciamo sempre del nostro meglio per creare strumenti sicuri ed utilizzabili. Non includeremo mai volutamente backdoor o software dannoso né coopereremo con qualsiasi entità che voglia danneggiare i nostri utenti.
pt: Sempre faremos o melhor para criar ferramentas seguras e utilizaves. Nós nunca incluiremos voluntariamente backdoors ou software malicioso, nem cooperaremos com nenhuma entidade querendo que machuquemos nossos usuários.

source: Mistakes sometimes happen. We will be honest about them and fix those that affect the safety of Tails users when they are reported to us.
it: Gli errori possono capitare, saremo onesti al riguardo e, quando ci vengono segnalati, risolveremo quelli che danneggiano la sicurezza degli utenti Tails.

source: Whenever severe security issues are reported to us in private, we will test them and ensure we promptly fix these issues. We will notify our users whenever such an issue has been reported to us. However, for the security of our users, we might not disclose such a severe issue before releasing a fix.
it: Ogni volta che ci vengono segnalati in privato gravi problemi di sicurezza, li verificheremo e ci assicureremo di risolverli immediatamente. Informeremo i nostri utenti ogni volta che ci viene segnalato un problema di questo tipo. Tuttavia, per la sicurezza dei nostri utenti, potremmo non rivelare un problema particolarmente serio prima di rilasciarne la correzzione.

source: 6. We give users the means to decide how much they can rely on Tails
it: 6. Diamo agli utenti i mezzi per decidere quanto possano fare affidamento su Tails

source: We encourage users to inform themselves and decide if Tails is suitable for their use case and how much they can trust it. We work diligently to keep our community up-to-date through our various communication channels about the current state of our software and its limitations. We encourage users to read our documentation as well as third-party documentation in order to make an informed decision and engage in a learning process about the tools we ship.
it: Incoraggiamo gli utenti a informarsi e decidere se Tails è adatto al loro caso d'uso e quanto possono fidarsi. Lavoriamo diligentemente per mantenere la nostra comunità aggiornata attraverso i nostri vari canali di comunicazione sullo stato attuale del nostro software e le sue limitazioni. Incoraggiamo gli utenti a leggere la nostra documentazione così come la documentazione di terze parti al fine di prendere una decisione informata e impegnarsi in un processo di apprendimento sugli strumenti che forniamo.

source: We provide and explain methods of verification so that anyone can ensure that they downloaded a genuine copy of Tails.
it: Forniamo e spieghiamo i metodi di verifica affinché chiunque possa essere sicuro di aver scaricato una copia autentica di Tails.

source: <p>See also our [[Mission and Values|contribute/mission]].</p>
it: <p>Vedi anche la nostra[[missione e i nostri valori|contribute/mission]].</p>
