Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/about/trust.*.po
Languages: es, it

source: [[!meta title="How can I trust Tails?"]]
es: [[!meta title="¿Cómo puedo confiar en Tails?"]]
it: [[!meta title="Come faccio a fidarmi di Tails?"]]

source: [[!meta stylesheet="donate/testimonials.inline" rel="stylesheet" title=""]]
it: [[!meta stylesheet="donate/testimonials.inline.it" rel="stylesheet" title=""]]

source: Tails will never try harm to you or any of our users, as a core principle of [[our social contract|about/social_contract]]. As part of that commitment, we have written this page to help you make an informed decision about whether you can trust Tails.
es: Tails nunca intentará hacerte daño a ti o a ninguno de nuestros usuarios, como uno de nuestros principios centrales de [[nuestros contratos sociales|about/social_contract]]. Como parte de ese compromiso, hemos escrito esta página para ayudarte a tomar una decisión informada acerca de si puedes o no confiar en Tails.
it: Tails non cercherà mai di danneggiare te o qualsiasi altro utente, in quanto principio fondamentale del [[nostro contratto sociale|about/social_contract]]. Come parte di questo impegno, abbiamo scritto questa pagina per aiutarti a prendere una decisione consapevole sulla fiducia che puoi riporre in Tails.

source: We think that Tails is a trustworthy project because:
es: Creemos que Tails es un proyecto confiable porque:
it: Pensiamo che Tails sia un progetto affidabile perché:

source: - **Our source code is public**
es: - **Nuestro código fuente es público**
it: - **Il nostro codice sorgente è pubblico**

source: Tails is [[Free Software|about/license]] and security researchers worldwide can examine our [[!tails_gitlab desc="source code"]].
es: Tails es un [[Software Libre|about/license]] e investigadores de seguridad del mundo pueden examinar nuestro [[!tails_gitlab desc="código fuente"]].
it: Tails è [[Free Software|about/license]] e i ricercatori sulla sicurezza di tutto il mondo possono esaminare il nostro [[!tails_gitlab desc="codice sorgente"]].

source: The most sensitive parts of Tails are explained in our [[design documents|contribute/design]].
es: Las partes más sensibles de Tails se explican en nuestros [[documentos de diseño|contribute/design]].
it: Le parti più importanti di Tails sono spiegate nei nostri [[design documenti|contribute/design]].

source: - **Tails is based on Tor and Debian**
es: - **Tails está basado en Tor y Debian**
it: - **Tails si basa su Tor e Debian**

source: Most of the software included in Tails has not been written by us, but is inherited from Tor and Debian:
es: La mayor parte del software incluido en Tails no ha sido escrito por nosotros, pero es heredada de Tor y Debian:
it: La maggior parte del software incluso in Tails nonlo abbiamo scritto noi, ma lo abbiamo ereditato da Tor e Debian:

source: [Debian](https://debian.org/) is one of the oldest Linux distributions and the one with the most derivatives, including Ubuntu. Debian and its derivatives are [the most popular Linux distributions on web servers](https://w3techs.com/technologies/details/os-linux) across the Internet. The Debian project is coordinated over the Internet by a team of volunteers whose work is entirely public. All this makes Debian one of the Free Software projects under the most scrutiny by security researchers.
it: [Debian](https://debian.org/) è una delle più vecchie distribuzioni Linux e quella con più derivate, Ubuntu inclusa. Debian e le sue derivate sono [le distribuzioni Linux più diffuse sui server web](https://w3techs.com/technologies/details/os-linux) su Internet. Il progetto Debian è coordinato su Internet da un team di volontari il cui lavoro è tutto reso pubblico. Tutto questo rende Debian uno dei progetti di software libero più monitorato da parte dei ricercatori sulla sicurezza.

source: [Tor](https://torproject.org/) is the best anonymity network available. Tor has partnered with leading research institutions and has been subjected to intensive academic research. Tor has received awards from institutions such as the [EFF](https://www.eff.org/awards/pioneer/2012) and the [Free Software Foundation](https://www.fsf.org/news/2010-free-software-awards-announced). Even the NSA qualified Tor as "[the King of high secure, low latency Internet Anonymity](https://www.theguardian.com/world/interactive/2013/oct/04/tor-high-secure-internet-anonymity)."
it: [Tor](https://torproject.org/) è la migliore rete di anonimato disponibile. Tor ha collaborato con importanti istituti di ricerca ed è stato soggetto di un'intensa ricerca accademica. Tor ha ricevuto riconoscimenti da istituzioni come la [EFF](https://www.eff.org/awards/pioneer/2012) e la [Free Software Foundation](https://www.fsf.org/news/2010-free-software-awards-announced). E persino la NSA ha definito Tor come "[il Re dell'alta sicurezza, bassa latenza dell'anonimato in Internet](https://www.theguardian.com/world/interactive/2013/oct/04/tor-high-secure-internet-anonymity)."

source: - **Our downloads are verifiable**
es: - **Nuestras descargas son verificables**
it: - **I nostri download sono verificabili**

source: Making sure that our users are really downloading an unmodified version of our work is also critical to trust and security:
es: Asegurarnos de que nuestros usuarios realmente estén descargando una versión no modificada de nuestro trabajo también es fundamental para la confianza y la seguridad:
it: Assicurare che i nostri utenti stiano davvero scaricando una versione non modificata del nostro lavoro è anche essenziale per la fiducia e la sicurezza:

source: Our downloads are [[reproducible|contribute/build/reproducible]] to make sure that the process of building the downloads from our source code was not altered by our own infrastructure.
it: I nostri download sono [[riproducibili|contribute/build/reproducible]] per assicurare che la versione dei download dal nostro codice sorgente non sia stata alterata dalla nostra infrastruttura.

source: We provide [[strong and easy-to-use verification mechanisms|contribute/design/download_verification]] to make sure that our users are downloading a genuine copy of Tails.
it: Forniamo [[meccanismi di verifica forti e facili da usare|contribute/design/download_verification]] per assicurarci che i nostri utenti stiano scaricando una copia autentica di Tails.

source: - **Tails is recommended by renown and diverse people and organizations**
es: - **Tails es recomendado por reconocidas y diversas personas y organizaciones**
it: - **Tails è raccomandato da organizzazioni rinomate e da persone tra le più diverse**

source: See also our list of [[sponsors]].
es: Mira nuestra lista de [[sponsors]].
it: Vedi anche la lista dei nostri [[sponsor]].

source: [[!inline pages="donate/testimonials.inline" raw="yes" sort="age"]]
es: [[!inline pages="donate/testimonials.inline.es" raw="yes" sort="age"]]
