Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/advanced_topics/virtualization/virt-manager.*.po
Languages: ru

source: [*virt-manager*](http://virt-manager.org/) is a free software virtualization solution for Linux. *virt-manager* has a more complex interface than *VirtualBox* or *GNOME Boxes* but it also has a more complete set of features.
ru: [*Virt-manager*](http://virt-manager.org /) — бесплатная программа виртуализации для Linux. Интерфейс у *virt-manager * сложнее, чем у *VirtualBox * или *GNOME Boxes *, зато у него больше функций.

source: [[!inline pages="doc/advanced_topics/virtualization.caution" raw="yes" sort="age"]]
ru: [[!inline pages="doc/advanced_topics/virtualization.caution.ru" raw="yes" sort="age"]]

source: <p><em>virt-manager</em> is the only virtualization solution that we present that allows the use of a Persistent Storage.</span> See [[Running Tails from a USB image|virt-manager#usb_image]].</p>
ru: <p><em>Virt-manager</em> — единственное решение для виртуализации, которое работает с Постоянным хранилищем.</span> См. [[Запуск Tails из USB-образа|virt-manager#usb_image]].</p>

source: Terminology
ru: Терминология

source: *virt-manager* is based on a set of lower level virtualization tools, going from the user interface to the hardware interactions with the processor. This terminology is a bit confusing and other documentation might mention the following tools:
ru: *Virt-manager* основан на наборе инструментов виртуализации более низкого уровня от пользовательского интерфейса и до взаимодействия оборудования с процессором. Эта терминология немного запутана. Вы можете встретить упоминание следующих инструментов:

source: *KVM* is the module of the Linux kernel that interacts with the virtualization features of the processor.
ru: *KVM* — модуль ядра Linux, взаимодействует с функциями виртуализации процессора;

source: *QEMU* is the virtualization software that emulates virtual processors and peripherals based on *KVM* and that starts and stops virtual machines.
ru: *QEMU* — программное обеспечение для виртуализации, эмулирует виртуальные процессоры и периферийные устройства на основе *KVM*, запускает и останавливает виртуальные машины;

source: *libvirt* is a library that allows *virt-manager* to interact with the virtualization capabilities provided by *QEMU*.
ru: *libvirt* — библиотека, которая позволяет *virt-manager* взаимодействовать с возможностями виртуализации *QEMU*;

source: *SPICE* is a protocol that allows to visualize the desktop of virtual machines.
ru: *SPICE* — протокол, позволяющий визуализировать рабочий стол виртуальных машин;

source: *virt-manager* is the graphical interface that allows to create, configure, and run virtual machines.
ru: *virt-manager* — графический интерфейс, позволяющий создавать, настраивать и запускать виртуальные машины.

source: Installation
ru: Установка

source: To install *virt-manager* in Debian, execute the following command:
ru: Для установки *virt-manager* в Debian выполните следующую команду:

source: To install *virt-manager* in Ubuntu, execute the following command:
ru: Для установки *virt-manager* в Ubuntu выполните следующую команду:

source: Running Tails from an ISO image
ru: Запуск Tails из ISO-образа

source: Start *virt-manager*.
ru: Запустите *virt-manager*.

source: Double-click on **localhost (QEMU)** to connect to the *QEMU* system of your host.
ru: Дважды щелкните по **QEMU**, чтобы подключиться к системе *QEMU* вашего хоста.

source: In *step 1*, choose **Local install media (ISO image or CDROM)**.
ru: На первом шаге выберите **Локальный ISO или CDROM**.

source: In *step 3*, allocate at least 2048 MB of RAM.
ru: На *шаге 3* выделите не менее 2048 Мб оперативной памяти.

source: In *step 4*, disable storage for this virtual machine.
ru: На *шаге 4* отключите пространство хранения данных.

source: In *step 5*:
ru: На *шаге 5*:

source: Click **Finish** to start the virtual machine.
ru: Нажмите **Готово** для запуска виртуальной машины.

source: If you get the error message "<span class="guilabel">Error starting domain: Requested operation is not valid: network 'default' is not active</span>", then try to start the default virtual network:
ru: Если увидите сообщение об ошибке "<span class="guilabel">Error starting domain: Requested operation is not valid: network 'default' is not active</span>", попробуйте запустить виртуальную сеть по умолчанию:

source: Running Tails from a USB image
ru: Запуск Tails из USB-образа

source: Running Tails from a USB image is the only virtualization solution that allows you to use a Persistent Storage in a virtual machine.
ru: Запуск Tails из USB-образа — единственное решение для виртуализации, которое позволяет использовать Постоянное хранилище.

source: [[Download a USB image|install/download]] instead of an ISO image.
ru: Вместо ISO-образа [[скачайте USB-образ|install/download]].

source: Increase the size of the USB image to be at least 8 GB. This creates space for automatic upgrades and the Persistent Storage.
ru: Увеличьте размер USB-образа как минимум до 8 Гб. Это создаст пространство для автоматического обновления и Постоянного хранилища.

source: <span class="command-placeholder">size</span> has to be at least <span class="command">7200M</span>.
ru: <span class="command-placeholder">Размер</span> должен быть не менее <span class="command">7200M</span>.

source: <span class="command-placeholder">tails.img</span> is the file name of the USB image that you want to resize.
ru: <span class="command-placeholder">tails.img</span> — имя файла, размер которого вы хотите изменить.

source: In *step 1*, choose **Import existing disk image**.
ru: На *шаге 1* выберите **Импорт образа диска**.

source: In *step 4*:
ru: На *шаге 4*:

source: Choose **Customize configuration before install**.
ru: Отметьте галочкой **Проверить конфигурацию перед установкой**.

source: Click **Finish** to open the configuration view.
ru: Нажмите **Готово**. Откроется окно настроек.

source: Click **Apply**.
ru: Нажмите **Применить**.

source: Click **Apply** again.
ru: Снова нажмите **Применить**.

source: Click **Begin Installation** in the top left corner to start the virtual machine.
ru: Нажмите **Начать установку** в левом верхнем углу, чтобы запустить виртуальную машину.

source: After you start on the USB image, you can [[create a Persistent Storage|first_steps/persistence]] on it.
ru: После того, как вы запустили Tails из USB-образа, можете [[создать Постоянное хранилище|first_steps/persistence]].

source: Running Tails from a USB stick
ru: Запуск Tails с USB-флешки

source: To run Tails from a USB stick using *virt-manager*, first create a virtual machine running from an ISO image as described [[above|virt-manager#iso]].
ru: Чтобы запустить Tails с USB-флешки с помощью *virt-manager*, сначала создайте виртуальную машину, работающую на основе ISO-образа, как описано [[выше|virt-manager#iso]].

source: Then do the following:
ru: Затем сделайте следующее:

source: Plug in the USB stick from which you want to run Tails.
ru: Подключите USB-флешку, с которой хотите запустить Tails.

source: Click on the **Add Hardware** button on the bottom of the left pane.
ru: Нажмите кнопку **Добавить оборудование** слева внизу.

source: Select **USB Host Device** in the left pane.
ru: В левой панели выберите **USB-устройство узла**.

source: In the right pane, click on the device from which you want to run Tails, and click **Finish**.
ru: В правой панели выберите устройство, с которого хотите запустить Tails, и нажмите **Готово**.

source: You can keep the original ISO image connected as a virtual DVD to install Tails onto the USB stick if needed.
ru: Если хотите, можете сохранить исходный ISO-образ подключённым в виде виртуального DVD-диска, чтобы при необходимости установить Tails на флешку.

source: You can also disconnect the original ISO image and start directly from the USB stick once Tails is already installed on it. To do so:
ru: Вы также можете отключить исходный ISO-образ и стартовать прямо с флешки, если на ней уже есть Tails. Для этого:

source: Shut down the virtual machine.
ru: Выключите виртуальную машину.

source: After you start on the USB device, you can [[create a Persistent Storage|first_steps/persistence]] on it.
ru: После того, как стартуете Tails с флешки, можете [[создать Постоянное хранилище|first_steps/persistence]].

source: Troubleshooting
ru: Решение проблем

source: Graphics issues
ru: Проблемы с графикой

source: Issues with graphics support in Tails running inside a virtual machine with *virt-manager* are common. The best solution can vary depending on the version of the virtualization solution and on the virtual machine configuration. For example:
ru: Проблемы с графикой в Tails, запущенной с помощью *virt-manager*, довольно распространены. Выбор решения зависит от типа виртуализации и настроек виртуальной машины. Примеры проблем:

source: The *Auto resize VM with window* feature does not work in all configurations.
ru: Функция автоматического изменения размера окна виртуальной машины работает не во всех конфигурациях.

source: The video device that provides optimal graphics performance can be different depending on the version of the host operating system.
ru: Видеоустройство, обеспечивающее оптимальную производительность графики, может зависеть от версии операционной системы хоста.

source: To troubleshoot such issues:
ru: Для устранения таких неполадок:

source: Ensure the virtual machine has a *Spice* display and a *Spice* channel configured, as opposed to *VNC* ones.
ru: Убедитесь, что в виртуальной машине настроен дисплей *Spice* и канал *Spice*, а не *VNC*.

source: Try various virtual video device models.
ru: Попробуйте разные модели виртуальных видеоустройств.

source: Start with *Virtio* and *QXL* video devices: they generally give the best results. If they don't perform well for you, try every other video device model.
ru: Начните с видеоустройств *Virtio* и *QXL*: они обычно дают наилучшие результаты. Если не получится, попробуйте другие варианты.
