Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/reset/linux.*.po
Languages: es

source: [[!meta title="Resetting a USB stick using Linux"]]
es: [[!meta title="Reiniciar un dispositivo USB usando Linux"]]

source: [[!inline pages="doc/reset.intro" raw="yes" sort="age"]]
es: [[!inline pages="doc/reset.intro.es" raw="yes" sort="age"]]

source: Using <span class="application">GNOME Disks</span>
es: Usando <span class="application">GNOME Disks</span>

source: <strong>You might overwrite any hard disk on the computer.</strong> If at some point you are not sure about which device to choose, stop proceeding.
es: <strong>Podrías sobreescribir cualquier disco de tu ordenador.</strong> Si no estás seguro del dispositivo a elegir, mejor para.

source: Make sure that the USB stick that you want to reset is unplugged.
es: Asegúrate de que el dispositivo USB que quieres resetear está desconectado.

source: 1. Choose <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Utilities</span>&nbsp;▸ <span class="guimenuitem">Disks</span> </span> to start <span class="application">GNOME Disks</span>.
es: 1. Elige <span class="menuchoice"> <span class="guimenu">Aplicaciones</span>&nbsp;▸ <span class="guisubmenu">Utilidades</span>&nbsp;▸ <span class="guimenuitem">Discos</span> </span> para iniciar <span class="application">GNOME Disks</span>.

source: A list of all the storage devices on the computer appears in the left pane of the window.
es: Una lista de todos los dispositivos de almacenamiento del ordenador aparece en el panel izquierdo de la ventana.

source: Plug the USB stick that you want to reset.
es: Conecta el dispositivo USB que quieres reiniciar.

source: A new device appears in the list of storage devices. This new device corresponds to the USB stick that you plugged in. Click on it.
es: Un nuevo dispositivo aparecerá en la lista de dispositivos de almacenamiento. Este nuevo dispositivo corresponde al dispositivo USB que has enchufado. Haz click en él.

source: In the right pane of the window, verify that the device corresponds to the USB stick that you want to reset, its brand, its size, etc.
es: En el panel de la derecha verifica que el dispositivo corresponde a la memoria USB que quieres resetear: su marca, tamaño, etc.

source: To reset the USB stick, click on the <span class="guimenu">[[!img lib/open-menu.png alt="Menu" class=symbolic link=no]]</span> button in the titlebar and choose <span class="guilabel">Format Disk…</span>.
es: Para resetear la memoria USB, selecciona el <span class="guimenu">[[!img lib/open-menu.png alt="Menú" class=symbolic link=no]]</span> botón en la barra de título y elige <span class="guilabel">Formatea…</span>.

source: In the <span class="guilabel">Format Disk</span> dialog:
es: En el diálogo <span class="guilabel">Formatea Disco</span>:

source: 1. If you want to erase all data securely, choose to **Overwrite existing data with zeroes** in the **Erase** drop-down list.
es: 1. Si quieres borrar todos los datos de modo seguro, elige **Sobreescribir los datos con ceros** en la lista **Borrar**.

source: 2. Choose **Compatible with all systems and devices (MBR/DOS)** in the **Partitioning** drop-down list.
es: 2. Elige **Compatible con todos los sistemas y dispositivos (MBR/DOS)** en la lista **Particionado**.

source: Click on the **Format…** button.
es: Haz click en el botón **Formatear…**.

source: In the confirmation dialog, click on the <span class="bold">Format</span> button to confirm.
es: En el diálogo de confirmación, haz click en el botón <span class="bold">Format</span> para confirmar.

source: To make sure that all the changes are written to the USB stick, click on the <span class="guimenu">[[!img lib/media-eject.png alt="Eject" class=symbolic link=no]]</span> button in the titlebar.
es: Para asegurarte de que se escriben todos los cambios, haz clic en el botón <span class="guimenu">[[!img lib/media-eject.png alt="Eject" class=symbolic link=no]]</span> de la barra de título.

source: Resetting a Tails USB stick from itself
es: Resetear una memoria USB Tails desde sí misma

source: If Tails is your only Linux system, you can generally reset a Tails USB stick directly from that USB stick while running Tails.
es: Si Tails es tu único sistema operativo puedes resetear el dispositivo USB directamente desde la misma memoria USB mientras lo usas.

source: When starting Tails, add the <span class="command">toram</span> boot option in the <span class="application">Boot Loader</span>. For detailed instructions, see the documentation on [[using the <span class="application">Boot Loader</span>|advanced_topics/boot_options]].
es: Cuando inicies Tails, añade la opción de arranque <span class="command">toram</span> en el <span class="application"> Gestor de Arranque</span>. Para instrucciones detalladas, lee la documentación sobre como [[usar el <span class="application">Gestor de Arranque</span>|advanced_topics/boot_options]].

source: If Tails starts as usual, follow the instructions for [[resetting a USB stick using <span class="application">GNOME Disks</span>|linux#disks]].
es: Si Tails arranca como siempre, sigue las instrucciones para [[resetear un dispositivo USB usando <span class="application">GNOME Disks</span>|linux#disks]].

source: **If the system fails to start**, that means that the computer does not have enough memory for this operation mode. Try with another computer, or find another Linux system, such as another Tails USB stick, to do the reset from.
es: **Si el sistema no arranca** eso significa que el ordenador no tiene suficiente memoria para este modo de operación. Intenta con otro ordenador, o encuentra otro sistema Linux para hacer el reset, por ejemplo otra memoria USB con Tails.
