Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/reset/mac.*.po
Languages: es

source: [[!meta title="Resetting a USB stick using macOS"]]
es: [[!meta title="Resetear una memoria USB en macOS"]]

source: [[!inline pages="doc/reset.intro" raw="yes" sort="age"]]
es: [[!inline pages="doc/reset.intro.es" raw="yes" sort="age"]]

source: <strong>You might overwrite any hard disk on the computer.</strong> If at some point you are not sure about which device to choose, stop proceeding.
es: <strong>Podrías sobreescribir cualquier disco de tu ordenador.</strong> Si no estás seguro del dispositivo a elegir, mejor para.

source: Make sure that the USB stick that you want to reset is unplugged.
es: Asegúrate de que el dispositivo USB que quieres resetear está desconectado.

source: Start <span class="application">Disk Utility</span>.
es: Iniciar <span class="application">Disk Utility</span>.

source: A list of all the storage devices on the computer appears in the left pane of the window.
es: Una lista de todos los dispositivos de almacenamiento del ordenador aparece en el panel izquierdo de la ventana.

source: Plug the USB stick that you want to reset.
es: Conecta el dispositivo USB que quieres reiniciar.

source: A new device appears in the list of storage devices. This new device corresponds to the USB stick that you plugged in. Click on it.
es: Un nuevo dispositivo aparecerá en la lista de dispositivos de almacenamiento. Este nuevo dispositivo corresponde al dispositivo USB que has enchufado. Haz click en él.

source: In the list of storage devices, verify that the device corresponds to the USB stick that you want to reset, its brand, its size, etc.
es: En la lista de dispositivos de almacenamiento, verifica que la memoria USB corresponde con el que deseas reiniciar, su marca, su tamaño, etc.

source: To reset the USB stick:
es: Para reiniciar el dispositivo:

source: a. If there is an <span class="guilabel">Erase</span> tab in the right pane, click on it and then click on the <span class="bold"> Erase</span> button on the bottom right
es: a. Si hay una pestaña de <span class="guilabel">Borrar</span> en el panel derecho, haz click en ella y luego en el botón <span class="bold"> Borrar</span> abajo del todo a la derecha.

source: b. If there is an <span class="bold"> Erase</span> button on the top middle, click on it.
es: b. Si hay un botón <span class="bold"> Borrar</span> en la parte media superior, haz click en el.

source: In the confirmation dialog, click on the <span class="bold">Erase</span> button to confirm.
es: En el dialogo de confirmación, haz click en el botón <span class="bold">Borrar</span> para confirmar.

source: <p>If the erase process fails, try [[!toggle id="format" text="formatting the USB stick using the command line"]] first.</p>
es: <p>Si falla el borrado, intenta [[!toggle id="format" text="formatear la memoria USB usando la línea de comandos"]] primero.</p>

source: Troubleshooting
es: Solución de problemas

source: Format using the command line
es: Formatear usando la línea de comandos

source: Unplug the USB stick from the computer.
es: Desconecta la memoria USB del ordenador.

source: 1. Open <span class="application">Terminal</span> from <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Utilities</span>&nbsp;▸ <span class="guimenuitem">Terminal.app</span></span>.
es: 1. Abre <span class="application">Terminal</span> desde <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Utilities</span>&nbsp;▸ <span class="guimenuitem">Terminal.app</span></span>.

source: Execute the following command:
es: Ejecuta el siguiente comando:

source: It returns a list of the storage devices on the system. For example:
es: Devuelve una lista de los dispositivos de almacenamiento del sistema. Por ejemplo:

source: Plug the USB stick in the computer.
es: Inserta la memoria USB en el ordenador.

source: Execute again the same command:
es: Ejecuta otra vez el mismo comando:

source: Your USB stick appears as a new device in the list. Check that its size corresponds to the size of your USB stick.
es: Tu memoria USB aparece como un nuevo dispositivo en la lista. Comprueba que su tamaño corresponda con el tamaño de tu memoria USB.

source: Take note of the *device name* of your USB stick. In this example, the USB stick is 8.0 GB and its device name is <span class="code">/dev/disk1</span>. Yours might be different.
es: Toma nota del *nombre de dispositivo* de tu memoria USB. En este ejemplo, la memoria USB es de 8.0 GB y su nombre de dispositivo es <span class="code">/dev/disk1</span>. El tuyo puede ser diferente.

source: <div class="caution"> <p>If you are unsure about the device name, you should stop proceeding or <strong>you risk overwriting any hard disk on the system</strong>.</p> </div>
es: <div class="caution"> <p>Si no estás seguro del nombre del dispositivo deberías parar ahora o <strong>te arriesgas a sobreescribir cualquier otro disco duro del sistema</strong>.</p> </div>

source: Execute the following command to safely remove the USB stick. Replace <span class="code">[device]</span> with the device name found in step 6.
es: Ejectura la siguiente orden para remover con seguridad la memoria USB. Reemplaza <span class="code">[dispositivo]</span> con el nombre del dispositivo encontrado en el paso 6.

source: diskutil unmountDisk [device]
es: diskutil unmountDisk [dispositivo]

source: Execute the following command to format the USB stick. Replace <span class="code">[device]</span> with the device name found in step 6.
es: Ejecuta el siguiente comando para formatear la memoria USB. Reemplaza <span class="code">[dispositivo]</span> con el nombre del dispositivo encontrado en el paso 6.

source: sudo fdisk -iy [device]
es: sudo fdisk -iy [dispositivo]

source: You can try to reset the USB stick again using <span class="application">Disk Utility</span> from the beginning of this page.
es: Puedes probar reiniciar la memoria USB de nuevo usando <span class="application">Disk Utility</span> desde el inicio de esta pagina.
