Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/reset/windows.*.po
Languages: es

source: [[!meta title="Resetting a USB stick using Windows"]]
es: [[!meta title="Reiniciar un dispositivo USB usando Windows"]]

source: [[!inline pages="doc/reset.intro" raw="yes" sort="age"]]
es: [[!inline pages="doc/reset.intro.es" raw="yes" sort="age"]]

source: <strong>The following instructions do not work on Windows XP.</strong><br/> The version of <span class="application">Diskpart</span> on Windows XP does not list removable disks.
es: <strong>Las siguientes instrucciones no funcionan en Windows XP.</strong><br/> La versión de <span class="application">Diskpart</span> en Windows XP no lista los discos removibles.

source: Using <span class="application">Diskpart</span>
es: Usando <span class="application">Diskpart</span>

source: <strong>You might overwrite any hard disk on the computer.</strong><br/> If at some point you are not sure about the disk number, stop proceeding.
es: <strong>Podrías sobrescribir cualquier disco duro en la computadora.</strong><br/> Si en algún momento no estás seguro acerca del número del disco, cancela el procedimiento.

source: Make sure that the USB stick that you want to reset is unplugged.
es: Asegúrate de que el dispositivo USB que quieres resetear está desconectado.

source: Click on the <span class="bold">Start</span> button, and choose <span class="menuchoice">All Programs&nbsp;▸ Accessories&nbsp;▸ Command Prompt</span>, to open the <span class="application">[[!wikipedia cmd.exe desc="Command Prompt"]]</span>,
es: Haz click en el botón <span class="bold">Inicio</span>, y elige <span class="menuchoice">Todos los programas&nbsp;▸ Accesorios&nbsp;▸ Símbolo de Sistema</span>, para abrir el <span class="application">[[!wikipedia_es Símbolo_del_sistema desc="Símbolo de Sistema"]]</span>,

source: [[More help on how to start the <span class="application">Command Prompt</span>|http://www.computerhope.com/issues/chdos.htm]]
es: [[Más ayuda sobre como iniciar el <span class="application">Símbolo del Sistema</span>|http://www.computerhope.com/issues/chdos.htm]]

source: 2. Execute the <span class="command">diskpart</span> command, to start <span class="application">Diskpart</span>.
es: 2. Ejecuta el comando <span class="command">diskpart</span> para iniciar <span class="application">Diskpart</span>.

source: Execute the <span class="command">list disk</span> command to obtain information about each disk in the computer.
es: Ejecuta el comando <span class="command">list disk</span> para obtener información acerca de cada disco en la computadora.

source: For example:
es: Por ejemplo:

source: Plug the USB stick that you want to reset. Run the <span class="command">list disk</span> command again.
es: Conecta la memoria USB que quieres reiniciar. Corre el comando <span class="command">list disk</span> nuevamente.

source: A new disk, which corresponds to that USB stick, appears in the list.
es: Un nuevo disco, correspondiente a esa memoria USB, aparece en la lista.

source: For example:
es: Por ejemplo:

source: Make sure that its size corresponds to the size of the USB stick that you want to reset. Note down the disk number assigned by <span class="application">Diskpart</span> to the USB stick.
es: Asegúrate que su tamaño corresponde al tamaño de la memoria USB que quieres reiniciar. Escribe el número de disco asignado por <span class="application">Diskpart</span> a la memoria USB.

source: To select the USB stick, execute the following command: <span class="command">select disk=<span class="replaceable">number</span></span>. Replace <span class="replaceable">number</span> by the disk number of the USB stick that you want to reset.
es: Para seleccionar la memoria USB, ejecuta el siguiente comando: <span class="command">select disk=<span class="replaceable">número</span></span>. Remplaza <span class="replaceable">número</span> con el número de disco de la memoria USB que deseas reiniciar.

source: Execute the <span class="command">clean</span> command to delete the partition table from the USB stick.
es: Ejecuta el comando <span class="command">limpiar</span> para borrar la tabla de partición de la memoria USB.

source: Execute the <span class="command">convert mbr</span> command to create a new partition table on the USB stick.
es: Ejecuta el comando <span class="command">convert mbr</span> para crear una nueva tabla de partición en la memoria USB.

source: Execute the <span class="command">create partition primary</span> command to create a new primary partition on the USB stick.
es: Ejecuta el comando <span class="command">create partition primary</span> para crear una nueva partición primaria en la memoria USB.

source: Troubleshooting
es: Solución de problemas

source: See the [[Diskpart documentation from Microsoft Support|http://support.microsoft.com/kb/300415]].
es: Mira la [[documentación de Diskpart del Soporte de Microsoft|http://support.microsoft.com/kb/300415]].
