Repository: KaushalIngle/CuOS
Catalog: wiki/src/security/noscript_disabled_*_tor_browser.*.po
Languages: fr

source: [[!meta title="Tor Browser not safe without manual action"]]
fr: [[!meta title="Navigateur Tor non sûr sans une action manuelle"]]

source: <div class="caution">Tor Browser in Tails 3.13.1 is not safe to use without taking the manual steps listed below each time you start Tails!</div>
fr: <div class="caution">Le Navigateur Tor dans Tails 3.13.1 n'est pas sûr à utiliser sans effectuer une étape manuelle listée plus bas, à chaque fois que vous démarrez Tails !</div>

source: Starting from Friday May 3, a problem in *Firefox* and *Tor Browser* disabled all add-ons, especially *NoScript* which is used to:
fr: A partir du vendredi 3 mai, un problème dans *Firefox* et le *Navigateur Torr* a désactivé toutes les extensions, notamment *NoScript* qui est utilisé pour :

source: Strengthen *Tor Browser* against some JavaScript attacks that can lead to compromised accounts and credentials on websites.
fr: Renforcer le *Navigateur Tor* contre certaines attaques JavaScript qui peuvent conduire à compromettre les comptes et accès de certains sites web.

source: Enable or disable JavaScript on some websites using the *NoScript* interface, if you use it.
fr: Activer ou désactiver JavaScript sur certains sites web en utilisant l'interface *NoScript*, si vous l'utilisez.

source: If *NoScript* is activated, the *NoScript* icon appears in the top-right corner and *Tor Browser* is safe:
fr: Si *NoScript* est activé, l'icône *NoScript* apparaît dans le coin en haut à droite et le *Navigateur Tor* est sûr :

source: If *NoScript* is deactivated, the *NoScript* icon is absent from the top-right corner and *Tor Browser* is unsafe:
fr: Si *NoScript* est désactivé, l'icône *NoScript* est absente du coin en haut à droite et le *Navigateur Tor* n'est pas sûr :

source: Activate *NoScript* manually
fr: Activer *NoScript* manuellement

source: To secure *Tor Browser* in Tails 3.13.1 or earlier, you must activate *NoScript* every time you start Tails:
fr: Pour sécuriser *Tor Browser* dans Tails 3.13.1 ou antérieur, vous devez activer *NoScript* à chaque fois que vous démarrez Tails :

source: Open the address <span class="command">about:config</span> in *Tor Browser*.
fr: Taper l'adresse <span class="command">about:config</span> dans le *Navigateur Tor*.

source: Click the **I accept the risk!** button.
fr: Cliquer sur le bouton **Je prends le risque**.

source: At the top of the page, search for <span class="command">xpinstall.signatures.required</span>.
fr: En haut de la page, rechercher <span class="command">xpinstall.signatures.required</span>.

source: Double-click on the **xpinstall.signatures.required** line in the results to set its value to **false**.
fr: Double-cliquer sur la ligne **xpinstall.signatures.required** dans les résultats pour mettre la valeur à **false**.

source: Verify that *NoScript* is activated again.
fr: Vérifier que *NoScript* est à nouveau activé.
