Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/sensitive_documents/metadata.*.po
Languages: ru

source: [[!meta title="Removing metadata using mat2"]]
ru: [[!meta title="Удаление метаданных с помощью mat2"]]

source: What is metadata?
ru: Что такое метаданные?

source: Metadata is "data about data" or "information about information" that is embedded in computer files, usually automatically. Metadata is used to describe, identify, categorize, and sort files.
ru: Метаданные — «данные о данных», которые обычно автоматически встраиваются в компьютерные файлы. Метаданные используются для описания, идентификации, классификации и сортировки файлов.

source: However, metadata can also be used to deanonymize users and expose private information.
ru: Увы, метаданные иногда также деанонимизируют пользователей и раскрывают приватную информацию.

source: Examples of metadata include:
ru: Есть много примеров метаданных.

source: To learn more about how metadata can be used to identify and reveal personal information, see [Behind the Data: Investigating metadata](https://exposingtheinvisible.org/en/guides/behind-the-data-metadata-investigations/).
ru: О том, как метаданные могут использоваться для идентификации и раскрытия личной информации, см. [Что стоит за данными: исследование метаданных](https://exposingtheinvisible.org/en/guides/behind-the-data-metadata-investigations/).

source: Removing metadata from files ==========================
ru: Удаление метаданных из файлов ==========================

source: Tails includes <a href="https://0xacab.org/jvoisin/mat2"><span class="application">mat2</span></a> so you can remove metadata from files before you publish or share them.
ru: Tails включает инструмент <a href="https://0xacab.org/jvoisin/mat2"><span class="application">mat2</span></a>, который позволяет удалять метаданные из файлов перед публикацией или расшариванием.

source: <span class="application">mat2</span> works on many file formats, including:
ru: <span class="application">mat2</span> работает с множеством файловых форматов. Вот некоторые:

source: image files, such as .jpeg, .png, and .gif
ru: изображения, например, .jpeg, .png, .gif;

source: <span class="application">LibreOffice</span> files, such as .odt and .ods
ru: файлы <span class="application">LibreOffice</span> (.odt, .ods и др.);

source: <span class="application">Microsoft Office</span> documents, such as .docx, .xlsx, and .pptx
ru: документы <span class="application">Microsoft Office</span> (.docx, .xlsx, .pptx и др.);

source: audio files, such as .mp3, .flac, and .ogg
ru: аудиофайлы, такие как .mp3, .flac и .ogg;

source: video files, such as .mp4 and .avi
ru: видеофайлы, например, .mp4 и.avi;

source: archive files, such as .zip and .tar
ru: файлы архивов, в частности, .zip и .tar.

source: To use <span class="application">mat2</span> to remove metadata from your files:
ru: Ниже описано, как удалить метаданные с помощью <span class="application">mat2</span>.

source: Open the <span class="application">Files</span> browser.
ru: Откройте файловый менеджер <span class="application">Файлы</span>.

source: Navigate to the folder containing the files that you want to remove metadata from.
ru: Перейдите в папку с файлами, из которых хотите удалить метаданные.

source: Select the files that you want to remove metadata from.
ru: Выберите файлы, из которых хотите удалить метаданные.

source: Right-click (on Mac, click with two fingers) on the files and choose <span class="guimenuitem">Remove metadata</span>.
ru: Щёлкните правой кнопкой мыши (на компьютере Mac двумя кнопками) по файлам и выберите <span class="guimenuitem">Remove metadata</span>.

source: <p>It is impossible to reliably find and remove all metadata in complex file formats. For example, <i>Microsoft Office</i> documents can contain embedded images, audio, and other files containing their own metadata that <i>mat2</i> cannot remove.</p>
ru: <p> Нельзя быть совершенно уверенным в том, что вы найдёте и удалите все метаданные в файлах сложных форматов. Например, документы <i>Microsoft Office</i> могут содержать встроенные изображения, аудио и другие файлы, содержащие собственные метаданные, с которыми <i>mat2</i> не справится.</p>

source: <p>You should run <i>mat2</i> on any files before you embed them into another document.</p>
ru: <p>Есть смысл обрабатывать файл с помощью <i>mat2</i>, прежде чем вставлять его в другой документ.</p>

source: <p>Also, you should save files in simpler formats whenever possible. For example, instead of saving a text document as a .docx file, you can save the document as a plain .txt file.</p>
ru: <p>Чем проще формат сохранения файла, тем лучше. Например, простой текстовый документ можно сохранить не в .docx, а в .txt.</p>
