Repository: KaushalIngle/CuOS
Catalog: wiki/src/doc/anonymous_internet/tor/circuits.*.po
Languages: fr, it, ru

source: [[!meta title="Viewing the circuits of Tor"]]
fr: [[!meta title="Voir les circuits de Tor"]]
it: [[!meta title="Vedere i circuiti diTor"]]
ru: [[!meta title="Просмотр цепочек Tor"]]

source: <span class="application">Onion Circuits</span> displays information about the current Tor circuits and connections.
fr: <span class="application">Circuits oignon</span> affiche des informations à propos du statut de Tor et des connexions.
it: <span class="application">Circuiti Onion</span> visualizza informazioni sullo stato dei circuiti e delle connessioni di Tor.
ru: Информацию о текущем подключении и цепочке Tor можно увидеть в приложении <span class="application">Onion Circuits</span>.

source: To open <span class="application">Onion Circuits</span>, click on the Tor status icon in the top-right corner and choose <span class="guimenuitem">Open Onion Circuits</span>.
fr: Pour ouvrir <span class="application">Circuits oignon</span>, cliquez sur l'icône de statut de Tor dans le coin supérieur droit puis sur <span class="guimenuitem">Ouvrir Circuits oignon</span>.
it: Per aprire <span class="application">Onion Circuits</span>, clicca sull'icona Tor status nell'angolo in alto a destra e scegli <span class="guimenuitem">Open Onion Circuits</span>.
ru: Чтобы открыть <span class="application">Onion Circuits</span>, нажмите на значок Tor в правом верхнем углу и выберите <span class="guimenuitem">Open Onion Circuits</span>.

source: The circuits established by Tor are listed in the left pane. A Tor circuit is made of three relays:
fr: Les circuits établis par Tor sont listés dans le panneau de gauche. Un circuit Tor est constitué de trois relais :
it: I circuiti stabiliti da Tor sono elencati nel pannello di sinistra. Un circuito Tor è costituito di tre relay:
ru: В левой части окна показаны цепочки Tor. Цепочка Tor состоит из трёх узлов:

source: The first relay or *entry guard*. If you configured Tor bridges, one of your bridges is the first relay.
fr: Un premier relais ou *garde d'entrée* (« entry guard »). Si vous avez configuré des ponts Tor, un de ces ponts est votre premier relais.
it: Il primo relay o *entry guard* (bastione d'entrata). Se hai configurato dei Tor Bridge (ponti Tor), uno dei tuoi ponti è il primo relay.
ru: Первый узел (входной или *сторожевой*). Если вы подключались к Tor через мост, он и станет первым узлом.

source: The second relay or *middle node*.
fr: Un second relais ou *nœud du milieu*.
it: Il secondo relay o *nodo di mezzo*.
ru: Второй узел — промежуточный, *средний*.

source: The exit node.
fr: Un nœud de sortie.
it: L'exit node o nodo d'uscita.
ru: Выходной узел.

source: When you connect to a destination server, for example, when visiting a website, the connection appears in the list below the circuit it uses.
fr: Lorsque vous vous connectez à un serveur de destination, par exemple en visitant un site web, la connexion apparaît dans la liste sous le circuit qu'elle emprunte.
it: Quando ti connetti a un server di destinazione, ad esempio visitando un sito web, la connessione appare nella lista sotto il circuito da essa utilizzato.
ru: Когда вы подключаетесь к желаемому серверу, например, если заходите на веб-сайт, это подключение отображается в списке под соответствующей цепочкой.

source: In the example above, the connection to <span class="code">check.torproject.org</span> goes through the relays <span class="guilabel">tor7kryptonit</span>, <span class="guilabel">Casper03</span>, and the exit node <span class="guilabel">blackfish</span>.
fr: Dans l'exemple ci-dessous, la connexion vers <span class="code">check.torproject.org</span> passe par les relais <span class="guilabel">tor7kryptonit</span>, <span class="guilabel">Casper03</span>, et le nœud de sortie <span class="guilabel">blackfish</span>.
it: Nell'esempio sopra, la connessione a <span class="code">check.torproject.org</span> attraversa i relay <span class="guilabel">tor7kryptonit</span>, <span class="guilabel">Casper03</span>, e il nodo d'uscita <span class="guilabel">blackfish</span>.
ru: В примере выше соединение с <span class="code">check.torproject.org</span> проходит через узлы <span class="guilabel">tor7kryptonit</span>, <span class="guilabel">Casper03</span> и выходной узел <span class="guilabel">blackfish</span>.

source: If you click on a circuit, technical details about the relays of the circuit appear in the right pane.
fr: Si vous cliquez sur un circuit, des informations techniques à propos des relais le composant apparaissent dans le panneau de droite.
it: Se fai clic su un circuito, nel pannello di destra appaiono delle informazioni tecniche sui relay del circuito.
ru: Если щёлкнуть по схеме, технические детали об узлах появятся в правой панели.

source: [[!img doc/anonymous_internet/tor/tor.svg link="no" alt="Schematics of a connection to Tor with the client, the 3 relays, and the destination server."]]
fr: [[!img doc/anonymous_internet/tor/tor.svg link="no" alt="Schéma d'une connexion vers Tor montrant le client, les trois relais, et le serveur de destination."]]
it: [[!img doc/anonymous_internet/tor/tor.svg link="no" alt="Schema di una connessione a Tor con il client, i 3 relays, e il server di destinazione."]]
ru: [[!img doc/anonymous_internet/tor/tor.svg link="no" alt="Схемы подключения к Tor с клиентом, тремя узлами и искомым сервером"]]
