Repository: KaushalIngle/CuOS
Catalog: wiki/src/news/achievements_*_2019.*.po
Languages: fr

source: [[!meta title="Our achievements in 2019"]]
fr: [[!meta title="Nos réalisations en 2019"]]

source: On October 7, we started our [[yearly donation campaign|news/2019-fundraiser]]. Today, we summarize what we achieved with your help in 2019.
fr: Le 7 octobre, nous avons commencé notre [[campagne de dons annuelle|news/2019-fundraiser]]. Aujourd'hui, nous résumons ce que nous avons réalisé avec votre aide en 2019.

source: If you liked our work in 2019, please take a minute to donate and make Tails thrive in 2020!
fr: Si vous avez aimé notre travail en 2019, merci de prendre une minute pour faire un don et faire prospérer Tails en 2020 !

source: Easier adoption by new users
fr: Appropriation plus facile pour les nouvelles personnes utilisant Tails

source: In 2019, we focused on fewer but critical features to make Tails easier to discover and adopt for first time users.
fr: En 2019, nous nous sommes concentrés sur des fonctionnalités moins nombreuses, mais importantes pour rendre Tails plus aisé à découvrir et à prendre en main.

source: In January, we completely changed the Tails installation procedure. Tails is now downloaded as a *USB image*: an exact copy of the data as it is written to the USB stick.
fr: En janvier, nous avons complètement modifié la procédure d'installation de Tails. Tails est maintenant téléchargeable en tant qu'*image USB* : une copie exacte des données qui seront écrites sur la clé USB.

source: Then, we improved our documentation to help first time users with their Tails installation:
fr: Donc, nous avons amélioré notre documentation pour aider les nouvelles personnes dans leur installation de Tails :

source: As a consequence, more people than ever are using Tails:
fr: Par conséquent, plus de personnes que jamais utilisent Tails :

source: - Tails is used nearly 25 000 times every day worldwide. That's 15% more than in August 2018.
fr: - Tails est utilisé près de 25000 fois chaque jour dans le monde. C'est 15% de plus qu'en août 2018.

source: The percentage of people using Tails on Mac more than doubled since January 2019.
fr: Le pourcentage de personnes utilisant Tails sur Mac a plus que doublé depuis janvier 2019.

source: To continue making Tails more accessible to users globally, we built a [[translation platform|https://translate.tails.boum.org/]] for our website. Since then, people started translations in Arabic, Catalan, Traditional and Simplified Chinese, Polish, Russian, Serbian, and Turkish.
fr: Pour continuer de rendre Tails plus accessible à travers le monde, nous avons mis en place une [[plate-forme de traduction|https://translate.tails.boum.org/]] pour notre site Web. Depuis, des personnes ont commencé des traductions en Arabe, Catalan, Chinois traditionnel et simplifié, Polonaiss, Russe, Serbe et Turc.

source: We also improved a lot the usability of the Welcome Screen for non-English users in [[Tails 4.0|version_4.0#greeter]].
fr: Nous avons également amélioré l'ergonomie de l'écran de bienvenue pour les personnes non anglophones dans [[Tails 4.0|version_4.0#greeter]].

source: Maintenance work
fr: Travail de maintenance

source: 2019 was also a year of heavy maintenance work, as always. Keeping alive a tool like Tails consists mostly of many tasks that are not very exciting: publishing new releases every 6 weeks, updating Tails and our infrastructure to new versions of Debian and other software that we use, fixing small issues as they are reported to us, and implementing the many small improvements that make Tails easier to use.
fr: 2019 a également été une année de gros travaux de maintenance, comme toujours. Faire vivre un outil comme Tails consiste généralement en plein de tâches qui ne sont pas très passionnantes : publier de nouvelles versions toutes les six semaines, mettre à jour Tails et notre infrastructure avec les nouvelles versions de Debian et des autres logiciels que nous utilisons, corriger les petits problèmes qui nous sont signalés et implémenter de nombreuses petites améliorations qui rendent Tails plus facile à utiliser.

source: In October, we released [[Tails 4.0|version_4.0]], which is the first version of Tails based on Debian 10 (Buster).
fr: En octobre, nous avons publié [[Tails 4.0|version_4.0]], qui est la première version de Tails basée sur Debian 10 (Buster).

source: Tails 4.0 was our most important release in years. Tails 4.0 adds KeePassXC, OnionShare 1.3.2, fixes Electrum, updates to Debian 10 and GNOME 3.30, starts faster and uses less memory.
fr: Tails 4.0 est notre plus importante version de ces dernières années. Tails 4.0 ajoute KeePassXC, OnionShare 1.3.2, corrige Electrum, met à jour vers Debian 10 et GNOME 3.30, démarre plus vite et utilise moins de mémoire.

source: We released 13 new versions of Tails to deliver improvements and security fixes as soon as possible.
fr: Nous avons publié 13 nouvelles versions de Tails pour fournir des améliorations et des correctifs de sécurité le plus rapidement possible.

source: We published more emergency releases than ever before: 5 emergency releases to fix 5 critical security vulnerabilities in Firefox and Tor Browser and always keep Tails as secure as possible.
fr: Nous avons publié plus de version d'urgence que jamais auparavant : cinq versions d'urgence pour corriger cinq vulnérabilités de sécurité critiques dans Firefox et le navigateur Tor et ainsi garder Tails aussi sûr que possible.

source: We removed less popular software and localization packages, which you can now install yourself using the [[Additional Software|doc/first_steps/additional_software]] feature. Optimizations like these made the USB image of Tails 4.0 47 MB smaller than Tails 3.6, which was the bigger release ever.
fr: Nous avons enlevé les logiciels et les paquets de langues les moins populaires, que vous pouvez maintenant installer vous-mêmes avec la fonction [[Logiciels additionnels|doc/first_steps/additional_software]]. Ces optimisations ont permis de rendre l'image USB de Tails 4.0 47Mo plus petite que celle de Tails 3.6, qui était la plus grosse version jamais publiée.

source: Tails depends on a wider ecosystem of Free Software and privacy tools. We continuously contribute improvements to other projects which are either included in Tails or used on our infrastructure. Some of these projects, that we call "upstream", are:
fr: Tails dépend d'un écosystème plus large de logiciels libres et d'outil de vie privée. Nous apportons continuellement des améliorations aux autres projets qui sont inclus dans Tails ou utilisés dans notre infrastructure. Certains de ces projets, que nous appelons projets « en amont » sont :

source: We had to temper several [[!wikipedia Denial-of-service_attack desc="distributed denial-of-service (DDoS)"]] attacks targeting our infrastructure.
fr: Nous avons dû faire face à plusieurs attaques [[!wikipedia_fr Attaque_par_déni_de_service desc="par déni de service distribué (distributed denial-of-service – DDoS)"]] visant notre infrastructure.

source: For 9 years, we have been relying on the hosting services provided by the fine people of boum.org. Thank you! As they were reducing their activities, we had to migrate our services. Our website is now self-hosted and our mailing-lists are taken care of by 2 experienced and trusted autonomous server projects: [autistici.org](https://autistici.org) and [puscii.nl](https://puscii.nl).
fr: Pendant 9 ans, nous avons compté sur les services d'hébergement fournis par les merveilleuses personnes de boum.org. Merci ! Comme elles réduisent leurs activités, nous avons migré nos services. Notre site Web est maintenant auto-hébergé et nos listes de discussion par courrier électronique sont prises en charge par deux projets de serveurs autonomes de confiance et expérimentés : [autistici.org](https://autistici.org) et [puscii.nl](https://puscii.nl).

source: Community
fr: Communauté

source: Over the years, Tails has been able to gather a lively community which is growing, evolving, and deserves care.
fr: Au fil des ans, Tails a réussi à rassembler une communauté vivante qui grandit, évolue et mérite attention.

source: We published a statement of our [[mission and values|contribute/mission]] to help us clarify who we are, what we stand for, and what we want to do for our users.
fr: Nous avons publié une déclaration sur nos [[missions et valeurs|contribute/mission]] pour nous aider à clarifier qui nous sommes, ce que nous défendons et ce que nous voulons faire pour les personnes utilisant Tails.

source: We agreed on [[user personas|contribute/personas]], fictitious but concrete representations of the people using Tails. We use these personas to keep in mind who we are working for, what are their needs, and what Tails should do for them.
fr: Nous nous sommes mis d'accord sur des [[profils d'utilisateurs|contribute/personas]], fictifs mais qui sont des représentations concrètes des personnes qui utilisent Tails. Nous utilisons ces personnages pour garder à l'esprit pour qui nous travaillons, quels sont leurs besoins et ce que Tails peut faire pour eux.

source: We attended 9 conferences and connected to Free Software and Internet freedom communities in 9 different countries, including FOSDEM (Belgium), Internet Freedom Festival (Spain), Tor Meeting (Sweden), OTF Summit (Taiwan), DebConf (Brazil), and MozFest (UK).
fr: Nous avons assisté à neuf conférences et pris contact avec les communautés des libertés sur Internet et du logiciel libre dans neuf pays différents, notamment FOSDEM (Belgique), Internet Freedom Festival (Espagne), Tor Meeting (Suède), OTF Summit (Taïwan), DebConf (Brésil) et MozFest (Angleterre).

source: The wider Tails community organized 10 workshops to present Tails to new users in North and South America, Europe, and East and South-East Asia.
fr: La large communauté Tails a organisé dix ateliers pour présenter Tails à des nouvelles personnes en Amérique du sud et du nord, en Europe et dans l'Asie de l'est et du sud-est.

source: We answered 883 bug reports through our help desk and helped all these people to be safer online.
fr: Nous avons répondu à 883 rapports de bugs via notre centre d'assistance et aidé toutes ces personnes à rester en sûreté en ligne.

source: - 2 new workers joined our help desk and sysadmin teams.
fr: - deux nouvelles personnes ont rejoint notre centre d'assistance et notre équipe d'administration du système.

source: All of this is made possible by donations from people like you. And because these help us to plan our work, we particularly appreciate monthly and yearly donations, even the smallest ones.
fr: Toute cela a été rendu possible par des dons de personnes comme vous. Et parce que cela nous aide à planifier notre travail, nous apprécions particulièrement les dons mensuels et annuels, même les plus petits d'entre eux.

source: If you liked our work in 2019, please take a minute to donate and make us thrive in 2020!
fr: Si vous aimez notre travail en 2019, merci de prendre une minute pour faire un don et nous faire prospérer en 2020 !

source: <div class="donate-button"><a href="https://tails.boum.org/donate/?r=2019-achievements">Donate</a></div>
fr: <div class="donate-button"><a href="https://tails.boum.org/donate/?r=2019-achievements">Faire un don</a></div>
