Repository: KaushalIngle/CuOS
Catalog: wiki/src/news/additional_software_ux_design.*.po
Languages: fr

source: [[!meta title="Berliners, come test new features with us (again) and get a T-shirt!"]]
fr: [[!meta title="Berlinois et Berlinoises, venez (à nouveau) tester de nouvelles fonctionnalités avec nous et obtenez un T-shirt !"]]

source: We are working on making it much easier to **permanently install additional software in Tails**.
fr: Nous travaillons actuellement pour rendre plus facile **l'installation de logiciels supplémentaires de manière permanente dans Tails**.

source: We want to test our design with users to make sure that it is really easy to use.
fr: Nous souhaitons tester notre conception avec les personnes utilisant Tails pour nous assurer la facilité d'usage.

source: Don't be shy! It will be a great opportunity to contribute to world-class privacy software like Tails, even if you don't feel really tech-savvy.
fr: Ne soyez pas timides ! C'est une excellente opportunité pour contribuer à un projet de vie privée d'envergure internationale comme Tails, même si vous n'êtes pas vraiment technophile ou ayant un profil technique.

source: The tests will take place in Berlin (Wedding) in January on:
fr: Les tests auront lieu à Berlin (Wedding) en janvier les :

source: - Saturday 27 - Sunday 28 - Monday 29
fr: - Samedi 27 - Dimanche 28 - Lundi 29

source: Plan to stay with us for 1 hour.
fr: Prévoyez de rester avec nous pendant 1 heure.

source: We will give you a Tails T-shirt as a token of our thanks.
fr: Nous vous donnerons un T-shirt Tails en remerciement.

source: Please, take this survey so we can organize our schedule:
fr: Merci de répondre à ce sondage pour que nous puissions organiser le calendrier :

source: <strike>https://survey.tails.boum.org/</strike> (We have enough people already!)
fr: <strike>https://survey.tails.boum.org/</strike> (Nous avons déjà assez de personnes !)

source: And if you can't come, maybe you can share this with 2-3 other people in Berlin?
fr: Et si vous ne pouvez pas venir, vous pouvez peut-être partager cela avec 2 ou 3 autres personnes à Berlin ?
