Repository: KaushalIngle/CuOS
Catalog: wiki/src/news/and_the_winner_*.*.po
Languages: fr

source: [[!meta title="And the winner is..."]]
fr: [[!meta title="Et le gagnant est..."]]

source: Our [[logo contest|logo_contest]] ended up a few days ago. Since then, 11 regular Tails contributors voted on the [[!tails_blueprint logo desc="36 proposals"]].
fr: Notre [[concours de création de logo|logo_contest]] s'est terminé il y a quelques jours. Depuis, 11 personnes contribuant régulièrement à Tails ont votés pour les [[!tails_blueprint logo desc="36 propositions"]].

source: Winner
fr: Gagnant

source: The winning proposal is the one by [[!tails_blueprint logo#tchou desc="Tchou"]].
fr: La proposition retenue est celle proposée par [[!tails_blueprint logo#tchou desc="Tchou"]].

source: We commented on the initial version and we already came up with an improved version: [[!tails_blueprint logo/tchou-improved.png]]
fr: Nous avons commenté la première version et pouvons vous présenter la version améliorée : [[!tails_blueprint logo/tchou-improved.png]]

source: Congratulations!
fr: Félicitations !

source: In the coming days we will keep on fine-tuning it and integrating it in time for Tails 1.0. So don't hesitate to comment on it.
fr: Pendant les prochains jours, nous allons terminer les dernières finitions sur le logo et l'intégrer à Tails 1.0. N'hésitez pas à le commenter.

source: Six other great proposals made it to the top 7:
fr: Six autres excellentes propositions rassemblée dans un top 7 :

source: 2nd: tie between [[!tails_blueprint logo#andrew desc="Andrew"]] and [[!tails_blueprint logo#joe desc="Joe"]]
fr: Second : Ex aequo entre [[!tails_blueprint logo#andrew desc="Andrew"]] et [[!tails_blueprint logo#joe desc="Joe"]]

source: 4th: tie between [[!tails_blueprint logo#jared desc="Jared"]] and [[!tails_blueprint logo#renato desc="Renato"]]
fr: Quatrième : Ex aequo entre [[!tails_blueprint logo#jared desc="Jared"]] et [[!tails_blueprint logo#renato desc="Renato"]]

source: 6th: tie between [[!tails_blueprint logo#mewchan desc="MewChan, hiding cat"]] and [[!tails_blueprint logo#christopher desc="Christopher"]]
fr: Sixième : Ex aequo entre [[!tails_blueprint logo#mewchan desc="MewChan, hiding cat"]] et [[!tails_blueprint logo#christopher desc="Christopher"]]

source: This [[!tails_blueprint logo/top7.pdf desc="PDF"]] shows a graph of how many voters preferred a given proposal to another one.
fr: Ce [[!tails_blueprint logo/top7.pdf desc="PDF"]] montre un graphique du nombre de votants pour chaque proposition.

source: We reiterate our thanks to the 31 designers who worked for this contest to be such a success.
fr: Nous réitérons nos remerciements aux 31 graphistes qui ont fait le succès de ce concours.
