Repository: KaushalIngle/CuOS
Catalog: wiki/src/news/closing_tails-support.*.po
Languages: fr, zh_tw

source: [[!meta title="Closing tails-support@boum.org"]]
fr: [[!meta title="Fermeture de tails-support@boum.org"]]
zh_tw: [[!meta title="關閉 tails-support@boum.org"]]

source: We decided to close tails-support@boum.org, the public mailing list for user support which [was created in 2013](https://tails.boum.org/news/tails-support/) after closing the forum that we had on this website.
fr: Nous avons décidé de fermer tails-support@boum.org, la liste publique de courrier électronique pour l'assistance aux personnes utilisant Tails qui [a été créée en 2013](https://tails.boum.org/news/tails-support/) après avoir fermé le forum que nous avions sur ce site web.
zh_tw: 我們決定關閉 tails-support@boum.org 這個公開的使用者支援群件群組，它[創建於2013年](https://tails.boum.org/news/tails-support/) ，當時我們關閉了官網上的論壇。

source: The idea behind having a public space for user support was to:
fr: L'idée de disposer d'un espace public d'assistance était de :
zh_tw: 希望有一個公開空間提供使用者支援的背後想法是：

source: Reduce the amount of work for our help desk behind [[tails-support-private@boum.org|about/contact#tails-support-private]] (which is encrypted and also receives [[*WhisperBack* reports|doc/first_steps/bug_reporting]]).
fr: Réduire la quantité de travail de notre équipe d'assistance derrière [[tails-support-private@boum.org|about/contact#tails-support-private]] (qui est chiffrée et qui reçoit aussi les [[rapports *WhisperBack*|doc/first_steps/bug_reporting]]).
zh_tw: 為了減少[[tails-support-private@boum.org|about/contact#tails-support-private]]幫助服務台的工作量，(這個電郵會經過加密與接收 [[*WhisperBack* 報告|doc/first_steps/bug_reporting]]).

source: This is not really working as tails-support-private@boum.org still has 12 times more traffic than tails-support@boum.org.
fr: Cela ne fonctionne pas vraiment puisque tails-support-private@boum.org reçoit encore 12 fois plus de trafic que tails-support@boum.org.
zh_tw: 但似乎行不通，因為 tails-support-private@boum.org 仍然會 比 tails-support@boum.org 收到多出12倍的郵件量。

source: - Build a community of people doing user support outside of our team.
fr: - Construire une communauté de personnes faisant du support en-dehors de notre équipe.
zh_tw: - 除了原本的核心團隊外能組建一個社群來支援使用者。

source: This is not really working either as most of the threads are still answered by our help desk or other core contributors.
fr: Cela ne fonctionne pas vraiment puisque la plupart des discussions sont encore traitées par notre propre équipe d'assistance ou par des personnes contribuant déjà beaucoup.
zh_tw: 這個似乎行不通，因為大部份的討論串仍然 得透過我們的幫助前台或其它 核心貢獻者來回答。

source: - Build a public database to make it easy to consult or reuse previous answers.
fr: - Construire une base de données publique pour rendre plus facile la consultation ou la réutilisation des réponses déjà données.
zh_tw: - 建立一個公閧的資料庫讓人們容易諮詢或重覆使用過去的解答。

source: This is not really working either as the archive of the mailing list are hard to search and reuse and it's easier to point people to the documentation, known issues, or FAQ.
fr: Cela ne fonctionne pas vraiment puisque la recherche dans les archives de la liste de courrier électronique est difficile à faire et à réutiliser et il est plus facile d'orienter les personnes vers la documentation, les problèmes connus, ou la FAQ.
zh_tw: 這個方式行不通，而過往郵件的檔案庫 也很難搜尋和重新使用，它比較易於告訴人們 文件、已知的問題或常見問題等訊息。

source: Having a public mailing list also makes it:
fr: Avoir une liste de courrier électronique fait aussi que :
zh_tw: 有一個公開的郵件群組也讓它：

source: Complicated to make sure that both the list and the sender receive our answers.
fr: Il est compliqué d'être certain que la liste et l'expéditeur ont reçus nos réponses.
zh_tw: 很難能確保二個郵件群組的送者都可以接收到我們的回覆。

source: Sensitive to ask for more technical information about the problem, such as logs, as they are harder for the person reporting the error to share with us and also raises privacy concerns.
fr: Il est délicat de demander plus d'informations techniques sur le problème, comme des fichiers journaux, car il est plus difficile de demander à la personne rapportant l'erreur de les partager avec nous tout en maîtrisant les problèmes de confidentialité.
zh_tw: 敏感地詢問更多技術上資訊，例如日誌記錄、這是難以讓人將其報告錯誤分享給我們，也易引起隱私上的疑慮。

source: Duplicate work between tails-support-private@boum.org and tails-support@boum.org as people often write to both.
fr: Il génère du travail en double car les personnes écrivent souvent aux deux listes tails-support-private@boum.org et tails-support@boum.org.
zh_tw: tails-support-private@boum.org 與 tails-support@boum.org 之間重覆的內容讓工作人員必須付出雙倍的力氣。

source: The major downside of closing tails-support@boum.org is that it was a good place for developers to have some feedback on the recurrent problems faced by users. We want to solve this while working on a [request tracker for our help desk](https://tails.boum.org/blueprint/RT_for_help_desk/).
fr: L'inconvénient majeur de fermer tails-support@boum.org est que c'était un bon endroit pour que l'équipe de développement aient des retours sur les problèmes récurrents rencontrés par les personnes utilisant Tails. Nous voulons résoudre ce problème en travaillant sur la mise en place d'un [outil de suivi de tickets pour notre équipe d'assistance](https://tails.boum.org/blueprint/RT_for_help_desk/).
zh_tw: 關閉 tails-support@boum.org 最大遺感是它曾是一個讓開發人員能直接從使用者了解目前他們所遇到的問題是什麼。我們希望能解決它並同時透過 [在幫助前台請求問題追踪](https://tails.boum.org/blueprint/RT_for_help_desk/).

source: See you on [[tails-support-private@boum.org|about/contact#tails-support-private]]!
fr: On se voit sur [[tails-support-private@boum.org|about/contact#tails-support-private]] !
zh_tw: 未來請利用 [[tails-support-private@boum.org|about/contact#tails-support-private]]!
