Repository: KaushalIngle/CuOS
Catalog: wiki/src/news/improve_the_infrastructure_behind_Tails.*.po
Languages: fr

source: [[!meta title="Call for help: improve the infrastructure behind Tails"]]
fr: [!meta title="Appel à l'aide : améliorer l'infrastructure derrière Tails"]]

source: Tails is becoming increasingly popular: lately, someone boots Tails every ten seconds somewhere in the world. And also, every six weeks, there is a Firefox security update and we subsequently release a new version of Tails.
fr: Tails devient de plus en plus populaire : ces derniers temps, une personne lance Tails toute les dix secondes quelque part dans le monde. De plus, une mise à jour de sécurité de Firefox paraît toutes les six semaines et nous sortons consécutivement une nouvelle version de Tails.

source: Because of that amount of users and such a short release cycle, it is a challenge to keep Tails alive and getting better.
fr: A cause de ce nombre de personnes et d'un cycle de publications aussi court, c'est un défi de maintenir et vie et d'améliorer Tails.

source: We needs more hands!
fr: Il nous faut plus de bras !

source: Among the things we know [[!tails_roadmap desc="we should do in the next few years"]], we have identified some areas that could benefit the most from new dedicated contributors.
fr: Parmi les choses que nous savons [[!tails_roadmap desc="que nous devrions faire dans les prochaines années"]], nous avons identifié certains des domaines qui pourraient tirer le plus de bénéfices de la venue de nouveaux contributeurs dévoués.

source: Today, we are talking of **improving the infrastructure behind Tails**. So, if you are a system administrator, a software developer, or anything in between, we need you! Please read on.
fr: Aujourd'hui, nous parlons d'**améliorer l'infrastructure derrière Tails**. Donc, si vous êtes une personne qui fait de l'administration système, une personne qui développe du logiciel ou quoi que ce soit entre les deux, nous avons besoin de nous ! S'il vous plaît continuez à lire.

source: What is the mission?
fr: Quelle est la mission ?

source: The Tails [[system administrators|contribute/working_together/roles/sysadmins]] set up and maintain the infrastructure that supports the development and operations of Tails. We aim at making the life of Tails contributors easier, and to improve the quality of our releases.
fr: Les personnes qui font l'[[administration système|contribute/working_together/roles/sysadmins]] de Tails mettent en place et assurent la maintenance de l'infrastructure qui soutient le développement et les opérations de Tails. Notre but est de rendre la vie des personnes qui contribuent à Tails plus facile, et d'améliorer la qualité de nos versions.

source: Our main tools are: Debian, Puppet, Git and Jenkins.
fr: Nous outils principaux sont : Debian, Puppet, Git et Jenkins.

source: The most important, and larger pieces on our roadmap currently are:
fr: Le plus important, et de larges parts de notre feuille de route sont actuellement :

source: Continuous Integration: we want to drastically cut down the amount of work needed to prepare a Tails release; we also want to detect regressions as soon as possible. Everything we merge should go through an automated test suite, and our Debian packages should be automatically built from Git tags.
fr: L'intégration continue : nous voulons réduire drastiquement la quantité de travail nécessaire à la préparation d'une version de Tails ; nous voulons également détecter les régressions le plus vite possible. Tout ce que nous fusionnons devrait passer par une suite de tests automatisés, et nos paquets Debian devraient être construits automatiquement à partir d'étiquettes Git.

source: Freezable APT repository: we need to freeze our APT repository when we freeze our release branch; this is also a first and important milestone on our way towards reproducible builds.
fr: Dépôt APT figé : nous avons besoin de figer notre dépôt APT lorsque nous figeons nos branches de publication ; il s'agit également d'une première étape importante sur la voie des versions reproductibles.

source: Exciting, uh? Needless to say, we also have plenty of smaller tasks on our plate :)
fr: Excitant hein ? Inutile de dire que nous avons également beaucoup de petites tâches à accomplir :)

source: How can I help?
fr: Comment pouvez-vous aider ?

source: There are many ways to give us a hand in this area. [[Read more about it|contribute/how/sysadmin]]!
fr: Il y a beaucoup de manières de nous donner un coup de main dans ce domaine. [[Apprenez-en plus à ce sujet|contribute/how/sysadmin]] !

source: When getting in touch with us, please attach a patch, or your plans, for a ticket marked *Easy*: this way, you can quickly get up to speed, and we can get used to working together. Of course, if the ticket you want to work on lacks the information you need to resolve it, don't hesitate asking us for clarification first.
fr: Lorsque vous nous contactez, merci de joindre un correctif, ou vos idées, pour un ticket marqué *Facile* : de cette manière, vous pourrez rapidement vous mettre au travail, et nous pourrons nous habituer à travailler ensemble. Bien sûr, si le ticket sur lequel vous voulez travailler ne contient pas les informations dont vous avez besoin pour le résoudre, n'hésitez pas à d'abord nous demander des éclaircissements.
