Repository: KaushalIngle/CuOS
Catalog: wiki/src/news/plans_for_2021.*.po
Languages: es

source: [[!meta title="Our plans for 2021"]]
es: [[!meta title="Nuestros planes para 2021"]]

source: In 2021, we want to focus on improving some of the very core features of Tails, especially for **censorship circumvention**.
es: En el 2021, queremos concentrarnos en mejorar algunas de las funcionalidades centrales de Tails, especialmente en **evadir la censura**.

source: To support our work in 2021, take a minute now to <a href="https://tails.boum.org/donate/?r=pt">donate and fight surveillance and censorship</a>!
es: ¡Para apoyar nuestro trabajo en 2021, tómate un minuto ahora para <a href="https://tails.boum.org/donate/?r=pt">donar y luchar contra la vigilancia y la censura</a>!

source: Censorship circumvention
es: Evadir la censura

source: We want to completely redesign how to **start Tor and configure Tor bridges**.
es: Queremos rediseñar completamente cómo **iniciar Tor y configurar puentes de Tor**.

source: This will make it easier for people in countries where accessing Tor is blocked to circumvent censorship. According to data from the Tor project, the top 5 countries by users of Tor bridges are Russia, Iran, the US, Belarus, and China.
es: Esto hará más fácil evadir la censura a gente en países donde se bloquea el acceso a Tor. De acuerdo con los datos del Proyecto Tor, el top 5 de países por usuarios de puentes de Tor son Rusia, Irán, los EEUU, Bielorrusia, y China.

source: Persistent Storage
es: Almacenamiento Persistente

source: We want to improve the interface of the **Persistent Storage settings**.
es: Queremos mejorar la interface de la **configuración del Almacenamiento Persistente**.

source: Improving the Persistent Storage was your top priority when we surveyed our users in July. We want to start by improving the usability of its core features and rewriting this 9-year-old Perl application into Python GTK+. This will make it possible to improve it faster in the future.
es: Mejorar el Almacenamiento Persistente era nuestra mayor prioridad cuando encuestamos a los usuarios en julio. Queremos empezar mejorando la usabilidad de sus funcionalidades centrales y reescribiendo está aplicación en Perl de hace 9 años a una en Python GTK+. Esto hará mejorarla más rapidamente en el futuro.

source: We also want to make it possible to persist Tor bridges.
es: También queremos hacer posible guardar los puentes de Tor de manera persistente.

source: Security and maintenance
es: Seguridad y mantenimiento

source: To improve the security of all applications in Tails, we want to **migrate to <em>Wayland</em>**. *Wayland* is a new display system for Linux that better controls how each application interacts with the rest of the system.
es: Para mejorar la seguridad de todas las aplicaciones en Tails, queremos **migrar a <em>Wayland</em>**. *Wayland* es un nuevo sistema de visualización para Linux que controla mejor como interactuan las aplicaciones con el resto del sistema.

source: For example, *Wayland* will fix how the [[*Unsafe Browser* can be used to deanonymize you|doc/anonymous_internet/unsafe_browser#security]].
es: Por ejemplo, *Wayland* corregirá [[la forma en que se puede usar el *Navegador Inseguro* para desanonimizarte|doc/anonymous_internet/unsafe_browser#security]].

source: Help us fight surveillance and censorship
es: Ayúdanos a combatir la vigilancia y la censura

source: <div class="cfa"><a href="https://tails.boum.org/donate/?r=pb">Donate</a></div>
es: <div class="cfa"><a href="https://tails.boum.org/donate/?r=pb">Donar</a></div>
