Repository: KaushalIngle/CuOS
Catalog: wiki/src/news/tails-support.*.po
Languages: es

source: [[!meta title="Tails user support mailing list"]]
es: [[!meta title="Lista correos de soporte de usuarios de Tails"]]

source: After we closed off our forum in June, the Tails community was left without a public user support channel apart from IRC.
es: Después de que cerramos nuestro foro en junio, la comunidad de Tails se quedó sin un canal público de soporte, aparte de IRC.

source: Introducing tails-support@boum.org
es: Introduciendo tails-support@boum.org

source: To compensate this loss, we decided to create a new public mailing list for user support.
es: Para compensar esta pérdida, decidimos crear una nueva lista de correos pública para soporte de personas usuarias.

source: This list is **the right place** for:
es: Este es ¨**el lugar adecuado** para:

source: **User support**: solving doubts about how to use Tails, security implications of Tails, etc.
es: **Soporte a usuarios**: resolver dudas sobre cómo usar Tails, sus implicaciones de seguridad, etc.

source: This list is **the wrong place** for:
es: Esta lista es **el lugar equivocado** para:

source: Some reasons behind this decision
es: Algunas razones detrás de esta decisión

source: Since 2012, we worked on replacing the old forum with a question and answer application. We hoped we could have a shared application with The Tor Project that was heading in the same direction. For many reasons this did not happen.
es: Desde el 2012 hemos trabajado en la sustitución del antiguo foro con una aplicación de preguntas y respuestas. Esperábamos tener una aplicación compartida con The Tor Project que se dirigía en la misma dirección, pero por muchas razones esto no sucedió.

source: To solve this we decided to:
es: Para solucionarlo decidimos:

source: Setup a support mailing list as a new public channel for user support with the help of the Tails community.
es: Configurar una lista de correo de soporte como un nuevo canal público para el soporte de usuarios con la ayuda de la comunidad Tails.

source: Gather frequently asked questions from the forum and the list on our website.
es: Reunir las preguntas más frecuentes del foro y la lista en nuestro sitio web.

source: On the long-run, have Askbot into Debian and improve it with the features we need.
es: Y a largo plazo, tener Askbot en Debian y mejorarlo con las características que necesitamos.

source: See the corresponding ticket: [[!tails_ticket 5984]].
es: Ve el ticket correspondiente: [[!tails_ticket 5984]].
