Repository: KaushalIngle/CuOS
Catalog: wiki/src/news/version_4.17.*.po
Languages: fr

source: [[!meta title="Tails 4.17 is out"]]
fr: [[!meta title="Tails 4.17 est sorti"]]

source: This release fixes known security vulnerabilities. You should upgrade as soon as possible.
fr: Cette version corrige des failles de sécurité connues. Vous devriez mettre à jour dès que possible.

source: <h1 id="upgrades">Reliability improvements to automatic upgrades</h1>
fr: <h1 id="upgrades">Amélioration de la fiabilité des mises à jour automatiques</h1>

source: - Repair automatically the file system used during upgrades.
fr: - Réparation automatique du système de fichiers utilisé pendant les mises à jour.

source: Automatic upgrades were sometimes failing even after doing a manual upgrade because of an unclean file system. ([[!tails_ticket 17902]])
fr: Les mises à jour automatiques pouvaient parfois échouer même après avoir fait une mise à jour manuelle à cause d'un système de fichier corrompu. ([[!tails_ticket 17902]])

source: - Resume automatically when the download of an upgrade fails.
fr: - Reprise automatique lorsque le téléchargement d'une mise à jour a échoué.

source: <h1 id="changes">Other changes and updates</h1>
fr: <h1 id="changes">Autres changements et mises à jour</h1>

source: - Update *Tor Browser* to [10.0.14](https://blog.torproject.org/new-release-tor-browser-10014).
fr: - Mise à jour du *Navigateur Tor* vers la version [10.0.14](https://blog.torproject.org/new-release-tor-browser-10014).

source: - Update *Thunderbird* to [78.8.0](https://www.thunderbird.net/en-US/thunderbird/78.8.0/releasenotes/).
fr: - Mise à jour de *Thunderbird* vers la version [78.8.0](https://www.thunderbird.net/en-US/thunderbird/78.8.0/releasenotes/).

source: - Update *Tor* to 0.4.5.7.
fr: - Mise à jour de *Tor* vers la version 0.4.5.7.

source: - Update *GRUB* to [2.04-16](https://www.debian.org/security/2020-GRUB-UEFI-SecureBoot/).
fr: - Mise à jour de *GRUB* vers la version [2.04-16](https://www.debian.org/security/2020-GRUB-UEFI-SecureBoot/).

source: Update some firmware packages. This should improve the support for some Wi-Fi interfaces, especially Intel, Broadcom, and Cypress interfaces.
fr: Mise à jour de quelques paquets de micrologiciels. Cela devrait améliorer le support de certaines interfaces Wi-Fi, en particulier celles de Intel, Broadcom, and Cypress.

source: <h1 id="fixes">Fixed problems</h1>
fr: <h1 id="fixes">Problèmes corrigés</h1>

source: - Improve the error message when starting the *Unsafe Browser* while offline. ([[!tails_ticket 12251]])
fr: - Amélioration du message d'erreur lors du lancement du *Navigateur non sécurisé* en étant non connecté. ([[!tails_ticket 12251]])

source: [[!img unsafe.png link="no" alt="New error message: You are not connected to a local network yet."]]
fr: [[!img unsafe.png link="no" alt="Nouveau message d'erreur : vous n'êtes pas encore connecté à un réseau local."]]

source: For more details, read our [[!tails_gitweb debian/changelog desc="changelog"]].
fr: Pour plus de détails, lisez notre [[!tails_gitweb debian/changelog desc="liste des changements"]].

source: <h1 id="issues">Known issues</h1>
fr: <h1 id="issues">Problèmes connus</h1>

source: [[!inline pages="news/version_4.14/broken_upgrades" raw="yes" sort="age"]]
fr: [[!inline pages="news/version_4.14/broken_upgrades.fr" raw="yes" sort="age"]]

source: See the list of [[long-standing issues|support/known_issues]].
fr: Voir la liste des [[problèmes connus de longue date|support/known_issues]].

source: <h1 id="get">Get Tails 4.17</h1>
fr: <h1 id="get">Obtenir Tails 4.17</h1>

source: To upgrade your Tails USB stick and keep your persistent storage
fr: Pour mettre à jour votre clé USB Tails et conserver votre stockage persistant

source: Automatic upgrades are broken from Tails 4.14 and earlier. See the <a href="#broken-upgrades">known issue above</a>.
fr: Les mises à jour automatiques sont cassées depuis Tails 4.14 et plus ancien. Voir les <a href="#broken-upgrades">problèmes connus ci-dessus</a>.

source: - Automatic upgrades are available from Tails 4.14 or later to 4.17.
fr: - Les mises à jour automatiques sont disponibles de Tails 4.14 ou plus récent vers la version 4.17.

source: If you cannot do an automatic upgrade or if Tails fails to start after an automatic upgrade, please try to do a [[manual upgrade|doc/upgrade/#manual]].
fr: Si vous ne pouvez pas faire une mise à jour automatique ou si le démarrage de Tails échoue après une mise à jour automatique, merci d'essayer de faire une [[mise à jour manuelle|doc/upgrade/#manual]].

source: To install Tails on a new USB stick
fr: Pour installer Tails sur une nouvelle clé USB

source: Follow our installation instructions:
fr: Suivez nos instructions d'installation :

source: [[Install from Windows|install/windows]]
fr: [[Installer depuis Windows|install/windows]]

source: [[Install from macOS|install/mac]]
fr: [[Installer depuis macOS|install/mac]]

source: [[Install from Linux|install/linux]]
fr: [[Installer depuis Linux|install/linux]]

source: <div class="caution"><p>The Persistent Storage on the USB stick will be lost if you install instead of upgrading.</p></div>
fr: <div class="caution"><p>Le stockage persistant de la clé USB sera perdu si vous faites une installation au lieu d'une mise à jour.</p></div>

source: To download only
fr: Pour seulement télécharger

source: If you don't need installation or upgrade instructions, you can download Tails 4.17 directly:
fr: Si vous n'avez pas besoin d'instructions d'installation ou de mise à jour, vous pouvez télécharger directement Tails 4.17 :

source: [[For USB sticks (USB image)|install/download]]
fr: [[Pour clés USB (image USB)|install/download]]

source: [[For DVDs and virtual machines (ISO image)|install/download-iso]]
fr: [[Pour DVD et machines virtuelles (image ISO)|install/download-iso]]

source: <h1 id="next">What's coming up?</h1>
fr: <h1 id="next">Et ensuite ?</h1>

source: Tails 4.18 is [[scheduled|contribute/calendar]] for April 20.
fr: Tails 4.18 est [[prévu|contribute/calendar]] pour le 20 avril.

source: Have a look at our [[!tails_roadmap]] to see where we are heading to.
fr: Jetez un œil à notre [[feuille de route|contribute/roadmap]] pour savoir ce que nous avons en tête.

source: We need your help and there are many ways to [[contribute to Tails|contribute]] (<a href="https://tails.boum.org/donate/?r=4.17">donating</a> is only one of them). Come [[talk to us|about/contact#tails-dev]]!
fr: Nous avons besoin de votre aide et il y a de nombreuses manières de [[contribuer à Tails|contribute]] (<a href="https://tails.boum.org/donate/?r=4.17">faire un don</a> est seulement l'une d'entre elles). Venez [[discuter avec nous|about/contact#tails-dev]] !
