Repository: KaushalIngle/CuOS
Catalog: wiki/src/news/version_4.14.*.po
Languages: es

source: [[!meta title="Tails 4.14 is out"]]
es: [[!meta title="Ha salido Tails 4.14"]]

source: This release fixes [[many security vulnerabilities|security/Numerous_security_holes_in_4.13]]. You should upgrade as soon as possible.
es: Esta versión corrige [[muchas vulnerabilidades de seguridad|security/Numerous_security_holes_in_4.13]]. Debes actualizar lo antes posible.

source: <h1 id="changes">Changes and updates</h1>
es: <h1 id="changes">Cambios y actualizaciones</h1>

source: Add support for the Ledger hardware wallets in *Electrum*. ([[!tails_ticket 15353]])
es: Añade soporte para las carteras de hardware Ledger en *Electrum*. ([[!tails_ticket 15353]])

source: - Update *Tor Browser* to [10.0.7](https://blog.torproject.org/new-release-tor-browser-1007).
es: - Actualiza el *Navegador Tor* a [10.0.7](https://blog.torproject.org/new-release-tor-browser-1007).

source: - Update *Thunderbird* to [78.5.1](https://www.thunderbird.net/en-US/thunderbird/78.5.1/releasenotes/).
es: - Actualiza *Thunderbird* a [78.5.1](https://www.thunderbird.net/en-US/thunderbird/78.5.1/releasenotes/).

source: Update *Linux* to 5.9. This should improve the support for newer hardware (graphics, Wi-Fi, etc.).
es: Actualiza *Linux* a 5.9. Esto debería mejorar el soporte para hardware nuevo (gráficos, wifi, etc.).

source: - Remove the *Unifont* font. ([[!tails_mr 263]])
es: - Remueve la tipografía *Unifont*. ([[!tails_mr 263]])

source: <h1 id="fixes">Fixed problems</h1>
es: <h1 id="fixes">Problemas arreglados</h1>

source: Fix Additional Software by updating the APT key for `deb.torproject.org`. ([[!tails_ticket 18042]])
es: Arregla Software Adicional renovando la clave de APT para `deb.torproject.org`. ([[!tails_ticket 18042]])

source: Fix changing the administration password stored in the Persistent Storage. ([[!tails_ticket 18018]])
es: Arregla el cambio de contraseña de administración almacenada en el Almacenamiento Persistente. ([[!tails_ticket 18018]])

source: Fix opening the Persistent Storage of another Tails USB stick in the *Files* browser. ([[!tails_ticket 18050]])
es: Arregla la apertura del Almacenamiento Persistente de otra memoria USB de Tails en el navegador de *Archivos*. ([[!tails_ticket 18050]])

source: For more details, read our [[!tails_gitweb debian/changelog desc="changelog"]].
es: Para más detalles, lee nuestro [[!tails_gitweb debian/changelog desc="changelog"]].

source: <h1 id="issues">Known issues</h1>
es: <h1 id="issues">Problemas conocidos</h1>

source: See the list of [[long-standing issues|support/known_issues]].
es: Mira la lista de [[problemas duraderos|support/known_issues]].

source: <h1 id="get">Get Tails 4.14</h1>
es: <h1 id="get">Obtener Tails 4.14</h1>

source: To upgrade your Tails USB stick and keep your persistent storage
es: Para actualizar Tails y mantener tu almacenamiento persistente

source: - Automatic upgrades are available from Tails 4.2 or later to 4.14.
es: - Están disponibles actualizaciones automáticas de Tails 4.2 o posterior a 4.14.

source: If you cannot do an automatic upgrade or if Tails fails to start after an automatic upgrade, please try to do a [[manual upgrade|doc/upgrade/#manual]].
es: Si no puedes hacer una actualización automática, o si Tails falla al iniciar después de una actualización automática, intenta hacer una [[actualización manual|doc/upgrade#manual]].

source: To install Tails on a new USB stick
es: Para instalar Tails en una nueva memoria USB

source: Follow our installation instructions:
es: Sigue nuestras instrucciones de instalación:

source: [[Install from Windows|install/windows]]
es: [[Instalar desde Windows|install/windows]]

source: [[Install from macOS|install/mac]]
es: [[Instalar desde macOS|install/mac]]

source: [[Install from Linux|install/linux]]
es: [[Instalar desde Linux|install/linux]]

source: <div class="caution"><p>The Persistent Storage on the USB stick will be lost if you install instead of upgrading.</p></div>
es: <div class="caution"><p>El Almacenamiento Persistente en la memoria USB se perderá si instalas en vez de actualizar.</p></div>

source: To download only
es: Para sólo descargar

source: [[For USB sticks (USB image)|install/download]]
es: [[Para memorias USB (imagen USB)|install/download]]

source: Have a look at our [[!tails_roadmap]] to see where we are heading to.
es: Echa un vistazo a nuestro [[!tails_roadmap]] para ver hacia dónde nos dirigimos.
